pico-8 cartridge // http://www.pico-8.com
version 43
__lua__
_a=all _b=rectfill _c=split _d=flr _e=sspr _f=sub _g=palt _h=circfill _i=true _j=false
function _lp(d,m)local p=_c(d,m,_j)local o=p[1]for i=2,#p do local q=p[i]local a=_f(o,#o-(ord(q,1)-35)*85-ord(q,2)+36)local n=ord(q,3)-35 while n>0 do o..=_f(a,1,min(n,#a))n-=#a end o..=_f(q,4)end return o end
function _ut(L,hZ)local ey=_c(L,hZ or"~",_j)L=ey[1]for i=2,#ey do
if aJ and stat(1)>.35 then yield()end
local p=ey[i]local bh=tonum("0x".._f(p,4,5))local ez=_f(L,-tonum("0x".._f(p,1,3)))while bh>0 do L..=_f(ez,1,bh)bh-=#ez end
L..=_f(p,6)end
return L
end
for d in _a({[[le	$ロbンつワXレmロ😐ンねヲョンさルたル/ツレnャ>ワ}レ&けくルマはロ…ほルHワりルゆャ⧗2ル8ルHタヲナャ⧗2ル∧Dきみャ8ン=マワXレmくツルせロれル%ルろEた
ld	$ワ0▤/ロあワみレ█ャsルmろ?ンそ1ロッッ2ワシレoャxュjロZルZレ:Qヲムュ|ヲモルhニンzルハャGレyは.レJ6ャ>ワオえルaQルウル◆ヲ`ワoレzレ|ロYルハレRアワかレトヲフ3レヘ/ャ>/7★|v★ロ-レ◜ロYロれレ)ろソッOレクへとワっせャヲエ5ルた●ソヘワhャYソレ▥ソワ(ルHヲチ★ャリせャヲンぬンカロョレクッaワルロyレXルやレlnノロむロeャ|ルッWれ1ル😐ワ⌂Wャネ7ッkみワ7ンXルワロ◝レ}4ヲ^ロクッ7▒ンX
lb	$ンのろ"#m3ロ+ヲF●ャリヲチンエルjレ6ャUロま1ワにルッE★ャリル▒レてレたはンえロUュkレ)ロUfたレ+ロコ
kz	$ル1`ロすロ▒bルOンjひッャヲシルZレ(ワつルゃcルヌュ`ハン…レ{ワンほル░ぬワゅンjル=レ▒ュ☉ル/
ky	$ヲN/ュdルE2ワサロホロ◆ッすあワ▥@ンりロホへル◆ッすルほワ▥Aンりロホゃル◆ッすロcワ▥Cンりッ5_ワフ.ム/baˇレMルl5ba.ぬン⧗2ˇレ@ワHヲgルkkッそン ルキュ`レちロ😐ル2ッoルヌロmルNウワ_レ]ウロ|ルEワヨもワlヲツルhロX"#@+ルEッ@サレ|ュ✽ワ'ルE2ワセレHヲょ2ルやッoょル◆レホ7るワ)fkッそッ7▤ュ0レュル3レ✽ワA☉ッたン[0ワAル2ッたロフ7ワAッ!ッたン[1ヲょ3ヲ…ッたレ>シ7.ッちッた
kx	$ルきfRリルrレzル!レへRユル7レへSロけ▥レや.ロ5レてホッロロ5ン…ワIルUッきルoレいッくル☉くレ▒ッくヌ1ほロ>fS▒ル=ルmルZレねッさルSャクッさルhレャッさルたャ^ッさル😐ル,0ッさル░ュ🐱サるルHュ░ヲsルヨュmロYュ✽わワ*Rょレ;3ロ#るルHレロュ░レュュ✽ルカRゃルoあ1ロホ☉ャJル░ュ🐱ルHュ░れ.ワdヲyル[もオけル[ルHオはンよヲBx▒ワ∧ワ6ロホへュ+ルゃbわヲサロ]ッdルッmへヲU4ンjル=ュ8ュ●ンDンヘレゅモンoツャA/ュ●ヲレッeル░レRンoワj☉ル█リ2ュ●ルヌワcレ"#6*ンmリ5ュ●ヲ~5"$F+ルO.ュ♥ルm.ワ6レゅュHンjル●ワ6ロ▒bあ0ュ♥ルハあ.ュ}ンjル●ルフ.ンゅ0ルフ1").*あ5ワdュˇル@ヲBBきンゅ5ロホャuロ◆ッすレ∧4ロ▒Sュ▒ルゃSルエルY0ルヨュmュ♥ロホへヲ?6ルッmょルoルめ5ヲそらレ~ンとュ☉レ(ュLンoン…レ{は1ほルね5ルク/▥ンpンqッせレhワ)_Cンqヲ)ル6ロッ/ワ▥ャzルク/レ❎/ルハレ∧/ロ▒Sレい7ュ♥レ=웃Rヲんロそょワへ0レIりレふャクヲVレけンさ1ル_っュ웃ンスヒルク7😐ッロュ웃ヲ'ュ웃ルヨcロけルちCユレHわ☉ロカl~レ~ロZヲそロょヲ(らレ▒3ルと4ょヲた😐ッロロヘヲたヲ'マヲたロうロゆc"%#)ン2レ❎.ル🐱Sュ⌂ルt1くレ❎/ロホャラロいル🐱Tり"$w)ルウロ?ュ😐ワ$レ❎2ヤレ❎4ュ✽ロc3ルハロc1ロホょルわワ}ワ▥ロケレ)0ュ}レ)1ヤレ+ロしもル█ロc6ヲそ웃Rウヲわンけヲユ⧗ャ4ヒレ+4ルハレて4ヲ(らンnらル🐱Bら"$6(ラ"$S(Fレ+4
kv	$aルL6ルfルゃRルウルcロ`ルl_"#1(ワKaロ`ルlルへやルゃRワせaロ`ル🐱Rユッ0웃fQヲそユン[4ャノlレ|ンてヲヤュ~ヲ♪ュ~ュ4ュ~レeワqュ~ヲhいッyルうワめル⧗レ◝7웃ッyレeルニ4웃ッy
kt	$aルシオシレ✽ンiレ7ワAルサレナル_▤オル&77ンi11ワwルゅくもレナン[2ルサレ◜
kn	$ルきレほュBンヒfPルZワ◝ルE/ュdッ6ロ😐ロ:4ヲョャけルEワオもワ)ig⌂レ◜ロれレ▒ル░ヲTッhッ5ン#ル░はレ…ヲQャ😐fッbヲRル░ヌュyンゆ😐ルそfhンUウはやワ2ンしワ&をは.ルwャョレュル░をュyワ'ルE/ワ5レュル*4ルE0ワサッおルQュu.レHロいょウルこやル▒ュzけルoみJ⌂ワ∧ュ0ッおルQル▒ュzル☉ュu7ルたりル😐ャクンほヲU6レHロシンgルこヲフルHャuくルNけルHくンgルHルjャ]ンcツンhンむル%2ル%7ッお☉レあ2ルEワ}ル!レHワ)fhンUロワルやッ7⌂ュ0ワcロき
kl"&'1レャルすワ=レテロネルこュyルYレ/Aワ◝ヒルクロネぬルこほルわ0ヲHルEロaル!レ)ッおけ"$m)ルoワるレ/ロ.ニロ.ヒロャロネをュyヲ&ロきンきル░ャ+ッお☉ャつレ/ロ.ル,ルS웃レほシロアル◆☉レhせレほル&ロHル◆けンなヲ'ル☉ュ{ンッッか♪`レ5♪ヲし▥レや0ロそマレ;4ルと2レlこル*4ワ∧ロネ"&G*レpれ.レ/ロ.らワ∧ヲLロき
kk	$ヲIaロケいヲqいレほひレらレ(ルヒワひンLヲをヲえレへPレ(ロシルテ"(V(ワ▥hたッ5ン#レH0ルゅロカま0ャさッ-ルrワ웃ル!
kj	$ヲNロ7ム6レノッホ
kb	$ッxルZニ`Pレレル;sル/ル🐱@りンfヲ█ヲ?ッ6ワハンfレ✽レヲレyロ!レうモュPレ…ワるルをjkわレてャ😐ルG▒ルlcッ-レ/jュmレ+ッ5cロjュn"#;(レ%ル4ia~"#a+ヲうレうンゆロeレHルやロカヲセワシウル8レoウル∧ヲくャャワ%ヲ Qル4bA⌂
ka	$ンヲロろルZ웃Mルメワ2ルメル8ンへレoルあえネワゃレ6ンナ0ヲ{レチほッ😐ウッ😐ルノン<みルるルとャヒ"#3(ュoレそみルるュrぬヲひほュ_ほルやル?Xノュrル☉ュ_ル)ッい"#<)ウル☉ルjッいュrロノュ_6く"#H)ロ#ルメくル%ワキ
kY	$ヲりひロKル.ほロ:もンム}ワTヲSヲPャ1サ}レ6ル😐ルえ2ロKル.ロ█レnルHルNロKャXGルyロKルkンこレ=ロゆ_レルレIルえ2★5レ▥5ヘマャ1ャa5ルy★5ルkレZ,2ンマきレふワ♥レ▥5レ▥5ャHルoレRロKャフャH★5ル.ルエレゅルゃHみ?~ュsレけャGル@ルムルれロュレ∧ワラロSoル=ャンレ❎ワラル.●ャp"#5)●ヤ/⌂ヲcャ⧗1ルo
kX	$gワ♥ワ#ロ◆ヲ`4ワo6ワンヲBッ~れワラワ#りロKワ#ほル%ャMロKュあル▒ルYホねャPレ%ルCロa"$N)ヲレ"%C(ッR☉ルcロ9ッ♪ンっワラュあロ_ッn⧗ルク
kU	$ロbらルCロシワねルンンくくょくアjBるヲ<ッ♪ンっルをjCあク🐱vヲホレよ★ンdほルンヲ●ヘヲろレˇくけくワdルCロいルvレ▒ルをLン%ワへ"#K(★ンdほンけ"#I*ルン★レまワ_レ▒クレまM웃OロyヲエウンEヲ●ス?ひワdルCワ=ルvレソqウロの
kT	$ンのロ◜/ひルろ_たロま/ワに
kM")W*UせGンえッEレやワmンさルhヲホレよルンヲ<ル6ウンcロナヲつ5サルマウサヲ<ゃレトャuくワrルsン=ル7ヲつ6ワねュ▤ヲッンくュ▤ワhヲ<ャlワ+レ)ヲつ7ャjレンルメワぬ0ワねュ▤ヌほンくュ▤ょほヲ<ャlルsワキ
kL	$ャ❎Cわレワロeレタャせnたヲつレコ▥ルLレDロ7}nンsま/をワゅヲつ3ンMル#▒レaヲgャおHル~Cワょレ✽えルキュ`ほヲつ4ワlレ◜
kK"#m(ュ▒ャノnル▒れルちCユル%レとCャGせンsルウルYルちC웃ンs☉ル:ロng~ワネnュ⌂ャ♥ヲつワセルク
kG	$ワ,agロ◆ルすロ,ンi67レとgけレ█ルZレ(7.ルすャ◜レラホュ9ロテせdLほレmゃルせンしルmヲつンテルwえヲ★ャq
kF	$ヲN62ュ◆ッなヲMホレ(64"#Z)ルZワ▤ル~gルSロXル67ょル64ルcfp▤ッな5もウヲすルwヲfュ`ほもえロサgはくテヲすヲツ
kE	$ルき_tけロ░ワ▥Dたゆ"$D)ッnロ▤ルやロカj~ワ▥Eたンゅッと3ュ◆ッ4Bレpレlルゆホレ(5"$?*ッEンつワmレヘ3ンね.ウルヌルpヲ◝ルたロゆBウとッと6ンrヲyヲユロFロ]ヲ&ッと7サレ|ンき😐ュ❎ヌンrンオンミレみル░ょュ|ル😐ュ9aロ9}ロJロセルgウュ/ウょル◆シロ2るワAヲすッkンYル@"'I(ンrュ#ルゅレみヲキン=レ❎ッなワサ
kD"%5*ワへレ░ルYルちャ❎gヒレiLュ⌂レとgはルエルめヲ(らルねルクヤレ▒ワnル█レてル🐱BャT`Bサヲわルヌるヒツロ[レ+レ░ャ+ュ∧レpロ&ュ}ワ∧ュ∧ツレ;0ヲ(ル,ルちgら"#o(ワ∧ュ∧マレ}.ュlロXッ9レヘ7ロま2ル@くュ웃ッ▤レュワ∧ヲLャニしれ2レk2レIひヲわルヌレレュ∧レpワ*`Bょルエッdレk6ル😐ロゆBレふレゆルcロ9レゅュ/ッえレ█1ロうレ(52ンMロスル,ワ▒らヲ$ワ█ルUロi1ルAヲサッMュw▒0レけュGロスッ⧗ンみワ▒ッ⧗ヲ~3レふン2レuルムくルヌ");(ワ6レふル,3レけルムロりルNン]ˇルケ"$l)レけヲた
kC	$ヲNャュュ◆ホらワょ0ルUウャけロ😐ワ;ルヌンク5ルNロ:ロRルヌへワ2ヲ+ルNルたひンo"DK)ュ#ゃヲち7ュˇヲツルUょレン.ロヘュ{ンJッかッこレ∧レ%もャ♥サャ♥ロカm⌂レ)ッと.ュˇヲツッくヒル%ル😐ッし"#Q,oルまッかッこッと/ル@オワ)iGスmンiュ★ル@オルす50ンi51レ◜ッ4bレlルゆ
kB	$ヲNワ웃ュ◆ヲ{ルQルあッちルcャせn▤ッ4Tキヲくンヒ`TュhュtルZロゆTルあくルUウンさルEッVえレ|ッくルQくルmンへンノッつルキワnヲU2ル😐ンp▤レ=ッつル@レルテカノワ'レゅヲ)ヌンふル@ツテル&ヲ⧗ャtルSロょルウルEワロャねルっルウルっレむル@レむル@ルウンあワyレゅレむルっワKしヲカルEルレルっン▥"#@)ヲツワyルEロリ"#X+ッリワKルsレュレゅヲ)けレ;6ルEロヨャねッリワKワ+ル*6レゅヲ)ル6ンふル@ュ♪へュu0レIッつルaCルキテルEロリッリレむルムルウルムワKルsル%0ワのレ)ルEヲまャねルaCツテルウもヲツレふらロうッつルキュbレFルめ4ル😐ンpフルみレゆルウルみレゆレむロ~0ロ~/ヲ$レゆヲ)ルU/レrくュ…ル▒ロョレuレrほュ…ルあくルAルめ2ヲおレゆッせュZロゆcレけ"(`(ャZマル[ュvオをワツッˇひ1ルp&~レpオヲ`ャc1ッてをワぬホ5ひ4ッてょるをルU1けレQヲかゃロ░2ュ[りルゅほホ7ら1ルUロR7ルAあ0ルZ.らワ;6ヲcほルU3マレ█5ルE3ロR/ウワ;ロi6ヲヘルm5ル░.ヲTあ.ルEン◜レu"#;(ロR3ンあルフ.ュ[ひ6ヒルm0ヲちワ;ンテ0ル@ル6ッX▤ュ^ヲちンテンテレそロiンニ3"#9)ノルU1ッてュvあ6ッkュ♪レuワhワGマル)レハ⌂ルフ6ルU3マヲ?/ヲちロi"#Z)5ヲヘュ^ルZ/ひ2ャZルすュ★るロi1レpさっルすルタッえテッ ッヘヲす"%c(ワAワUル@ゃルぬ"0Q)ヲち3ウンテ/ウ/ヲ★ロナワGえ3ヲヘュIレふワろヒュ8"5\,ち4ュ…ュ😐ッwル8"'0("#.)ルまロFル😐ンpンqヲちロあッkッせモッえテ"+p)ッせッOッえテヲ★7ルエヲi5ワぬ.ル2ヲ+ぬャョ",),A	$レのンpンqン ヲ)ャ♪ツテル░ル6ロッヲそレねンnひュ♪ッ2ッ}えヲよfl~ルUロワへル▒ロ+ヲ◆ッfル=レeンNャハレeワ☉⌂ユロコル░ルゅルせぬレ█7レ░レpッhレたはレヲウルゅレ;2ンノレやワnュ|ッ}ル:M▒ワのヲRワyンら4ンかレ;7ルろッ1ュUルろjたレた☉レヲャ…ュ!ロン●ンKッ◜ルスャ,ャミレたッaレクへレ█1ュl웃Bュ1ょンなッ9ャA0"#o)ッ▤ンヘ"$7(ャ…レ█0ワeレややレ~ワスレIらレふレねヲVレけルAヲサ"#O)ンスヲ~5ルm0ュUンうレ█6ヲえュSル●ュ=ルタル=ュUヲ*☉ロ░3ャ(ワ.ルvャ9ンはらャオヲ*けロッ.ャ(2ロ;ヲえワワル★ロ>ンN⌂ユッ^⌂ユワヲル=ルちdユレiHル●ャッッS@らンうヲ?7ュSル●ルね7ヲ*へロッ2"$\,ヲ*ゃワゅ6ャ(3ワんッ*ル●ンかワゅ1ワYロHルちxらヲFレBレ#ヲvレa5ッNャハワYロ◝ヲHンたヲ*ょワへ1ュ=ルヒユヲをレ>7ルやュJヲ*マワへ4ン[ロAU▒ヲ*ツレQウヌンえ7ヲえワdツ"G^(ル:ヲクル░ヌンえ0ルrロaもュJレ❎6レ░ャラロaッ░レ~aたレ❎6ッ░ルろンFヲ*をルわレ✽ャ*ル★ルス4らヲっル★ヲょとロンヲX/オ★ンKロ@レ)4ワレレlャ@
jy	$ンヲワセ"^J+ルFTモルあロオルヲルに▒ュjュkルッSレい😐ルそfLワ⧗rロカa▒レ▒ロ▒mレてルろCたレ+
jx"K#)ワクッ{lたル%ュgあャンルフンヒIロふワセンfロ2ルわ0ッ6ロきレ)ンうルわ4ヲマ_Pロカ_"$)(ワyワシッ☉レレル8レo"#+(∧ヲくルをュEッヒアレCレ✽レQアレCヲ█ャtワ▥ュkヲキュjロZヲ'ぬロm2みP⌂ルEロHルテン0▒ロeンfロいャつヲマAャキロむルをfHャ+ルZニfHルEヲ⧗ヲCレ|ヲLルをッ●ンるルSニッ●ルhニ_Pルとルタヲけレ<vワhロ❎レ<wワhャ7ルQャ7レlま2ンXンfレょレあ3ルを"L/)レあ.ルEレツル!ッeルE.ワ5ワシレmャvャxヲマュ?レyツみM⌂ロふワセル73ルをュ<ヲサンうュGヲマュ<ロカa▒ルm.ヲマュ<みワ7ルm/ロき
jv	$ュ-Fレ:FヒヲYッrへル▒ルOッPヲトぬンけレチロqロ?ワイけロ[くルmッrュ..ロッッmワ5ルクホレャルC5レテッrュ/ルaMゃルわ3ルッFン;ロ+ンはレ:Mヒャ9ロコャャルUロョルaMッャワ*_Fン;ンゆ"#@+ッrゃッ◝ャオロYャャッrょャJンはロXンまンろワ(ロ{ワ_ワ%ル&やルvン,レ(6ル=ャユ▒ャ:.ルス1レャ.ヲL
ju	$gねdbたリルちqル=ャ;レとqロやルちqル●レる`りルヨ_りルヨ`らルZュT0ンMヲムレJ4ヲモロ>ルよルうえル⧗ロれレ❎ッ_ヲhンら.ろワvャしSャGせルT/レ;2😐ュYル:ヲクンら2▥ねeBたロハレeワqレスンら6レiDロみDヒルみレャヌレテルみャ^ワめレテルけレEャムワみレ}7ルハれ5ルろTたュ8レk7ルッSヲサルハリ7ルヨr웃ンルヒろンルロ♪Lルキルエヲい".s)ヲえヲh"$<*ル76ンみヲシ/ヲコル[レ2ロrワわュHヲシ2ヲYル😐ッ8レルク4yeM●ャpワzッ:ルナ51ッ:ッ$ルろロケヲ#ル.ッ:シャえルp⧗ヲ#ヘ"#:(QほゆcXたャそャTヲ|ロ<ャLロ]あ5レ~ッ1ルフ5ルろuたヲコルめ/ヤュ^ルハワfTャす2ロUンFュIヲ#ルkOりワEルkOロ<ヲ#ルkN"#0(Nロ<ろTオサルめ7ロUン&ルね7ヲコルY0ッ20ロUャ ヲコルY4ッ24ロUIたヲコルほ.ャヌ.レとqルほ1ャヌ1ルヨル1cqヒろcqレrャW0ルヨqりッMcaンをレp░やレ=ねャPワ)ワ{ヲスンをンっク5yヲウャ1コやャQレやャRほレ▒0"2j(ル,ヲVレけレJレツロ>caっりワ)caっロ<ンスヒレ▒2ヲエャSルろFたヲ^Jンチャ▤
jt	$gら7ルすロ2レテリレ~ロZロきル7
jr	$ャeワチンまTレ▥ロにDくワa●Tヘロ♪EくャDロ;
j"ZL(ロニわレワンヒワアャ'レ(.★ュ&はく★ュ(はンマ⌂ッmヲMルんャzッm4ル!ャ'ひ
jh	$ンのッNッZレ>7ッ[▒
je	$gひはレ}ャg▒36ルテル%ャg▒ン◜ルテ
jc	$ルきルTャホンるッPヲトンDロ♪AレXへッQろFロ♪Aル█ルOヲシろGヲカャI7ルQル█レいレH2ルこャヘヤレ▒ル🐱O웃Gロツ▒ワラル.ワ♥ャフワ(ワラヘワ♥"P#(ワラワテッル.ル🐱Eワ♥ル.レrほロ◜2レね6ヲvャYGヘヒみH▒いャマレソDロ♪BンEいソユルんンFャミルZロゆOルウヲ●ワテロ=ワテルヌン*Dンチン*Eンヌ0ンょルP🐱ヲ-ぬュ!ヲHル32ロろル🐱OルえレょンG▒ワYロ◝ッ*ッSロクユャミルm4"lh(█4ルみロをル⧗ルみルうャ/ャムン(レ░わルオサン∧2ッ*ル=ワcレと?モロ█ル█リ5ルちロクル★ヲyワoル75ルUオロサロクルO3レとロク☉レ█0レeワ☉ャハル3ロアレlャ@ワ6レiCルえッTッUンエワルンこルんャ ルm3ルm4
jb	$ンめはル█ワ*ロxレワ"7,)ャヒいG웃GワっシワヨルテレへAワ♥レ▥{Fルoレキ"SW)レXルあくルエッOぬロKル.ゃ7ほルあロ[ンもFレH/ルゅャヘ
jX	$ヲIチたレiAユルヨFユロるcンサルlワロレ^ュwやル☉ˇレMルみヲ▥ルみッzルみヲトルみ웃Mャムッ,ロ~ルF@ル&5ロ;ワむ.ロ;ワFワサヲPル😐ロX.ンほレヘ2レ=レEルt4ワオル8レIレEンュワTワめル8ル_ノワりルゆルムル8ルっタヲナルムル∧hS~ンむンきルみヲきル.ルみヲきヘロ~.ルけワろルFUル&6/ルvロUTたワと4ワなワFロろロひャ'ルナ61ルテルんャzュcワFュdワFヲMヲ#ル.ワろヲ#ヘン2ルlレょレ^4ッ▥ロスりワ▒レやルUンテ0ルAルO.レ%/けルせルあル8レuッ)ルあル∧ヲくロUUたャさルfレuン⧗ルホヲ◝ムン)ロスッあヲ~2♥ヲ▥ひュ5ル/ッPル★ワよルシ
jW	$aらロオみN~ルZャかヲムャmヲモレ%ル:ワコロれル%ン_6ル!ルと64ワ~ャてャV.ヲとレ`😐ロキVレルゃロAレ{ルたッ8ッ❎レゅルHルキレヘ/ルhれきのルハレゃ_DワせルXヲQル_▤ル{ン0~ヲRッ▤ロコレ=レねレIワ█カノルムレヘ5😐ン/ャとノン0▒レ=ロょヒヲキ😐レBロエルやみO~"GS(ル,ュbレFれ3ロスン/ヲスフル3レzワてワVvレけロ◆ルゅワoャaロ7ヘレけけとヲツ"CR(ワ∧
jV	$t"'C,ワらロ~ン_3ワ😐ロFンへンねヲョレJ/ン_レそャ♥もゃルNワlンシもゃヲnワ+ロれルねルPUルkOレUロ+ン_ンニウレ◜ロコ
jS	$ルきOヲTワっワもわワUせiヲuワgわワ*NヲZワクりル%ンヒNッ∧ワEワˇル)レ6ルUヲZルめセりルねヲ#ワˇヲきワˇハロン웃Nえほン_レコュ3
jR	e	$ロQルへロオワhルq~ャ30ンG~
jQ	$gヲきュ]ルoル[ワEルkヲテレワ"#f)ュ]ほ")V(5ワんレソqル&5/ワEル.ルQャaUヘけンマ⌂ロのン_ロろ
jO	$tニ_dルみニ_eルけロょルけレゆルみレゆヲcルみロょヲc"*J(けロめルみルシロqルみレEロqロ~/ロ~.ルみル/ワb⧗レ&ほルみル★レuくッqロ~1ロ~0ヲおッ⧗ル@ル8ヲかルっルNュZロめワbロ▤レけレuルNッˇッ⧗ルっ"#?(@ワrレはホ5ワろワbロ▤ルムレuルNュ[ッルロqュ3ン<3くヲTレRュvえ3ほル☉ˇレFレRえレそロR5くルAオレそ0ヲラ"#b)ン1ヲラルムルNえ6レけヲnレFオレそ1ヲラルっワrレはレuヲラレけルNえ6ルムヲnレF
jM	$gュYワわるレ2ロSj"/])ヲˇりレ2ロさえほヲSレ⌂ッvレねルr4ロあルP@ロさレUルほャヌレ⌂ロSjル=😐ュYロ4bヲク
jJ	$ンのワY3ロ◜.ひるル&44ワひンL"#Y(
jE	$a웃iンにや4ヲフャCロネヲう.レ█ワよロWル60ほレ/ン?ロWルmロネヲうレうルYワaニン?ルあ☉レyヲうロCル61ン◝ロナルクャEルt4ャaまレつヲSレ/`Pワ◝ッ♥レうュO☉ルtレ✽ュPロCンY"f+(る/☉ルt53ぬレyルノンャレr.ン◝ほ"Be)"h$(…レキュPレうモ"gH(…レて😐ロ}レちルwッ☉レnほッ(ルwッYぬュPロCヌレひ~☉ロ[ルNッ☉ルヲルルbッ~レ+ルをュE7ルわ6ロネヌレうロ&ヲ∧ワ.ルvワハンX"o`(ノˇレFモょ.レy}レ6レキンYレyルノロCルンレ/`Qヲpワi.ル5みャ★くロネロ!レうヲカ"#:)ヲキレ/ッ웃ワ◝ルtッ'5ル8ッ☉レnレ/idワ◝ルノヲら.ルメレyッ)けルせュtくるルメュ>eワ◝ロ!レ…ロョャ⧗3けロ…レyル8ロ!ロG⧗レhレyッ⌂レンゃレhレyロノヲらょレhレyへワャレンマッンロネロ!")Q(レyワjレpエ7レ%ッ|ンサンフロネッ∧6レ}0ルr2ワ5ル%0ロネマ51ル▒ンるヲ∧3ワん"l;)ンX
jD	$ュ:ワつルvュ>Jロ}"(*)ンHヲも
jC	$ュ:ロアルvンHヲもャEルtレ✽ほヲ∧ッTルv
jA	$ワ,_MルUュ/ヲヨレあレソFャキロコルZルナッ%ヲむルrッ&ワlルヌテをルれt⌂ルr.ワセルとルタみンサュ0ヲハルUはとャ-ュ.レ…ロ+ャ♪ュ1ワ&つ7ワ&ワ♪☉ッt.")4(rン'もレ|ロコルUへル▒オ.レX"ER)ュ*☉ルoロ&ワシみロVワハルhひゃ"#j)うルと4サヲy/ンミルモ"sA(ル{みJ⌂ルr.ヲMルUュ.レうモワュレYルoヲxレHロシょレYワュほレWヲj⌂ワy
ix	$ワ,ロ●ルUルノレ…リロるcロVレ+ン❎1ャfントレ◜ルZロゆEルSロゆEントくルヌンナ/ン❎2ウレ|ロ#ル☉くルねワキレHンニルノロCヲ`みM⌂
iu	$ワ,ンキヲわル2ほル[ロ{ルp⧗ワょ0レGハレチをロ|ヲケャ[ルこレうルカロ●ワiレ…ルOルZヲトルwくルmルSロWルこほレトロりルヲャ]はルNヲケル█ルほルSャ^もル21ロ[レaクャ_●ャ_ウ★ャ_ャ2ロaルNクャ`●ャ`も★ャ`ャ2ルヒルN
it	$aレ:Lル{みO~ホヲX2レUふき0★ンろヘえンオワぬヲツルUあふき1★ンろャXロ🐱ヘレち"i7(ヲツルフルワ/ワゅャYンろワ(★ロ🐱ヘワhヲチワQレ#ルゃ`ャZみCたオせル90ンカレXルやレlnノレa
is	$ルきンウワっせル90わワ*ロxワっみCた"4l)レワヲF●Xレ#ヲチンエルjレ6ャUルス2レや.ャVワにルッEワQレ#ャWルろヲGレ▒
ir	$ンめワわリゆjaたャ;ろ?☉はッヘシ0ロッレセSたッ2ワみレQせレん0ルわ0ルFルT3ル◆せbqンもbGみンやヤレ)ロ▒`ンゆ▥"KX*ロやルス4ヲX4ヒンヒンウヲょル◆ゃンよャIレそルエヲQルろjたヲRル*.ンら0ルッJワ'レセsンりロよロTンるヲYルス1ヲX1ルヌワみャJレk/ャI1ヲZれ2ャ:6ル%2レk4ロよ6レあ2"Kl.aらレツワWほャDロ;ルんャ&レセnレをワcヲケレあ6レセuたャ;6ヲコヲサヲシ/ヲYャLレセロZワみレ█5ヲシ5ャMヲ[ルせ☉ロ░/ゆャPワ)"G()"Ft*ルフ/ヲエャSろN★ンKル▒ワfル9/わあ7ッ◜レ'レPワんンてャ=ンゅ7ヲ^Jルtレツンょ▥ンアルめ1レセッュルね1ルス2ャTル92ロ<
iq	$tル▤Sルみロ}ワらロ~レHロAャ@ンへ,14ロ:へレnヲPル😐レねンほャA7レ=ロWャBワ%ロ█ャCロ^vツルoワるャD3ルvロャロ^vロ{くルノ2ルエヲQワれら62ロ{ほャ=ヲRロ^wルQルoヲカワaッルャEル レつヲSヲキルのッッロ^wャBワ&ル▒モ"#9(Tれ2レI웃iレlヲクロ^ャFわルオルムャGルっワ&ヲU."&f-4ルvル%1ヲVれ1ルのャFロめル%1ル%2ロ^ャFリ2ルみル▤ャFルみロ}"A=*ンま7レ▥まv★7レ▥7ャHロ{ロ|ロ^vワbルXリ1ャ=ル71ワcルッUみ@▒リ5ンみル75ンむレaワdえロAa~ルんャ&
ip	$gワ`ルC/テリャ:0ャ;レ'ャ3ルvャ=ャ>レコ
iY	$レのルそャエャネ6ルUロワはレ█😐ヲX5ャキヲシレ%ルウャ⌂テえレルヲヨテンセヲハ
iX	$ャe5ヲX5ヒヲgロウKャネ6ルみンアルみひロワはとッ,レ░ルカル95ン;ワUもャZウレてャ▥ヲX6ヒャあせャエルキルエレ∧ルろッ1レ)ルろvたレ+
iW"3%(vヌ.ワ2ッ6ルUけャWル30ワ5ルZり☉ッ.ャなャにッnュ'ほヲSレZル8ヲる.ウレトャ4はレンャねるム_ワ🐱3レ◜ャMヌˇ&~ルこルoルほヲる/ル!レaレ▒ヲるロろルS웃gQヲむヲる1もえンしレ|ルUゃル▒ロ&ルhりルノほッ.レYロCャ⧗3レnルノほロ!ロ[ヲる2サレ|ワハヲる3レトッ∧ルせッ∧くレ|ルUへッ◝ン❎.シ14ツルメンセロYッ/ヲwレうヲxレ>おっ/ロ!ル60レナワy
iV	$ヲIレおワ3たルワルヒワへッ5ン#ル3ロaル!レH0ルゅシ/5ロカま1ル3ワオル!レ>シ/7へ4ワkヤレ▒ルワロHルわ7ッ6レとxけレJ4ル3ワ|ロサxロ◆シワ}るシヲニをルwンセヲハワハヲ^ロクッ7▒ヤヲRルワワRレ;1ャsロむルワレツャつレセUレをロむル3ャ}レXレmャvレ◜レH"F1.ヲU4"F2-ヲLロま.マ3ワ-ルcャb"F8=ンノッ8ルキワnャA4😐ン/_D▤サはとン0~ワのヲzル😐レねレ=ワ█ッ9ルAルO0"F%(のン0▒ッ▤ル76😐ッ:ルやン0~ろッ3わルO5レIレBロウgル3ワフ★6レ▥ッ;レ◜ルm5レふ"FI(_フ"FL(ャY7レ▥7ワ(★7ャX7ルkくヲレヲチレゃKワもッワロyンイレけワgンカレXレlッ<ろッ3ンイャたワgあ1ル3レ✽シヲ█ャたシャえヲッャたッ$ル2ほレナルフ1ロうらロスル,ルUワ;/ルAルめ.ワ▒ン/ヲス▒."GL)🐱vン1"GK+ルヒヘン1けとヲツロうン2ヒルフ3ャyレ~kたワキレ~lたルんワスロeャ|ャあルY.レセWたルク.
iU"R`)ルヒロ░▥ンア"TJ(ル7ンゅルワロHレあ3ホンアレとxけャけルUロcルちxッ+xヒレ)ヤロコ"Pg/ッ,ャこルオもわヲsッ*ル=ロYレと?モルサル█ヲx"Pd(/ヲyワoワy"Pc*リ1"Pb);6レセRたヲzルと3レlこルh웃sンちル●ルんッュャ$ルシンちル=ャ*ユル3/ワセルろま."%5*さッ-ッョロいルvヲvル71ャ;3ャあリ7レセVレをンみ")l(█1ン*"6)(ルね4ルワレツヲ?4ヲYャきワ█ャヒッ.ロ4レ6ッ/☉レ█7ッ0ロみtワりaン+rレヌルm7ルッHあ3レソHワりケqsメ▒ル?qル^ロヲルッHワりロセ_rロB▒シ3ロ░2ッ0ユルフ2ルフ3ッ/ルノロTあ7😐ヲもワにル3ロ7ル!ルフ7",r)ャしHャす1"$B)ン,ルえワヒル=ルね1ン*cッ."#C*わみK~ヤルね4ャLワネルきャせヒヲY"[n+ルろロケ▥ャ^シワ=レテルY2"[w(ク2ルろuたルワ0ル█ルY6ッ26ろッ3わ")])ルほ0ルヨmル=ロま.ワにレa0ャMルノルせ☉ワゅ5ゆ"Zu/ッ4aロ◆ッ!ワo0ワt"[#+a5ヲエャS"ZR(▥ンアレい0レセャちレ▒0
iT	$qねワや~ル=ワYレツャきワ`ャくテオヲw.ロ@ッョ/ワん"iM)ャUヲvヲKャくテレ∧レ~ロケ"&*)レ❎
iR"Mr8レワろNレpあンゅヲFレB"<+/ロま1"<&(レゃKル▒ロ&"j]+ルちロクユッ*ル●ヲヤル=ヲvワハ
iQ	$ル1?ルえワRロ◜0ひロ◜.ロみVはワXレmンしロま/ワに
iL"A5+"?p)ン ヌヲらけャcルノヲらはンよャ😐ee▒レ❎ャ♪ワiロCロ:もは.ン◝ルたヲXル[ン!☉サャ◆ン!ロ❎ル😐웃ルロル[レ_ロりヲフサャ◆レ_ロりほロ❎レ=ル★☉ヲらツレキャ…ヲらヌレレ.ル_きワイル@ヲbルt5ルt1ロ❎えみャ★ルっルやロAlの
iI	$ル1gIあフ/ヲo
iB	$ワ,ル94ルゃ`ヲょル◆へヲユ⧗😐ッラワコみワ7
iA">g+ンハ">g2Tたッ2ふノワ5ワみルわ1ャsレ+ロよ0ャtロeルとロリ3ロAn▒ロふワサ"48*ワkンら.ヲケャ[レYレうワ'ロeルFtˇen▒ンら3ンヒレん/ャ[ルノ"C8)ヲ`3ルoレRレトャuルヌロ@ヲケ"qw(mたンフワシレmハャvャxルろま."/b/ヲケレ}6レセvたンヘルんワス"il(んャzャ|ルワ/レあ5ロ▒`リ4レセワスンホワ6ロよロTワ*レん6レ█/"Fj(ルろeたワ6ヲケレ█2レセJたワ6
ho	$gひへルエれャさルfぬルあ}レMル7😐ルそiF▒ム6ルfルあン▤⌂ワと6ワなルhりヲP3ャn/ヲつ0サツルせュtサツワ2レリンあワのルねロひ
hn	$ロbル/ュsえルオ☉ロそレレャ♪ルオけロそロ@ルhひルオはロそロ@ンちル●ヲそユャきユヲえいヲqいレほユッ0ユレへQユル🐱Rユャ#レiAユワネ"\m)レらレ(15ヲHルんッュ"?=+レヘ5ロ>ワやきレEウルoロ>ンN"#-)ュOャ…ルHルま[ッこッ^"#6+サけ"#6*ンむロYヲ◆ロ✽ュ█ルウオッ∧ワo3ヲ◆ロウTュ█レむヲ◆ッfュ█レルヲ◆ャルュ█ロワル░けュ!ルんGたンたンホル░ッaュ_レあ1ルんヲGル░へレあ0レiCルナ"\_) ンたヲzンホル░ゃレあ4ン[6せsルq♪dレヌンホンちル=ッ`ヲゅル=ヲ♪ル=ヲヤル=ュ4ル=
hk	$qルシレ(ヲニルすャ}ルすワフルすレ✽ッ♪レロンもレほルたロX2もルキょロナュlル★ルキッ9レヘ5レIル★ル@ン…レ{ヲVッきャWンスル☉ほレ▒レふルシルムルcfルgテ"6j(ワ█"6j(レヘ3ワ▒りヲ$レねルUロi1ュ|ュbレ5レ{ロ?へワGほタfロュ☉}ンl☉ッ◝ヲおレEル@ルヌをルNワGンcゃン1ほッ)くルEヲ█ュvをン1ンcルゅン1ンcウル6ン1ンcえみノロYワ▒ッ⧗ヒュn"7O(レ+ッ▤ルm
hf	$ヲり웃Iロ:4ッ😐ロeッうッ-ュcルたりル😐ンつえルヲヲュウヲyロ@ほンほヲU2レ=ル/オレoュsレoュhュtルHュtくレIロょヲbッ😐レふりロう"#V0"]\(0ロスル/オレXュsレXュhュtレけュtくワ▒ッあワイッ😐ヲ$レEヲさレけくヲおりル░ヲsュZひ1ル6ルせレpオょロ@ヲおりょッ✽ヲうロCヲかヒル61ル8ルwレnほえ3ほはワ2くょロ[ロむッˇッあヲTッミ/ル☉ルoルU4わロョルっロyル[レuロyエ5ホ5ッあレGほュQュ[ロょレ_ほュQヲおりえンニ5ル8えロR6よュ%レ<ッ웃ほけル∧ヲュ"#s(ルU2レUッミ0ルあルoモルムルあュu.ヲ{ワG}ヲュヲSぬルム"#+(レ]ワGサルjヲュルまレ6レ]ルム"#0,ュvヲBfきワ∧"`.(レ)ンむルねロひルEワRレXッ😐レoッ😐レ◜
hc"A9)"Dl+ワせ`t⌂レ%ロワへュ$ル☉レlま2ヲハ
hb	$ヲ@ンも_Sレワロeュgルめャ|ルねホルナ71ンMン レ2ロrテろTロcロフレコレ)ルとワャへレZル2せTレlま3ロフヲM"[D*ロ&ロフ4ルノヲ%レ2ロさル8レ2ワ◜ネめウレ◜ワハルSレ3ロさ}ロJロセルgロフ5もマ/もヲ★ャqろTッhルろン&レ>ワAゃヌ0レナロフ6ル!ロフ7ワAゃル6ンeルEやル!ンフルPsッfンぬワfヲeエ7ロフ7ルすッ%けワkンフ
ha	$ュ-sひレレル🐱@ひオ3せTレRレ]レチッ😐ほレキルあ"#,(ロqロ@ルUルOロeル"2N(ャvャxワF4ル!ルZりルSレやンナ2ワと6.ウン⧗.ヲnレTヲ{ぬルあルあヲャ"g3)ウ"g2)ッいン=レaロひルhッ8レルワF5ヲけ★|vンbく★ロ-ンb★ワ❎ンb★ュeンbヲヘルたッ:ワF6ヲけンWル.ンbくンWヘンbンWルy"#)(k"#F(l/ルいワロ"ji)ヲエャロッYロカル⌂ュf"#<(aッ▥ッうルいレょレ^/レ♥ャyュcレソqンYロノ"#G*とワャロせルQワEル.ヲッワEヘ}ッいュgル[ヲdyレCレょル█ンるルP@ッvレUれ1ロフワサル%1ヲ{ぬルwルwュMルノほュNけヲOッいュfンXルッfリ/ッmヲMレHッ&ッ∧ヲこ★ュ&ょャaュ(はル)ッい"rR(ッeロひッうワちッ▥ャyル😐ねegたレ=ルそhRのレゅワケ4ュGレ=ル,ル dEレmャuンcンみろIル[ヲAレpレhャjルoルO4レIレ:sろIオャhュHワ%ャhルムヲけル:A▤ルm3ロフ/ルっルQルせヲさルっュhヲさヲけレGルムルNレ_"m-(Qルムル8ワカ1ワルャlcっルm4ワキロうッ+rロスュiンテˇルˇルAあ2レふワ▤ルよ/ル_フッ|ヲクロスッあヒルm7ュgャしSわワfTャす3ワ▒レBロエロeヲ$●ルヒャX/レまくンbヲレえワ/るヲbルUルめ/ヲ$レやワ;1ヲSュ^ロ^S"Fn)ワGワgンカモワEュ]レ…ルめ2レ>ル&レ8☉ヲけワて🐱vワて0ワ(ンbくワイけンャヲかンシレナュIルね3
gy	$uワ`ルえャ,ャ▥ユヲhレ◝7ルうワめル⧗
gx"O4(り"O1("Oe-ャオルm
gw	$ヲIaン&ル{ロカヲゃ▥ャ0ヲcンヌルエリロ◜1ャ0ロyル7ャ▤😐ャかみ@▒
gu	$ル1j?ルうルFル$ロほロ;♥ッ8ルえやヲrロkスVルえッ%ヲrロkルIMルえッ&ヲrロkロウgルえッ'ルテロkロエルえン'ルテ
gr	$a웃ekルウム6レノッホルl_ルいン#ルFekレむム_レノルfルやン▤▤
go	$ャ웃ンもf@ルUヲZリャ;ふフロiけヲ◜レレャ⌂ヲ◜ワツえは"#)(へヲ◜レレえへヲ◜ンよヲヨヲ◜るヌヲヨヲ◜ンミみっ
gl"[0)ヲょレ}ルスャ,ル%ロ>ロわkルI`"GR(ヲヤレスヲh
gk	$aりレZ2"MW(レ:U"pf3レHロ♪@レUワ/レレルモレセレqンノル,ャn6ル😐ルそヲス▤レ=ロ_ルヌヲ[ルせふノ2サはャRほレヲルっょレンャo3るャo4★ャpサ"KA+ワpサけとヲヘワのレ)
gi	$gル▤cBレUワクあの3ル%ロ^Sあセ"'N+オワケ4るワケ5ルフロ^ワ はンさャgの6レaロ^レつンに3ほルoロcャgの7レ)ロ^レつヲアルエワるャgノ.ロャャgノ/
gh	$ワ0のンテルサもレWルs
gg	$ロbあき6ヲむン❎.ワlレレテ"RP(
ge	$ンのロ>ワやレわル=ヲKルす6テわレ∧レらレ(7ャ9ンはらャオヤレ❎ャ:.ルス1レャ.
gd	$ヲN5ヲオレよレˇウンあ
ga"M9)3とレワ"E30ワY3ルのッッヲをワひレたッャレ∧ル34"Fl(gZ	$pひへレnワッ~ュ_レnワッュ%ュ`
gY	$tヲ▥レZくルみッzャ☉ッ,"Y/({ルンルみロWワWルンルけレEャムルUレてル😐"OP(ルh●ャpルた●ワpレ+"p@(sルみレEもほ"pP(けロょレふらルっルムロAX♪ルセヲ^rル&47ルサルっレけレnルムレけレnえルqのロの
gX	$ロbヲホュMレZくワねッQュMヲフ2ほルSヲろュNャ☉ンくッQュNほヲッヤ/~ウル8もヲ=ッ◆ッ◆ル∧レF
gW	$ュ-SひルヨrらレへLュT3ヲo
gV	$ル1"A])ルんロZヲHャ#ワむルレルvンHュRyOワネソロけクンKレぬcワo3ロkロ✽●ンKレるヲqルちPユルろsた♥ッ:ルナロリルテ♥ャかねhャちルちPねaン&ル;UャかワむロヨルvルZッ8ルウャ%ュRレ▥ンZヘュ)ンツbヲゃロン●ンK★ンZyN}レ6ヲFりいUルナヲまルテレへKルナ36ヲoい@ルナン◜ルテ♥ュYュRロrレレッ░レへャマルちrロけワひヲえルちqル●ュSル=ルヨaュT.ンMルヨ_りルヨ`らル;f●sャルワたレホ0ッUャレるャロンLッ_ヲhワむ4/ルvルhュT0ンMヲPロ]サルキャA6ルSれ▤きロ>{1ルうもル⧗ンむル71レiDりレるcルトmw]qルうロmル⧗ャQらルヨqりレる`りャ▤ロUVたルUわルO6ルr4ワセュUヲKル&ルタテわあ/ン[ロAU▒ルフ/
gU	$ュ:ャ}ルvワひレ/_Pユュ>Iヲ▥レ2ワ(レ/ュ?ッzレ2ッRル🐱EニfIレrほロ◜2レね6ヲv
gT	$ロb웃Iュ=/ャ,いヲqクfFロへdひルFfFレlレヌルUルYいIル/ルク
gS	$ュ:/ロ;レ/ュ;ルナヲニヲoレ/ュ<ニュ;ルウ
gR	$gレぬlへレあレeワ☉ッZャユル7ホルナロHッEレねンナ1ッMンNワxるワ)ワ☉~レ∧ホルナヲ⧗レ❎ン=ルねュ3
gQ	$ャ웃レキヲけレチンbルンロ#ャdルSレ(ュwゆル…ヲGンノッルャn.レ%ロ█ン…bめロ?レリヒン…レ{ロ?ワルルNょ}ル…ロFロロけくルフ
gE	$ルきfCン∧レへCルえ7/ヲoワネiルえレ8ヲむル7ろbhレいレとAレYルoルYヲ^Aャキレaッm1ャノiはロサAレYほンュルzロ4レ6テ"]5(ロャレと@けャけ"]R(♪Cッ]テロサ@テ"]P*ロャヲ^dッ7▒
gD	$ルき`mわあヲJlわンもIンもンウレhレクけル◆せワ<ンも_W"@F(キせロxルカンいル█レhレクロ◆みCたる/レクけレQレクゃヲ_"R[(る.レクッaレクへュ+せャヲルOッ_ャンルmルフホレャレホ2レテロ▒mわロ&ルUわレ∧ャンレ❎ワヲル=ルちdユレiHル●ャッッS@らッcろbhワ'ルちAッ+AヒレとAロm3ルoンゆロきャャャッッSdらワcレと@けヲU/ルUエ7ルち@ッ+@ヒンフロきヲL"Za7ッdレiHル=ンヘろdH"Zb(リ/ルちd"Za)ッeルUわワっロサdン∧2ロきワcルhレぬlレとdけレヲサはレ█/ャッル=ルちAりャオロきルm/ャユンL"#A(█4ッ^ッZッcロ>ンNッZルハ☉ロ░0ヲ◆ロ✽ワ█.クンKワ█.ロk"#0(ッcルハけロ░"Ll)ル=ッcルハはロ░6ヲ◆ッfル=ッcヲ◆ャルル=ル;fンI"-K(ッ`ッョ43ルvレeワqル=ロき
fy	$ルきヲ|レUュsレクけュ+せッ3ュBンHャTOほャそレや.ルのッッレH6ワにルZレ:qるャヤたヲムャけヲモュ>Mル=ロれレaロき
fw	$ンめッsえワわワクひッ|レヌル%ュ3ロ◆ルCロ7るルCルヒルテ
ft	$ロbらンJッか~▥ッロロそ✽ッけぬレ█😐ッロロヘロそル4`レ5♪ヲしルFンsえロのルm
fs	$ヲN6ンテンオるをレ|ルUリッなロろル7ッな1え"#6)
fr	$ュ-Cレ(ッTヲoホロXロそょとルちDュ7ッEッつルキンナ6ルhンp~ルちDッ+DサルウレrくヲSルハヲ)ぬンふサロワレクンえュ☉ル/レ❎ルハょテレpロ+レeワうルシゃテロコレe|ュwひる6サヲ)ッて0ロヘュ{サュ♪ルまッかッこレe|ロ7ルシッせヲy/ワツン=ルmル🐱Tりワ)_Cンqルウロ?ュ😐ワ$
fq	$ルきRわレ⧗ッ`ル🐱Rロけレe`ロ9ルL6ルホaヲ]レe`R~ルL_"#0,⌂ルLルへレ!aヲ]レへQレ:Hッ0ユワネlワ█5ロ5ルオヲwロ5ル[ぬルヌン[ヲMンかルエワ*ルTレツとンもレほレてルろンとレ+ヲHレへRル=ュnヲそらュ}ンjル●ルヨュm▥レや.ロ5ヲカホッロロ5ル*.レiKロけレedKフら
fp	$qロめレ(07もヲすルすュいヲすサヲすルすルへヲすル_っえルムヲ★ロナウル6レみロ]ルO"At)ル@ヒャ⌂ンャウルっヲわル2ほるンシレナルm
fk	$aルL"G24ュcルEッ&ャˇ2ル◆ルメャdえルメル◆ル☉ロ@レリンあロ]ヲ&ロフワサュlら.ッ9レJ4レIンつ6ッえロナルEッ'ルムレ|レゅ"CH(nャけルEン"#5(ロコッ▤ルクュfンきロひワキ"Fc)
fe	$ャ웃るャヤたャ$ニsンもsルをsわあッNッZルFsル&ッVルvルフヲJlモッ]ッャレいッ^yロわlル=ャユレ▒ルPャヨJロワワた★ル♥Kヲよちワた★ャヨnヲよちレてャユ▤レ+ルちBルナワロアNロ@アOレレレ&ッン.ルマンこヲマddロAャ8ッ`
fd",g(eワfレほュBホレスン ワfcnわュ4ひろレほルほヤ|ijたレaルS웃Iワ◆AロヌAヒルラュCャくレあ1ロLロいルわ6ヲあン;ロ&ワレンそロ;ュDロみ_ルウワハヲzロLワフャつル░ッhワ◆ワDロヌワDヒルラワDせd_ルキルエヲxロUAンり"#S(レ<ワDテル*4ヲzルラュEッヒレ<レCレ✽レQレ<レCヲ█レ}.ワレッ|C▒ヲzロLロ2レあ0ヲあルこュ!ヲvッ}ロAロ9ャミヲあッnしッdルrレzル!ンヘヲあン;リ/レ~aたッeヲzュFルラュCンそ3ロッ3ロL07ュG▥りは2ンひキbッ~ヲいワレッ█ワんル76ッ▒ルへレ█3ッ░レ2ワ◜ッ✽ル8ルこン◝ヲあルこル▒ュHワレッ█0ルvワ6ッ▒11ロ░5"#;)あ4ワ◆Qロヌレイュ1ッ█2るッ█3ワ◆Aりルラレイけロ░0ルろンFルフ0ルラレイはロ░3ワ◆_Pュ7レチッwロオン◝ルフ3ルフ4ッ▒ワフヲ?ロしルめ3"&G,ュDロヌュ;"&6)ラュ<ャす2ワ◆Qルナロラ"Il(ッ▒ロラロッ/▥りン!ャ?ぬッ(ャいほロオワ$ル:ッ~ルY.レ~aたルク.ッ▒12レヲッ✽はレうルY2ルrロaレ<レほュJルク2"&1+4ルわロラロLワフワゅ7ル░ルほ6"$N;わルほ5ルラレほル&ヲ⧗ワゅ2ロUBたレa4ワレッ█4ルvワ◆ッ●レ(.ヲuシャえヲuッ█5テルンヲuッ$ヲuッ█6テくレちャレレa5レa6ュKュLワへ6ロ:ッ✽ンュレ6ワ◆`Qヲpャ7ンまミfJュMレ2ワ(ワhャ6Jほロ❎ワaロヌン?ュNレ2ッRワhレ<ン?ほロ❎ルハャラヲ⧗ルろSたレ▒5ュKャホレ∧7ルたロヌッ●ル😐">+)ンWル.ほレ=">.)ンWヘほレIレゆンQ~ルっンQュ%けル8ヲVはレJロa"#g(❎6ク3ル.●3ル.ル@ルムレnはルNク3ヘ●3ヘルっ"#2*ュKワヨルわレ✽▥りャ6Iャ?ぬレ<ュ?ロ?"'9+ロc2ワレル&ッ@ルvャYミュ?ヲリcH~レ)2ュKレょルわ12ン*Dンチン*Eンヌ0ンょヲあをレうつ6ッ✽ャiワたへ7ロ5ヲリルXレて1ルr2レコッNきル=ャYIンUレlャ@レ+1レ+2ュFロき
fc"Dr)ワY/ヲhいッy"OR)ヲヤレスンてッ_
fb	$ロbひシロアル◆ぬャcル&ロHル◆☉ワoワdロ4dこレ%ヲBま/
fZ	$ヲりレ:Uロ:ルハもルキンさルZれ⌂▤ルをvヲCル▒ロョワねくヲCルむャHルAルめヤ/~ルねワのル*
fY	$pルえ2レ&ヒルマッヲレよンけレˇッンンこ
fW	$qレEッラg▒ル😐レEン]レンけレレロふルHルサル@サンあ
fB	$ル1Gレッワ|レトは.ンマ~ルと5ヲとロュ
el	$pロ}レちレ&ほレよワ_ヲcワめレン0ッ(ッqレˇ"#2)ルo
eg	$ヲりル/ヲリ⧗ッ⌂ルせレ/Wル★ロm6レン☉"5i(ルh"#2*もル[ッ⌂もほレ/vニレtアヲ.アレtほャ7ロm6ネめ
eS	$ロbりャ⌂5ンャル░ょレ…リセヲpウンュロ▤ル7ル░をレ…ルめセヲpルねセヲpヲア☉ウンYほンュンョヲ◝
eR"e,(ルシレレルたひもルヌロ❎ル😐ル/ツロ❎ロふ7ワwンンサンあレ=り"ds(ヌカノルムレJ.ふフワ;ルっロ❎ウはロ❎えルっャ♥ロ❎ウマ"#.(ルp⧗ロ❎ンあレ=ロょャ☉ルフ
eQ	$ンヲ6ヲオウヲツ
eP	$ンヲレそレrル8ウツルヲヲュレ◜ろMロyルほンへへレ7ほルhりレZ2ほヲョャmロふ5もレ|レロレZ2くル7レaワキ
eL	$ャ웃ワhロ#ンDルhル★ャロル◆ッ]ンOルたルシレRッg☉ルせヲアレンル6ンミル34レそウルHヲツルハルYレ>ワAえャ☉ウレナルク
eK"PX(0ャfえントレトャ4はルoュ#ツヲヘ
eI	$aひ"aC)レルえロワンセヲハ
eE	$pル▤SンイルaLワg
dz	$ル1ワゆレGロ{ルンャ?ワよ웃レん/ンふぬレ_マヲOレ6ロ@
dv	F	!x:$1|y:$2|w:16|h:16|vx:0|vy:0|U:t|fG:0|en:0|eD:0|aT:0
du	$pひヲアレン☉ャ-ルt6レンけンな
dq	$ワ0~ぬン⧗ッホルEン⧗ワちッホ
de"Ie("<*(ワUッ.ルやとレ%ンなロいワ=タpャゃ▒レ'ルCやルvャ%ル,2ょくレZ4"M_(レ'ルCッ%ルvル;QルえッVッWワロンG~ロ😐ンねヲョレJ0ワzワ⌂Q⌂ルえロヨル★レlu▒ロれルクル;Dレッッ&ヲrル🐱_レッッ'ヲrレるPレッン'ヲrル;VレッワRヲrルんンFレへ?レッロHルテレるU웃fレんヲ⧗ルテルCレツンG⌂いソレッワヒルテレ'ルC/ワんャこワ'"wF.ュッ/ルやル█ロハルと1ャ)ル*6レソQルウシロヨテキcャメレへBレ:DレルレHょャヘャきユ
dd"pX(うえル⧗ルSルそdンやルhル/オ.もわャ-ヌル█ュ▒もル▒ロ>dンやル/ロョサュ▒ンヌ3くュ🐱ャロヤ/▤ワUウャZワ)fS▒ワっル{
dc	$qレゆンI5レ=ロけレふひレP3レラロうュi.レけルキレヘ/レIれフ▒.ワ▒ロめルす/5レラヲ$ュi1ワGルキレJ5ロスワ▤て1レゅルキレUュOル@ルキレuルキくヒサルエロ+ル_ノル@ロのル😐ンI5ロコヲ}"#B(Uオルす/5るワAヲすレuヲすヲ$ひ1ヒルク"#N0うン2ヲ~ュZロょッˇュiレそ3ルキレヘ7ヲおワ▤3▒4レ%2へルHュvヲ★ワrルセルサレみロ#ンシッˇひ4ヒヲキ
da	$ル1Iルナレツえルq~ュ4レスワひンLヲをルUャくレ;1ル░レ∧ンまソレ▥ソワ(ロ{ワ_ワa●ソャXソルkくワむ.ロ;レ❎ワ%ンそワんンHヲもワCンネヲpレへFルナロ7せsンエャレヲKンそ0テヲQルろRレをヲRレらルナロシワCyQルナロいャオンホルUンそ3レ}6ワCロrル/♥ュYル/ヲˇり♥ヲ▥レャ6レ2ルyワ_ュ5レね.レ2ルkワ_レ⌂ッvりル;qロけ"Td("Tm(░はレ}5ワCンUねeャちワCュ6";c-ュ8"$.)4レあ4ワCンUュ9レwnレヌンそ5ル◆ウるロA"#S3ワCルkHルナワオルあレチヲdュ6ロナロqン!ヲdュ6ヲnD~ルFIンそロ;ワCロウi●IンUル&ヲ⧗ル◆ル&ワ|るル&ワ}ヲoワCスA●Iロウiルウンホ
dZ	$qュRロrひレニレ6♥ュYひレ⌂ワ◜ひュ1ヌ77ワUン]ょルcロ9ル8ッ░ルF@ル&ャュルv"%S1ワひュSッSqル=ルrワ=えュJ
dY	$g●Iヲ❎ン;リッPひワよル/ル7ッPヲトンDえレXへッQワよ웃MンDウレoへッQセヲトえヲ_Mウと
dU"4((らルたル,ャn.ル😐ル,/サルヌッnヲ◝レ=ひサンふッoュ#をワツッm2ル@ルっレ◜レIルシロ◆ウンOル_っル@ルこく"GK)ュ$ッoュ#ロこ"7w(dT	$ルきs}"&u(レホˇルXれャ$ンI/ャヤた"#&,ンこル%ヲJlレRッ]ンJルXルめ"Ee-ルね"Ee(ンJレ♪ッO★ル♥KンJン★ちッO★ャヨn"#.(レいワワひルヌレ▒ワネソ웃ル$るャヤた"\;)ロkロ✽レぬcン ロ4aロ9ルUャラ5クXレ#ル/ロYルUけャtロk"#0)クャリル/ワひ"Zl:ッ`
dP"IJ(ワまルZロみCワdシワつルvャきル=ルんヲGいBレねルと2ャ)ッョワ.ルvワネeルうッ!ル⧗ロン●🐱NンH●🐱Oンま🐱vワaロ=ヘワ%シ2ロ;レeャときユレeャとのユいソルえ3ˇンサレソDロ♪BンEルSレ:Vレルワレシワ웃ルvレソVルaVロワンE"2t.ッWルレッWロリンG▤ンノレねワnレヘ6"3'(▤"3'(シレlu▒ワのワy"1_,ルゃ_レルシヲまッXャメいhd웃bPレルせbPレむロツ~ル🐱OルえレょンG▒いe?ル●ルヨRロけルんンFルろャ&ロUワスャVルノャヘッPりレGッYほルあャモワよりレ_ッYほルwャモ
dO	$ルき_WレいルUルY"hB(ャネ7ル=ルス7ヲX7ヒャI7ャノhルエルめヲをルねルクロきレ▒
dN	$ワ0▒15シ16をルれt⌂ッEワ█ワmャmルhャクン<マル8ウルゅルNへ2ルせくヲる7サヲャルせレpオゃヲユロFン=ル%
dJ"8J)ン!ャ?レmワより"F2,レm
dI	$ャ❎bリルんロZャ#ル7ルろsたレ'ロほ1"'i.レ'ロほ2ルvャ%ンつ.レゃ_Dルウッ$"79(ンわ♥ッ:あフ4ルテレるヲqレタン&♥ャかあフ5ヲrロまャ)レ'ロほ6ルvャ▤ャ▥らヲKシ0テヲsャ▥ユロYヲヤレスャあワ'ルろvンり
dE	$ワ0ノ5ワカ.ルwワカ.ヲ★ャqレ>ャo6へ2マ3レナ
dD"#C(1ヲオッヲレよ"A6(ˇッンくルまルsルZヲホルSヲホレよくルヌワmルAルめヲマuレrル◆ぬンよレトルノレnレ&ルメネめ☉ルせュ`レmくヒウルマッヲルあワねくロs}レ6レˇルcGきロ#ルあくル%
cv	$ルきbfわレワルみりルみりワらロ~ロ😐ルhレ"9^(6ッMンN⌂レてッくけンッ[めレ+ッMワ☉⌂レ⧗ロ#"#3(ュnロれレaレHレクヲたロまえヲたルと1ウヲたヲ{ンkヲた
cr"8K(/るえッMロわッハルほャニルuルOレ%ヒウャヘルねヲをルス7ル/ヒャヌヲD웃gXルス7ひワネhル/るえンて
cl	$ヲ@"^[)"uD(Uレワロン웃Nル2ほろNロyレ⧗レた☉ロッルろ_たロャンうンえロUンおロャンかルわ2ヲる}gO▒ロャヲるヲBロ9ンきヲれレや.ロま/ワに
cX	$ンめゃレ}セッ+Pル%レたワわあセロゆHルフンかワゅヤ|aン&レaャg▒75ッWャ5ンG~
cU	$ヲIレおレ░ン∧ワ3たル7ル3ャュル!"@p(ホ7ル◆ルwワツ/ロ]ルwワへワふ.シ5/ヲ…ゃ1レナワふロろロャワふワセルハロ+ワふレコロャワふヲMル░ッhル😐ルシるシワ|ワふ4ル@ンンヲ★ャqロ]ルwル█ヲsワdワンマレZルHャョロYルハモルHルwル█ルカRはルエヲxレ%シャ◜シ56ュ レュワふ7ルHレ|ル7.ルワロHャJッjワサッj/"#b(ンPャョレ%ヲE0ヲE1ュ "#F)◝ュ!ッjレコレ%ヲE3ヲE4"#:(ッjロあレ=ルえロ,ヲむル😐ロょッ]テッkへ7マルQ"#e1ャこリ2ッj7ルQッlヲBロトレ>シ7.マ1ッlレナワc
cT"(`(,2ハロそルSンI1ンMヤ/~レUオウるワ)ロル
cK	$ヲりッラワ^ンねルtャ5ル8レ<jvルヲワTルたレ(4ヲCレ<uワ_ワ!ャ6ワ_レ<uャ6★🐱Wャ7レ<`d★🐱jwレレル∧DノルP🐱jxあヲエルHロのルクル_きみャ8ルろEレを/き
cI	$ルきdAン∧ン❎ムcルfツ/レ8ン▤⌂レiAル=ル7ル😐ッラf▒ロロル[ル@レルワとcワなふノッリレむサル@ロワルサルHル[ル@ヲよcっロひ
bv	$ワ0き2もえレ◜ルハリル_▤みンサル7ルたンつ7レ=ル/"?n(レIらヲVルっルキレJ1ル😐れノっふき4ル@ルHレ◜ヲWンシンスヒルね
ap"K%(●ルUヌヲ?"]()あルhッロロ5レロル[サロほレQサシロTル*ルねルた"Ao)😐ル★ルオルHわワUルHルオワ)ルニわロ>ルニレEヤ/の
X"M,(レEるマル😐ひルキュ`ヲレルEレzロ█ル@ルHワ😐cノ]]})do
for r in _a(_c(_lp(d,"\""),"\n",_j))do
local p=_c(r,"\t",_j)if(#p==2)p[3]=p[2]p[2]="q"
_ENV[p[1]]=function(...)return _ENV[p[2]](p[3],...)end
end
end
fO={}function q(L,...)local aQ=fO[L]if not aQ then
aQ={}for bN in _a(e("$ル>ルcE▒ルCロヨレラ",L))do
local p=e("$ル>ルCレラ",bN)local ac=p[1]if ac=="j"then q("$qね/~ひワKロJlsッハヒ",p)
elseif ac=="w"then for j=2,4 do p[j]=dl(p[j])end
elseif ac=="p"then p[2]=e("$ル>レむヲ;ワすヨ",p)elseif ac=="s"then p[2]=e("$ル>レむヲ;ワすヨ",p)p[3]=dl(p[3])else p[2]=dl(p[2])if ac=="i"then q("$qね/⌂ひワせロJlsッハヒ",p)end end
add(aQ,p)end
fO[L]=aQ
end
local az={...}local i=1 local ev={}local n=0
while i<=#aQ do
local p=aQ[i]local ac=p[1]if ac=="j"then i=p[2]
elseif ac=="i"then if bE(p[2],az)then i+=1 else i=p[3]end
elseif ac=="w"then
local aA=bE(p[2],az)local aB=bE(p[3],az)aA[aB]=bE(p[4],az)i+=1
elseif ac=="v"then n+=1 ev[n]=bE(p[2],az)i+=1
elseif e("$ル>ルC0ッヒえルすロ2と",ac)then
local M=p[2]local bf=ev[n]if ac=="s"then bf=bE(p[3],az)end
if(ac=="p")ev[n]=nil n-=1
if e("$ル>ルウ☉と",M)then az[M[2]]=bf
else
local aA=e("$ロ3レむテッフヲャテテ",az,M,_ENV)if not aA then aA=_ENV for aB in _a(e("$ル>レむルCヲまレラ",M))do aA=aA[aB]end end
aA[M[1]==3 and(e("$ロ3レルテッフウレルテ",az,M,_ENV))or M[3]]=bf
end
i+=1
elseif ac=="r"then return bE(p[2],az)else bE(p[2],az)i+=1 end
end
end
hV=_c(_lp([[$ワ]Sルオル ciわレRレGワねくルoレRレGロ{くレ&ルエルオ/ワル☉ンふルC4ンテレ|ンヌルoる/ワルぬルヌ"#7(ロi"#7)	ROM:3338:2888"#1(11054:1223	:	!!	!!S#0)*0L7.#き*8$J<.-h*カ!J<.)h*>%J<をさ>るJ<.$さ>+J<>h*>-Q4..さA'+-TA.-さ@#シD+*Jl,さワ+✽!+a</*さる+m 4JA0(さま+mD!+(JA.'さヒ+イ*イシJB.&さ(JB,UA/%さヒ+,u,Uラ$さヒ+-u✽ シ🐱.を+S*を+S/3けひ!*6っK+.u.~&Jk&yゃJkOたい<たI4さK+j8+UラJ⧗●zJ/$◆ほ*スゅN/&&ちH+30ICG▤.G'✽#G+H/Jk+V pVD7'm2(Lせ7V+うVo!オへWオ L5S0)V✽!}>(/>(S#hb7LサOWS)e![!$h'%m)%h'(m)(れ<o!L5B7<&e(Iはh[>/$Hh')>/$)'hb<!L5f[&S+e-B0*><お2フ84'*0J4/&hEた2mO&S,d$<0,>ZM8#)h'LBCタh:た<m7(Q웃d*p,hDHほ>P[hDH?h<;G●!*-d/z.0g'>'%0g%>'i$<-そ*S m#/m#i!♥iモほi(f&)i+H&-i.ナi0CキVワ&Lはツ!チf(LはHe![ひ2はHOEe&C(Lはワ <Ee*Cひ2はH[Ee-f&LはHEd [(LはH&1q)ひp(,けへ30-(8bヒV)%)s'V)'(-d w1p(▒<7[&i●)?&i@(f&e -)とH'Sわ!"#'=e f-ョョ*0'LっョS)Jナ *%zJ</+>92$J</-カ$Y♥ョS,カ$JC%Q|QC#+UI**J6,Jk#)NルN[#)Uf.(JB0T?オNB0Y?オQgWTナT<++")H()S$Yk$a?キ3モ.L7)$T[(TCDa[(aCDNg`TC,Tk4█?,█[4N✽/Tf.U 7/█C0█k#L!'',1(-k(1(/[)G)601(け(JC)UB-1(%Iと*B!H&a8.♪0kあ 1PfF<Q<.♪,kと'&|JC'UB/♪!?)JH%a80i-f(JC)G(%%+ア&C'i!せ1ろk%T5/ふ▒ S*1-+kまG)8/S*1-b!RG'B.S*V!▒!S*1,*C(テH!ふ ?LO )0	$ワ4ン◆ンンもルっロuロイ	$ロ3ロ█ンrン$のロイ	f	F	play	lab	walle destroyed	$ッのワきfュう	dead	$ン{ャなロ웃~	ants_reverse_v1	cinematic	bb:n|v12:t	level5"#*)3"#*)4	P:0|Q:1	$ワ1ぬワエ"#9)2	D:1"#9)_ュえュおyNヲなE…t6ヲにjeヲにル9.レモ	$ッはロ-ルYュかエュeロハ	$H…`aレ🐱F…M…ンキレモ	!x:$1|y:$2	$ッひャウwyルロ.ロ0スWロ0yロ●…`Eリ|ルロ2レい|bEレせロウDレせルk@ユ	$ンウレ4ロマッふャネ4░ャネ0レモ	intro	delivery	$ル}はンソ"&,*ッへレなュきyレつ…`dルM4	$ロ3ュくレウル5サくルHルら	gifts"#)(_"#j)v13	accident	title	$ッひ_aaャセワ ryロ●ユュお	$ン{ンYˇロ웃~	x:8|vx:0	vy:0|U:t	f_before	approach	vx:0|"#C+"%:)bロnッupwャネ4░	v8	$ワくン}ワ-ュけロ6ルらヲ`ッゅもンh	$ワくヲ0ワ-ハもル6ル◝	$ル}ャいッほロtぬャいッほえロ1ュ_/マロRレみ	
	$ル>へ/ウロこ	Next	$Uュ2rヲロルGワ●!gワトrュ2ンヨヲ▒ロf=ヲて!ン-blン:_sワモレ5gxc ワナレ["$Z*ンT+yU_ルiンレルにrロ★ッB`mk`#レ#レ[Eン5JソンT+#	|	Dr.Red	$ロ3もヌヲルワwサヲとワ9	$ル}ロムルこュくロsルこサ"%'(>ぬン|ル5ヲ`ロt9ワ4	$ュこレそをへけャ∧	land	u	idle	launch	rise	fall	apex	$ャセワユ…jャゃルYロS_ロソン8░{pgル^░🐱dンリロ+スncvれ0"(D)サワえ	$ロ3ルふ6レfレlU▤	emitter_fire"#0,"$:($|レおキワ>█ルひJ+Cワンッ◆ツレみワwヲwツレみ	Restart	$ルニッぬ	${ュLル63ッちレ]ロtは7"#.*ッま	Continue	$ワ4	$|ュさたけッぬ	$ロつレなワきレつッへヲ-レ⧗{pュき	!! ょょ'>ト$/そハハD2オ]tA に;Lのヒフ9❎=;U♥ょハ7]ヒ$Tのに(ヒハ!-T8+Lpオ2Mたい%Nの#Y웃t)JヘB ハ!そ(>Mオ█<+Lp!'3-~Lp(ヒ$T80(ヒフょフ!J50'JうG!⧗ JAく'UゃTのた⧗G%uNヘLい3そ,TツYサるD2#そDたA+G(<✽=%るo2()JゃG A0ょ▒G(<+た{7❎テ !ひ!0|にひ +ゃ'G-<0''む+G'A-G!うひW80J5fN20UうG'A-█A-G,f%J5てUA,テいG*ゃG*っヒ(YヨV,B,3-リ&'V-6+N😐G#A03-웃Gホ てGホ 0█A-3へ)G*pN{3-リe)▥Lゃ'J50e)<-J5-Gv-テいVA!ひ#*リV%うe#pG#Aて'V&ロLpはe!A+d*uG p>と$08く/d A,G)B0G!|$)V </''Nレ30⧗)3-B+G&⧗'d#8m)Uヘ=%Yf░'e%6+G'wg2%チZ'V)6+U5-d$こ'るひキ4-)V$B0ちヘに#むん=!3+f G 50む)ひDレふA^❎)VD 0J2mJヘ(JヘQ{&む,█pV!4-e/⧗4G=+G/|V+k む*U{)i&レ♪+-5ト✽8	$ュ⧗ワ>ンwえヲ,ぬレrル4ュ▥	$ル}ヲ,ャ⌂2ルノ}ュ▥	$ロdぬルメレrヲ…ワwレrヲ…ル{もレミ▒."4^+ロtえュしルHくも"#)(ヲ1えサロ█ッむ"#?)ッむルHウヌ}ル…ロF	$ロI/ュそッゆた☉}/レニ0はも★1ワ)1へ★2ゃワ)3ょ}4シヲやワ✽6ワ✽7た✽ロI4~ルすルCヲや⌂96⌂ッめ⌂レPワケャoヲやの9ヲ2ッめの✽ワく✽🐱.ュす▒✽てュす~✽🐱0ュす⌂✽🐱1ュす▤✽🐱2ュすュせミ3✽3ュせワうッもた✽7ュそロIワ}ュそ🐱.ッも▒ッも~ッも⌂✽7⌂ルJ{1ルJ/⌂ッも▤ッもュせヲ2✽7のルJワくルJ/のルJッやヲ>.ルJ3ュそ4▒ルJ5ュそ|/ルJヲゆヲ>0ルJ6~ヲ>1ルJ3⌂ルJロQルJ5⌂ヲ>2ルJ4きヲ>3ルJ5きヲ>レ,レzのル✽/ッゆ🐱.ュたッゆ2ッゆルよル✽ルニル✽/ン▒🐱1ュたン▒|2ル✽|3ル✽ワくル✽/のル✽ッやュたのッよ▒ル✽5ッゆ6ッゆ7ワ✽ャヒッゆ4~ッよン▒ロQル✽5ン▒6ン▒7ン▒4きッよのッよノル✽5のル✽ヲ2ル✽7のュちワくッらたッら▒ッら~ッら⌂ッらきッらの	$ッりえルモルゅウルモょもルモ☉ン🐱けン🐱へサルモはン🐱ヌルHルモル2ル@ルモマルっルモ	$ッひル$ルI`ロ0レわ●H…ャせ…Oレ🐱ッ3ヲにヲ|…t7"8J(ヲにt6レモ	$NヲなEヲなュえュおンをレ🐱"8,(	y	$vワるロなルほッるヲぬリ	$ッはヘヲs5ルyュて9ッはッれュて	$ンキヲに_Wロ0ロウgゅme]oscscレせスJロ0	$ゅンゆ3ロSgワB]ロJnルほ🐱ャせワBレれmrロJkロc{jfあ|j@レて0	$vルめロなロやワ❎ルOレまロモレいヘロ&ッろッわあロ-ロ+ッるヲぬロモルほワpあワ❎ッわルYッれルOロにルYレ ルOッ;ルほンdッわレいヘロcュかッわュとレヤヲいルkルY	$ヲtヲのュなンゆ3レ ヲ&2zッ%ワヨ/5ロなロやッる"$7(&zッ%3._ワ❎ワけヲsレ レ∧6"#4(dyヲ▤レエ	$vロ+ヘロや|W░レ ロ&ッ;ロや|Wュに	$vルほロ-れ3ルyュなレい	$vレいヘ8ッる"<2)lab_dead"#,(invite	0|-1;4|music|1"#=(clear	bridge	J:0|v18:n	$ル}ぬワエ"#E(reject	${レ7キヲく	$B●ッひル$]ケhcル+yt6レエ	v9"#S(レ]ヲ+ロtぬン]ッほロt	Martis	${Lュぬルなン✽Dッをヲひヲ%ッん	Return	EVE	$ッDGャチ!_ レsレ[ャ●,	$UレcッHンハ!ッLロ)ンラャウロゅンレmャツ"6[)ワ😐ヲく	$ロdンYロノツル2ワwツル2"A8(W	R"@I)	x	${cルもrャ✽]ャセワユえルふ6ロ6"81($ルよけルモンwロノル2へッ∧ルこルソュ▥へン]ロヤル25ワこ"#-(ン]ょ":*(よ3ロEぬは2マロRほッ ャ∧ロイロヘマ3ゃ1ヌ3ツロ1へロノロヤンPロtウヲ3▒"#0*ツルらッっ	${Y!!ロユAZヌ2ヲwルソヲ5ンkッY☉ツヲル	$ル}ワ&ッほロtッ ュねュねけロ1█ロユッゃNヲ6RMAMワマ-ン@?K+ヲ⧗ょツツ}ヲ5	$ル>ょルノ"#.)ワ4ルwルメヲこャˇ0ヲこロu"#0)ル6ワ;ほょ0ヲこルやレミフロイ	$ュオえロヤえツル◝	How dare you.	CHANNEL 42	$ャも	$ルニえュねワ😐ルし	capture	$v░やヘルOンd░ロにュの░	$ワ1ルこンソ	$vヲカワpルO4ワテ…dsレエ	choice	Luna	$ロつNワきOュう	x:228|y:32	I:n|aY:n	$レな…レつ…Sヲにciロ"-&(Oヘ8ッるヲ&ルkロや	y:184|h:8|w:256	C:0|next:60"#/-9"#/.15"#0/20	craft	clock	$レムルめヘレ⧗ッろュはあyヲ7wワPねヲ.レ⧗4ワ#ュにルIqユ,ミjCレエ	$レムレいロ-ルほワ❎ュはあyュふルほ4ッマロや|Wレ🐱`qユ,ロア	table	$#`JレすスKレメ`nワき_kッへ_cワ'	$ッのあルkあ	$/*3.ュへやュへ3.*0やュへ	reward_f	v8:t|"Co+:t	$ワ1ッゅけもヲルゃッゅヌン}もルらへュけル5ル2"CX(◝マハマロ6ンh		$ッょヲ…ッヤヌ7ワえルQ"#-)ュほワ-ヲ+ル6.ワ~ュほッ!ロヘワ&ルメュほロmッ◆ヲ[ッ◆ュまロmは5ヲ…は5マル◝ヌ3ヌ/ヲ%ヌ/ュまンkッアヲ%ッアマル◝	NOTICE	P	is the only way	${ロJン9ヲmlsロ!ヲうロこ	$ッイ1ロ!ツ1ツ4ュま	$ワ4ヲ,ルQルQツ3ワンロmロm"KF)ッイ5ゃ6ッlュ$ルソッエツ3レYン●ょ1"#/(5へ7ッlゃ7キッエヌ.ワンヌ1ゃ3をルらワ~ワンンk"#.(ツ3ルwッちマ5ょ}ッエッlルwル25マ5ルソッエ":D(!ロこ	CONFIRM	BACK	$ロてヲニロミ4ュoッオ2ュほ█AッカDGPKレウ2ロミ6ロこ	${ワホロえTワさュみッカロりは6ッん	$Uル'ッGャソメ!ャろfヲm=	ACCEPT	REJECT	${WMSPン@FMGワ░=ロm"$C(GET OUT	RETURN	$ッキGDュむロユワ░ッをBロりは"$:(Gッカ!@ワしン6W!SNEュめBレNIワさヲ❎MKNMQワさレNュもュやGAzッ&4ワヒA?QュゆレわCNJMWッケLュむックBレNッケャのレ#GAヲ6+ロvRCEュめRCッゃBヲ6ヲ🐱	Select	Confirm	$Gャチュよイワミd_ル+レ5ヲ░レ-ルかッHンハ ルGjn!ロB!`mワモッコワ@ュらヲへッIッ>ャるGdッGッJヲへ*ンSワ●ャ█ロ)ヲワdイロ⧗_そワモワv レsヲ░9ワ@レsレ?ッHlrヲ▒レgッ?ロゃレ?ッK*ッIッコ@srヲへロ★ル◜p aロクzロHbレツ9ワ@ュら!zッ'ュい6ッIャケッコ@sルかャ░ワ●z._6レツッ?m!ン+ン8ヲmロんNッLル^ッFッJヲへ,9ワ@ワモルRヲjrュよルもヲjヲヲ`cッA"4V)ッコz.bc07,	$ルりレも,ンSヲlfsprャるワ@ルさlン:ルくcnンラャわlレヒj!mnワ ッコワムュらルeュ2メン8"$A-ッコ"$A(ンレ_ルくヲへロんLロっ,	EVE: TIMED MESSAGE	$ル>マ6ヲ+ッオ1ウロ1	$ッイッサレZヌ"<](イツルモレZレZルモ	$ヲtwレいッるヲQレまレ⧗":%)"#/+ッょワt"O--	$Fcwレきャせrrワユ!esヲ░ Qrル'!レgワメンy=ヲて'ンユヲンルかャょメャゅ dレ5ロgッコ?ル`!"#4(ャナ ルヤ*ッI,	E??	$ワ1ュりょュりをュり	$ルよュwえル64ュるヌルらル27ッシヲ9ンニツルらル61ッシヲ91ュるッスッヤルふ1ハ☉ュれル63"#-*	0|6;0|6;4|pal|2	Terra	Sol	$#ュCレすヲ❎…Qレ4nワナ	H:0|O:0"QP.ek:n	!u:$1|P:$2"U=(fourth_";4)"#1+end	signal	phase	finale	string"U8*w:64	S:sspeech|bM:1	$ルョLmワ:ヲkcレ?ワユワBャケレっレvッDン7ャ●!mdッ?ロf#ンAロんIンsn!ヲンルてャス")>(=レ0ルタ	$レvッDkヲkc#ンAレきそ#ワヤャれャトャナ メ"(l(ヲへロ★kwッ?spl,ンA#▒ル}"$>)ルかレかbロんロお'ャサッJl!ッBnャコロh"+:)ャやロセル' イ!ン8cレtッ>レ●4	$Qレ4ャゆロセ]nワナヲ❎…ッ●ロ0スAロ0ルkHロ0	"%H)	reveal	exit	black	$ワ1ゃンソ	pan	S:sfill|C:0	fill	S:shold"#4(hold	wait	r"=r)S:slock"#@(w	h	fly	"7B(blast_"#t*"#0(|C:0"#:)	$ン{ワt"%$(pgル^ヲ❎ヲなAロ0	$ッ웃…ibレせyhEレせワ⧗Lヲは2"$\(ly|aC:n"#c(S:s"%7("$n)$ッり6ワt"$0*"$T*$ン{ッ∧ˇ"\A(e:50|dV:t|cY:t	$#NレすyOレメvワきwュう	D:5|A:splay|J:0"Eg,ンd"Eg(_qレせスュえュお"Zu(ロウEレせ	$vレ⧗ロなルめッろエュeレ⧗ワˇ…fN…fOユ	$ャ5⌂2お7▤.ュち6き3ュちワ1レ,ワ.フ5お7▒ルヒッめヲゆワオ"\_)ンゆン^●akレ🐱uロハルkヲxワ◜░やロrヲ!iユ	0,0	$ヲ|…ンキヲに"GQ)4,7,9,19,22,26,44	$ワ1をンソ	fifth"[U*$ルョ@_レt!イッAル$= ワムャイルRヲjルか_ qワヘn!ルG_nヲワレspレっロ(ルチ"1&(ロf,ンSワ● ン7ン>ャ●,ャテ?ワ●ュよdレ5!ッK "/9*bpッK=レKレ,ロ(Fワv!l_メ!gレ?ルチ,ャテL_メレ?bャアル♪rャ✽ャるNャコレ?ンヨレっロ(QルGロ★そルか"+#(,ャテRルGlワ:_ルくロgッCkヲkcレ●4	was"aV-.	$ルニ/ワt"&C)ロハン^レ🐱akヲ!i…ワ●レモ	$ロつ_dワき_eッへAュにロへgュき	hP:30|hQ:3"=C*ルほyレなヲは.,6yレつヲな_ヲx{deレエ	$ルニ0ワt	q14	$ルニ1はぬへタdv▤"EQ(ソュろハルこル5ワこけッソュろッソょル◝ュるッタュoッソワこ"#-+ょロ1ょッゅヲ`ュけル5ヌルらワ-ヲ0はぬヲル"#+(ュれワ-ヲ0マンhレウ.ン}レZヲ0ワこ"#.*ン}マル◝レウ.ヲ0レZヲ0キルしレウ0ッゅルふ7ッオル5ょルらレウ0ン}レウ0"#?(	$ル>ルゅロ6ルこル5ッス	$ン{2ハょル5は"]S)ワq6ヲひュろぬヲルワ~ヲひュろヌルcッセワ~ヲひルQけヲル"#,)ュれツ5ヲひル27ヲひッむワ~ヲ+ワ~ンPッむ	x:18|y:20"\K(ルこ}ワ>	x:92|y:4	$ワ4ツ.へヲ[ルQルメロせルQロu	x:111|y:56	$ワ4ぬッチルwッチロuル☉ッチルメ"#-(wッチルwロせル☉ロu	$|チレqロヤゃ1けツヲルを0"Gd)ッむ"VQ+	$ッょルQツへン◆ロu"#//9ワ4	0|8;0|8"4g+"7L)"^m(QルQュˇンンルっレミ▒.	D"e%)	11,13,8"HM(iルこ"^<(ヲ…レZッアッま	${1ルゅレZレrツロ1ワ-ルゅュねレrワこ	$ュこルこャ⌂0ウルら	$ロ3ワ-ルソヲ5	${Dgケ☉ワ♪ロこ	S	${Cvルi☉ンYロこ	Deploy	$ワ4ワwロせュˇルH"%0(りけハをュるワこ	$ルよワ|ロノょヌゃけロミへ"&#)たけ"LE+vロハッれワけヲQ"':*ふレ7ハぬロヘハレ]ツルらルふュいハぬヲ+ハレ]マルら	$ワqュわル2マルモゃょルモ☉ュわ"#5(りル2ン🐱☉ン🐱	<2D2DCLC@O4C<C<2"vY(0"vi(	ending	C:-60|aP:0"a+)ロイッっ"#?*_f	$ュこゃンソ	 	$ン{ハウロO	${`レ[?lrqッ∧ワ&ッん":-(わゃッサル6レZルモょツルモ"#6)をロN~☉ルこ"#6)ヌょルモツマルモ	$#Kレ4O]Sヲほヲてレ4]ン☉B]ッツレ4NNNN]ySレ4ヲほヲほLyヲ7OWSQOyッひLO]ヲほッそ"#N(ン☉yCレすyPレメQワきMレ4LヲほOL	_P^P_	^Q^TR	OPNA^	$ルよハヲャハロ█ルらえルH☉ハウル@ルら	p"e5)マル5ワこワw"#,(サロ1ルHけハッタサレみル@へハルリ"#.(	[	/	]	A	D	${-ヌハッタロこ	$ン{}ロ웃▒レウワt"g7(ワエ	menu";P,0	ABCD,	$ルニンvはロOルこルゅ3ロO	$ル>ッアン|ル5ッきロtえ"#.+ッまもへッオ/ルpルる	$ル>ヲ%ツハワ&はルら☉ハヲ%マハヲ%"jM*よン🐱をッサマッサ	IN DEVELOPMENT	Move	$ワフのル}ッヨッツュwレ😐ックBロ'LルなGッケンFワ✽5ワくルよ▒レわロ7"#'(😐AJMAIロえレ0ロマッふ✽ルヒの{にKロ7レ#ロ7ロぬB?GJWン웃Pロvワコロル✽ルレの{ロルレわ/🐱Bルヒレ😐ヲ🐱VRロえ!Jュぬレ0"k1*✽ワャのュオ▒レ#/🐱Kルヒレ😐BュもッをPWン@GPASワさ▒ミ0ルJ1ヲ2ッり▒レわ/ミBロシッテD?SJRロえレカJュぬ▒ュそュんワく⌂~ッツワ|レ😐ヲ🐱URッカ'Q!ロ'ヲ6ャち▒ル✽ワオっ6ノ~yE/ッキュwレ😐ワ?RワホEル▥ッケLR~▒ュたヲ2ワ1~レ#ワ}"#'(😐Xロ'M+NMRワ?RGルx!NMロvロ9ロルル✽ュんワq~レわワ}"#'(😐"JG.きッゆロ,⌂てルニュゅワRレ😐"W`-▒/す3ッらヲ2ルよ{ミミJュいロぬUGJッゃFットRュをュちュんルよ🐱ミBルへレわルへッテTMGワ░ロえレカヲふュみA▒ミ.◆ロシっヲゆミミE0ッキワ|ッテL?Pヲ6Uロ'!NワしF~~◆1ヲ2ルよミミKルへレ#ルへロぬNロユWルなSPLャ★ロル◆6ワくルよ3⌂レわンˇBレ7ロぬUFワさレNヲふ?E▤たおヲニのッょュっKンˇKレ7ロぬEワしレNットュゃルxCワコミ0おルタのルよ5⌂ヲ❎ルへヲ❎ルへロぬJュやン@ヲ6ン♥ヲ6?BQきワ✽5ロいのルよ6ュっ|Jャヒレ😐ロvRMレカ?@Wン♥ュをヲやルタのュこュっBワヨレわワヨッテTMU!?E?ロvヲふレカUMPJワコミ.ヲや67っ6~{|E1ッキュいロぬット@C?ュめ@ル▥!UCッ=FュむMD!@Cュゆ~⌂96ロいッナ{|Kワヨレ#ワヨレ😐DMPRットC'Q!UFCュも▒ロル96ロヨッナ🐱|B2🐱Bッ@"&t*!Dヲ6K"$g*の▒ッめロHッナミ3きッツ3.ロぬロユッゃIュゆ'Q!ワ?BE?ッケュをッめロヨッナ|3レわワ웃"#'(😐"&\)Rン✽ックル❎ノワ✽ャ5/っ6~3きyE2ッキャヒ"&?)웃?K@ワさ~▤✽や4ッナ3きレ#ワ웃レ#ワ웃ロぬMNワ?ュゆ▒ロル✽ン'6ッナ5きレ#3🐱KッVレ😐Lン✽Q?DレNQOS?ロユっ▒✽ワヒワくャ.きレわ3ミBワロレ😐AュやJュゆフッそッニ✽ワヒッイ6~6きレわ3|Bルレレ😐DGロユDJWフyッヌおルタ⌂て6⌂ュゅッ%レ😐K?ロユルなュめLOSGJJワさュみャ★ワVュア▒✽ロシ0ッナ7きュゅッ&レ😐ン6ュめロえAMELワさ?▒ワVRッニ~✽ロシ🐱ロ,⌂ッりュゅッ'ロぬQット!ルxQン✽ュめGュゃ▒ワVッヌ⌂✽/ュん{ンˇ3ュゅン'ロぬット".'(ロユワコワVJンルャ✽▤	U6455746684779488:499;4::<4<;==<<>?<=??>>@4>?A?@@B4BACABBD4BCE4DDFSEESSFSHSGGI4IHJHIIK4IJL4KKM4LLN4NMOMNNP4NOQ4RPT4RVUQRFG4FQV4UR5TUTR4U	$ンウロ0yッひe"fi(マッふ	aY:n"cR)"#.)"]A):n	SELECT LEVEL"=s(Qえワ♪☉ル◝"2u(3▒ルサウワ♪ヲ1ウンrサヲ1ッっ	$ル>レウロ6☉ル5ワこ	$ロ3もウヲ1もレリヲ1"#S*ウル2ルリ"#V(ッっ"#6+ワ♪も"#4+ロて1ロムヲ:ルpワいはッネルpワい	$ルニュイロねけロメけロね☉ル◝ュウヲ:ュエキルしュウヲ:ルHンhュエルHンh	$ロて2ハルふ2ル5ン|ルふ5ロ6ル◝"#_)ン😐"#_)ワえュウぬン😐ュエロt"#,*ルHロ1けュイン😐ょュイン😐ル@ル◝"$P*ルふ1ン😐はロメはロねッま	?	"%w( 	$ロ3ッシレfレみ"5s)ウン●"<7)ル25を4ロ♥ワえ	ACHIEVEMENTS"Z4(りハロりロ6ロ1☉ハ☉ル5レrハレrロ6ロ1はッゅロmハロmロ6ロ1	${=ル6ハル2ロ6レみ	$ュオン●ロヤロ♥ワえへン●へロ♥ッスャˇワ&ルpルるウょル62ルゅレみ	RECORDED	NOT "#0,0.5,1,2,4,10	SYSTEM "[Z(G	$ルチン@ュもJQュカワマ/ュクュカワマ0zやb.a1"#)(2ュク*@Mン♥!FN*ロユュゃュむBC"5p(Qッノ?PL!ックロユ	,	$ュオッシハロヤょハウルら"#1)ヲ/ょハッス"%0(kロヤンkヲ1█?SRン✽Q?ル❎Bょン●ッん"92('ゃを4ルゅワえワ♪はを2ル6ロt"#,*えロ1	$ルよや☉を4ルゅ"AA(@_レtン●ゃえレみ	LEARN MORE	${-!ワホRQン]ゃッんへロヘロヤヌ2ワえへロヘへヌ2ッス	$ワ|ヲ█!pfwlレ$*ワモワナiレ?ンリ*ンリ!bcqgeレヒb*ンヤメh_k*rcqャ✽q*`レ[ワナrq	$ロ3へ1ルpヲ5もヲ[ょ/ルpヲ5	welcome to play	wscazsos@gmail.com	A Program Duck,Rhynic Studio,3,4,5	$ロ3ツ1ロこ"DJ)☉もぬサくルHくレミの"IU)ツルQ"IV)ュ⧗ンRッっ	15,2,14,4,5,6,12,8,6,6,14,1"*b(ヲ95ッほワえワlンYロこキンR	$ル>ュしレfュしルリ"b`(q4ルメレrルQワwレrルQもレミフ	$ワくン<ヲこルサヲこサ"#3(ッひャウwレわルそH…Oレ🐱"sl+スqレせルIOレせュお	$"t7(ッyヲにdレシレエロSeヲにヲ|ヲなWロ0ヲて"hv(ュケロ+ッろルOン░ロモュとレ⧗ワ❎ヲぬロモヲsワpリッるッわュケレヤルOン░ねュコン♪ヲs4ッれリロに"#0(ねヲのエ"#.("r*(ュサヲのヲぬねWレ🐱ュふュサヲ.ヲ&|`qレ🐱ュコレエャおQレエ9zッ'7レツルヒ0zッ'`ヲ█iQン♪ルYロなレ⧗6zッ'3.a+ワV"iC(…ヲ.レ⧗6ルIqレ🐱ンワあロにmンハあ{ンy…iQ"$6)ケねuワけロ+0レ ルめワpロ+ッろワけリ🐱ヲ▤ン♪"%7)ワけヲxレ "%9*ワけロc."][)"GB(レ ワ'🐱"#/,…wヲ&ッるルYヲねュとヲ&ッるロcヲねュケワるュかルOレまッdygEン♪ロ+ロなレ⧗ッるュサfエ{gEレエ"TX(ッ;"&N(いルkリ	$vねヲのヲx6"#/*"$#("#2,ンゆッ;エッる░ン░ロや"\b*64"I+(ヘルYュかュはュのレ🐱ュふロハッマロや2"$*(|ヲの"#:)"&4+ワる|jBュに	$ロつWワきjxレエ	"]J(vx:0	aa:360"WO)ロつWレ🐱jwルM1"Hh(レョュさたキワ>	${#ャ⌂."q.){#えルふ4ル5",@($レムロハ"p0.ュあレす	$ッのュな░ミ`dルそレなワきレつュう	!!ョウををョョ,❎&あ,]>.]ョ,h*.C`0る',あるK')>&TI!ヒ'0あ'Qサ$0ケ!*^!`を❎0Pあ&TI*v'0◆あ%TI$x+モこ!`き❎&(@&あ$T◜!Mタ(>$あ#T◜E(>!'xUD◝[(>けヤあ!]🐱(;*;Uz9░チp7 <(ユ-;#-vあ!]7ケ4%ツケ!UCんヨ#;-K✽;てQ4.{)Q♥*0▤せ.Uっ%-:%Uゃvタ{(k)9 タUC*a[ノ❎7-H❎とD~UB_(r-;#てG#いヒヒ-8❎V&の !せ.G)zひ!)😐;/)'G)6く.*&G.k!ま)r'▤TラV$ツま)け<P▒U2みI!$Iこ░9$ゅVそ0ま)4%U▒!e!A-UI@$%.C★0*❎*あ*]る)rタ{(Tk&KP<❎*あc<ケ]リUル(Tk0@+))TkP❎(あ!T▥w)*]ョ!き ░7.` U?.&U?✽❎&あ#UルW ノUレW9░$%;░xUC*e+8+UI#A タあ-T8BWxE &&:░▤0^ [あ.Tj!ウ &れ')e/웃!h &E *をETゃテ6,T Oi*Z	$ロつ"(D)ッへヲ-レ∧{aュき	$ロつjsワきpロc	!!!か♥=ねFヨJヘ^ む.Bヨ=カねc *c7ねけ -L▥$JACら ヲモ ねコ 45XL-S"#&(*)<7B2け B V0😐そ A❎e!い{M%>L~ヒ7{Mっ .c@^❎ @F{!@2I@2ニP🐱 フ⧗ にヲにw $c8R2ワY<jc=てヘ @2^ャcス="%[(>/ctJ5-ウv#T6/ウKけ▤か7@か7w りFか7ヲり^か7⧗ り>か!c`Oり?りRりIりEり[りPりH@!#りCり_りfりみりkりhり♥ `7マ7しり9マ7すりヌり<マ7;マO2(30せ'G ☉ B4ヒ B4ょ;4ヒ ;4ょ@4<♥Lの5U)D3ら)-UのQヨQH)Uツ-3ワ(3A#ツひ るjG |F@<:F@ハ>8<:>)J W3▤%Tツ3ゆむ_@<E@ハ^8<:^)3x%TラTせTf-Jっ30zワ Aん2かレ9 8ヌ,Jk*JロTHと :%,Vシ .G/▒-Vシ:J{む)Vシ<3A .G+っ;@<:;@ハF8<:,V'もJ2/"$4*T #-█ $0V+◜?B5L[9;B<ヨLのv!B'U W7>'む/Uf Qg!3▤(Nf%U8.:>ヒ $T8+ふ 4a?'Y?)UC+UD%Tf%た5/L⧗ 70J▥LリふZ:>とは+*ヲ:のJ2.レ!ちp&たルGo 0V(い;J♥LHとW2.チ-xV,8/+LのV(てと?lYf(Vる>ひ!シ!5かゃチ⧗JヘG#wJ{3ゆT 7Q 4█ (.G0zひ!m!#e*)#)G)▒と$,▒と$0[-e)g!e*I)90♪…ん >と4pVB$'d#H%ふfと#.f V/I+i&イd()オi▒#/♪g!)i'✽-i'タ+aもG.'はe-%/+i,k,1-m7ウF!~c4ヒ @し2^ン29[29せ ゆ2みハ`⌂ rよ'웃*よ(ナトSトSト$%vA6れっ >7@2Bュ=B7ヲ.c8^❎ 8^2p ^2つF❎ の=7のJ웃7 か2お*L▥と2▥フ78(L⧗!Lうにお&L▥'LBこ 892p R L[<にワM*v5⧗ :F⧗ に>8:;>)e%-x2キ2ら ワ 67<724と$.ツK$vヲ679@67マラ!6786'U8/^ $v8^る 9^ヒ!A%NB/ヒ)v8^そ A^そ >^そ 5⧗U4◜]5"ZO(6226:2828	bf:3|w:8|h:13	!	s	v10	$#ッはヘレすルyュて	$ッはッれュて	flip_before	ek:n|U:f|fH:n	U:f|en:0	$ワ4えッチへュ$ロせロuロイ	$ロ3ャ…けンrン$ノロイ	d"]c(_s	$#ュアレすッそッニレメッヌ"6,(ャ~ンヤrレcmnワ ルつ!`ワ c_ワモ!ッBqラワ ルかqiヲ░	$ャれppンロbワメrpsワモ!ロマmワメlgヲjr*	$ufラレcqヲロルくnルかbン+kヲ▒mャ▒ュア,	$Ugワョ!uレcッHンハ!ヲンヲワュアレネャツ	$UルGlワメャゆロセレネャやbャっルeュ2ロソj_udsj!ル$	$ン>ッふル^レきロソャわイルつ*	$"$C(dケレcRッニ,	$K_wッGdイbロgッCャっルなッニ#	$ロおッCッヌ!ャゆロセ!ロソル♪bレcンリ!+!wンル!ルチ!ロセmmb,	$ャ~egワBッGワユワB!ルGッC"%5(ルGッC`ン+ャゅ*	$ャゃ!ルアmルもル^ロ⧗ルGッCdケルつmk,	$Fmnレcャ░ワ●!`cッAッヌ,	$ル}ルメレrヲ…"cq)ルよルヒル60ン◆ワwロu"\7(}ツンh	$ワ4ッ!4レウ4ハルふ6ル5へけャ∧ロイ	`	.	$ル}vロリやハ}nンsま/	$ルよャˇ3ン◝	$ル},やンテンQ~ウンQュ%ヲS	$ワ]wャBッqヲc"#.(ッqレˇュ*	$ワ]Sルオル ciわレRレGワねくルoレRレGロ{くレ&ルエルオ/ワル☉ンふルC4ンテレ|ンヌルoる/ワルぬルヌ"#7(ロi"#7)]],"\""),"\t",_j)fP={}hW={["array"]=function(...)return{...}end,["empty"]=function()return{}end,["[]"]=function(a,b)return a[b]end,["+"]=function(a,b)return a+b end,[".."]=function(a,b)return a..b end,["-"]=function(a,b)return a-b end,["*"]=function(a,b)return a*b end,["/"]=function(a,b)return a/b end,["%"]=function(a,b)return a%b end,["^"]=function(a,b)return a^b end,["=="]=function(a,b)return a==b end,["!="]=function(a,b)return a!=b end,["<"]=function(a,b)return a<b end,[">"]=function(a,b)return a>b end,["<="]=function(a,b)return a<=b end,[">="]=function(a,b)return a>=b end,["not"]=function(a)return not a end,["#"]=function(a)return #a end}function dl(aQ)local ad=aI(aQ)for s in _a(ad)do
if s[1]==6 then
s[1]=0 s[2]=cG(hV[s[2]])elseif s[1]==4 then s[2]=hW[s[2]]or _ENV[s[2]]end
end
return ad
end
function bE(aQ,az)az[0]=_ENV
local bg,n,i=aQ.bg or{},0,1 aQ.bg=bg
while i<=#aQ do
local s=aQ[i]local ac,a,b=s[1],s[2],s[3]if ac==0 then n+=1 bg[n]=a
elseif ac==1 then
local v=type(a)=="string"and _ENV or az
n+=1 bg[n]=v[a]elseif ac==2 or ac==3 then
local aA=az[a]or _ENV[a]if not aA then aA=_ENV for aB in _a(_c(a,".",_j))do aA=aA[aB]end end
n+=1 bg[n]=aA[ac==2 and b or az[b]or _ENV[b]]elseif ac==4 then
local dm=n-b+1
local bf=a(unpack(bg,dm,n))n=dm bg[n]=bf
elseif(not bg[n])==(a==1)then i+=b
else bg[n]=nil n-=1 end
i+=1
end
return bg[n]end
function e(L,...)local dn=fP[L]if(not dn)dn=dl(cG(L))fP[L]=dn
return bE(dn,{...})end
function F(cj,...)return G({},cj,...)end
function G(ad,cj,...)local hX={...}if e("$ル>☉☉ッヘルCレzと",cj)then cj=_f(cj,2)end
for bN in _a(e("$ル>ヲむ",cj))do
local fQ=e("$ル>ルCレラ",bN)local v=fQ[2]local fR=e("$ル>☉☉ッヘ",v)if fR=="$"then v=hX[e("$ル>けヲみ♪ロJlsッハ",v)]
elseif fR=="s"then v=_f(v,2)elseif v=="t"then v=_i
elseif v=="f"then v=_j
elseif v=="e"then v={}else v=tonum(v)end
ad[fQ[1]]=v
end
return ad
end
ew=" !#$%&'()*+,-./0123456789:;<=>?@ABCDEFGHIJKLMNOPQRSTUVWXYZ[]^_`abcdefghijklmnopqrstuvwxyz{|}~█▒🐱░✽●♥☉웃⌂😐♪◆…★⧗ˇ∧❎▤▥あいうえおかきくけこさしすせそたちつてとなにぬねのはひふへほまみむめもやゆよらりるれろわをんっゃゅょアイウエオカキクケコサシスセソタチツテトナニヌネノハヒフヘホマミムメモヤユヨラリルレロワヲンッャュョ◜◝"
fS="  1 # % + ! ) $ & ( ' 2 0 #!* - / +!##&!, 1!)!%!3!&212#23&!!(!3%$!003#3$1#!&$#3'4)'!2&. ,!*!3(&#2!1%1$-!%#0!1&+#/!6.0#4&(#5)9)9#4:=&4*%26)7!,#6*2)<)$$4+3)'#2*$&-#*#2+C.8)#78*1'($&4%$B)+$&$2'9!B*;'5*A)4$488@0$+%4!+7>*4656%7+23.3,98-$%1#$&=(2958,%'$13/02#&;!.!3M5;<*5F941/5!@7)2>:+&1)0&,$A*5,*$%=1.+4>>K&#'0=#%5:(&7%5.+'6&%&?!'$G$)73*L#?$4@:6M&)&#='2(=2,&%6@9D;5;F:!K!5#2--O8-4,<,5+8!A84H6F6(7#SS/#E2"
ex={}for i=1,#ew do ex[ord(ew,i)]=i end
function hY(L)if not dp then
dp={}local fT="0123456789abcdef~"
for i=1,#fT do q("$レめルサもッヘロの",dp,fT,i)end
for i=1,#fS,2 do
q("$レめン◆ン…レ{テテン◆ヒン…レ{テテヲすロの",dp,ex,fS,i)end
end
local ad=""
for i=3,#L do
if e("$ル>レRウルあルせはとワた☉ロ5ルtロラルエ",aJ,i)then yield()end
ad..=dp[ex[ord(L,i)]]end
return ad
end
_sb="\n !#$%'*+,-./0123456789:;<=>?@ABCDEFGHIJKLMNOPQRSTUVWXYZ[]^_`abcdefghijklmnopqrstuvwxyz|~"
_sd=".y2y9|y09{y/0y8/9/8🐱^q█/●{y1^a~}938{9🐱)~.};~^hy2^g84♥웃♥░✽▒94❎8y3}⧗█0r▒◆▒;∧y{★{lmy.そこ◆す0▒}し}+てy█.8|y4█1░▒😐あ█2な~iy}cYZ♪⧗✽⌂..😐ね}(…/….つ/81▥웃}ち☉0}むy6█3_j█49にgl✽~80さ▒▥░█ˇ♥●pc❎░✽▤お▒y_^p_`}qnゅ█6ん~ˇち}:8に█7}-y5えく☉くy7ywう▒█51yぬvkcさ⌂セ88.r~gj82★まみ▒}チjソか1お~ラj}<な♪か0ar…0)♪yv░~dル'q웃☉.ふ▒✽♪✽め☉/か2よ~t/}bい_ケル+8ト/▒}_✽のナ∧p_お▤r_ふ⌂😐웃fc✽きy`90けネりv8%よめ83▥●☉4msう⌂?シ▥ひ+~E~#∧86う~つ1タルDqc😐░lbせ_ル0き}adj!rや.p▒う▤gr}ル-yf😐ルLか3}ル<ナ~☉ˇ}Dふ~cきぬ,:~}ルWょ2?Jyuルdルg☉わル1]{.ya}ルXル(∧い`カ~91らわsスは0}&b⌂うのk_とオjイ░⌂ル]ヨ$▒よ♪TC●まJCを6ルfムル,6あ▒v~r!g웃ic^n☉3a_ル…ルsお⌂ル웃~れyうきいacbイe😐…!Rf_ん♪か5クまp,Uルx█+1/87☉ル)^tルJ~85kg9トq▒{/ルnルbルひル▥P▤}`ゆeと░▥ニゆb✽ノせ`☉1メルBnp!8☉テル(~さ~モせ}ルˇか6ルもル⌂ル#ヨウも░▤いル9ル♪ルおマ}42Cル❎kイルq▒njあ~{0☉ほキ<☉6カ▤/0❎あルさルょやˇアws,✽っヌ4ル#~Pルつ★ル$いcルPミもく+♪32t0ろルTネ♪ルKめろ_BルはルャルヤルュywルR}ルし9v.ˇyKga😐ひアvル_たあ⌂コ0V▤コ149!Gan♥ニ▒🐱ec★@●@8qmpルツ~1070mルく웃_とエ★ミうノル3.q!メkw⌂●ル$Qル&3d░き:∧ル v😐らうっルA░っフレ@レ.レLレAC!タルトおきとル[さきnレ9レS~ルネ~cdルK♪せFへ3☉2w!を5やムル wn~か7<∧c!ルeルG♥ねルリサmlつ3いdレDルレヤル%}d}ルzネ~せMキしrたけ2u_aiえ/ルチyrwル`ルてアA06b~み~とれゆdとルOコ.░yカ⌂03,レKルホレMajルタ9ク@ルイ!む~ルlレjˇルu/ル█░4アf░/コ/mケル.★とリ░.ˇレbル{ルコルヘた`_*!pルB✽フknレこレwqルアルM/8c4えろBツくtw░1ろatvルミ`●ル♥…2qひソルゆˇ-うフいfcレx🐱f}ルるけテル|ひ,,…1░のアuい?ルへレ^いb]`ヌル⧗yBたヤ?ルCレ●レ,ルユyカの21nルにレアル^ルふ/8rルなFレオレNつ5せBpル`2ル!レれレVレサレ▤ルうレろゆgルF_ゆa☉レ8.6ル?レ`せH}レ*け}c▒ルemルい0fmlcレ0レ웃ルAエシ4ル♥lタレし#vルM🐱8d…uル{レOレユルiレヨ⌂ルササはテる☉ルSル★れレkとモルoオあ▤…7ル*3yˇみ⌂いtい]へ0ルZル/gpロ$a░5CPルりytccレさ░266|w_Nル<ルb8lルnき05ル>ウ☉ルjル]こル5も//_RR▒ルhら7ルvルまルセエ~♥ルそルwほるぬ}esqˇルV🐱{ルやルコc⌂レひ♪.4ル}9rm★GルラレCル^ヨ☉ル#ロN⌂bレ{4▤6えyjˇしゆhI▒ル▤w…4ル*/oた}ルケカきルPま웃Hs~/4qル/░0ル}レえゆレおルGケ!ル◜レっルョ0えレノレ♥クル$レくwけ0cj!dレ1こルK~yレイル4ルVキロ/レミっGLキレTルTレ★キルuレケ▒ル uル)ルケル▤vルけひもサろ`_Lとあスct.ル66kロBロ☉レ$ルこロEルSらせf☉ル◆,3'レ?b!rgロˇメサルN(~レ$c5ル!/2ホ.レ-LWルR▒ロIヤトねロ*ロくたルソルるルIo4ル░Sユル☉ル☉ル:ロpレムレすロたヘロちレメ{+チ~{w{fルイレカレfくル?ロP`jレ◆ロwふっydおフ😐ル,웃dル*5░っはタエ.웃`ろレんル?uけ3ルとˇレロヒ0ル!ルミ_ルうへ,!mufgac░ノ23ル#レqybルIAレゃゅ}fレBスレハロ▥tたコ2せa/1ホ/qrslgnレフロ(ル?ロlロ∧たr⌂ル∧ルV_f●ミルをAへ6エ6ルasルr7は/ろRイrハツハロsハル5リレ を1PC3413331▒qニルhルシへテpこいNとルYコ3p~さノいルロ22clルむヘyWルあロ|ルFiル26エ3ルyルン9ミル[せc▤レの웃☉526オぬaあ{5ルヲルzゆチロdロ⌂7ル!ルm2G▒ロ%ル0ワ8▤!k.えル96/3レ☉ルゆCLG!レホ5drクI`K★Uルr6え0ル^ロトb▒ル0nけルぬケjワLmワM_ワNル⌂ル~i★X.3qoワSロヲつ2/yル f}ロzレらルえレりルヒワZレ!🐱まh▒レWルVレぬkルのwえˇル72😐ル/いHルオせロら~ツほけ5へルせロ♥レナウえル░もルハルHるけ4ヘ{7ル∧ルルロもdワsルおルeロゃcpえウ♪ちル*2^uル$,0.0/ヌ6…3ホ03_ACた9jj●Gレにn3/れスえル4ル20クミ1ス2ロLycル~fル%.|uれ▒ゆiレも~nワH|4☉ルらレヒvワおrルMミ{4ねfゃルらGR?RレOgはルぬs`さ▤ルい/259てレ◆ムˇレTル?ロVるル6レ&レよロロヒいTワはユル35ルわ.レりワ[ワほワOルワ3レ'ル&け4ル SレにJFりいMルけル/ルcm░3ルのv░フはル▒ロ_ヒˇルWつ0♪ル-とルほルZら_JレXほルソロ웃ワウ⌂/6せルロワ3レqれセおのB▒ˇレヌルFF@た1ル!.ロをワソ2ワタル⧗るゃス_q _lレかレtラ▒いjルI?コ5.702aルB?LJ!レd ロお!レd!rfロかレvjc2/クGロn~せOル_⌂31クレマル🐱mゃ0レニ[74ルaFqfル~eニAア`░スクUホ1ル23░6ルとレ7ル;tマテレ)ロしけ7ぬぬ__aFハへロミル5ゃル◝6の}ワJルアロマヲ4▤PMLレ4y?ハル6ぬロねレP7アWもルNルJ|とルめルきロxル ロ8}iルむル.ル;Wシ6ル;EcたルlワまaねルPル♥ヲJkル%/3ル!aレ(ˇルルルたら░7コ7}ルセルネ∧ルAれカっルたレE웃ル9ワeワをキレFは4s▒ルFaとルカけ.t▤レoほ}レは★IIわル4ルˇホれルスワチオル2efmtk!!メル∧ル-ル?ワ7りロ…Iユルれワ^エ/v…ルユロエレ>ロあゃ2エ2オ☉ル70😐りt5ル😐レゆヒル704ルて!LCw,レ1r♥ロ=いケヲ♥レsヲ☉pヲ웃bヲ⌂]ヲ😐dクsけ6ルキけ.5レ⌂ロさレ%ル&yAルdロタレ3ル.ルラAリ6ょ4ル;ロすホ2え1●Uルヘ~ルゃ@ルノをツル8bロM}ワあル`~いRル:ロMルE4ルE7yGルpa…_レモyれレまロにロモwレヤ8+へ.QR!ルiOO35タワそヲ;レラロは⌂りルヌ956▒へルぬレ…オqル★ル31ルのロ8ニwモぬヲDユ▥ロXルス/t~レiレシルす2ルt3qル▤レつりレソoレ&ルマエ1ル*1X▒ロよ/ルワレ★ルO/ヤルm`Md~レP/ヲソレテルaEみ▤NレU웃Fイ▒00レ>レPヲヌ5ヲネルメヲノワkル|レ🐱ほ☉みきニv😐ニロ😐レ░ヲミヲfヲg~ヲメ⌂レ◝6るキえゃルQ.ょˇルcワ9へくルG!レネ!r emをほウけロゅワヌレ░サル▒ワ/(めルZひレGレち6ロjタルアロほ3Oた.2ルけル★4ロjルFbケ_ワzワ`bg4ルいルそワ{ルれVえ.ひ.ルBtン3ルiン4レ[Rロ'レ1ルかaf!ワニ'ルかレYル▒2えロ#ヒル◜!co!AロチルチQmルGルはへほル:ワリQたルテロツいOルえ4えルまXロ✽ワヲル●ワすこロわKるもゃ/ロqワッチ▒レ-'++yレほワ…A★3ル%4を.aBルE1☉やワ⧗sルr5ルゅ2Xのロヒル8けルN🐱uˇレ*ルをレCアロ.}ワいるルすル🐱bル2/レかヲせキルXル;mルamワ⌂CルIcサルHccルゅ1ンtロOンuはぬレえレ☉mンxレtワヘワBロて/レウハヲ/ル5ハはル<き⌂ル✽キロと4ルkM!ル24QQBB!E?!レfほレエレ えレリ}レ5む♪ム01🐱わリふのルれjルウル@みのルT0レたゃルわ/Hたレたけコ6ルマレˇけほルqきルAルほロ4レ♪ルc_ヲんロ5ル&/ルrレコレるf…6ヲゅレスpたるはぬルtオワもルhル,ヲ@レワル;Mレチワ$とレRルSりロ]ル@ワれ●ル77ヲWヒルきBるせK▒エ0るへヤル*たレュれ4ロ🐱レ▥ンれロ🐱ヲれりルIaルcIンん~ル:ヲセヤルフルれロ`レャヲタルカi``せNオマルカヲテルロ1ワjけル|ルLaワなD▒マくレIロめルれヲaやワエキ`ンタロ`ルQル)/えワカ2ワmレJ5えルt/ルIQロ:ルたjbホ웃ル*7ル%6ル74ルjDるょもル8_ケsne_tレcbmワuワトゅjcr,ルなgcレsルiワ0っルHル@もルまヲOルセょロGルツ♪37ルヲレ6けけ☉7スDン%テ./.0.1レ_レちレWルzルち?웃aン(ワらルいン)ルavルッvル;HwたヤルクcmルF`ルlン.ロるワ>ルcSロキDレゅルっレBワノ6ヘnのGEレきルり r20ワ:レ[_!p!ルりレきワょルS* ロg!aルRレネmルDルくレgcワユ_▥ルそレeワやさのいFルjルケルkルンル●ルち24レGレ_30ルテシルぬcゃ4▤ル=ル:_★レマロ>ワ☉ヲ♪レスレタロケはレQj▒ルね.れ6ル7/ル~W}ロテエ4aきル36ル_のル22ル37はˇせRレWル-ルマほルッMへレヲワュはgロ)スiレnルあワ,Iヲ▤レシレ3ヘねi}h😐ル=W~ル&1ルクワ★ヲˇレ3ッ🐱ワ◜レ<AdJゃ5ヲ P`IレY4えル8ルq▤は3ヲ!qロ ひひ0ホ4ゃ.ル😐らヲ}ヒワちレ♥ひ/_ンaルlaル@ょルをロ.ワョjヌ5ホひ♪ンlッけンmル:ワIレ:mルatルpレ♪yRをンeツ6レ:Cル6ル◆ルE5ルE6ンvン`ッにロOル~JロつuvルY?レ4pmルM|レ]レ]ルpン█レョチヌル◝97✽6🐱4たル✽ル✽49レょ{36ルyヘレヤ4ルyリヲねGル❎をレみヲ3たB!ン~ル5ルよ4ツ7{6ヲkゅッウルbハヌML{EKMKC,yルpロとルふ0ルpルしロ%▤ヲ9ル5けル5ぬロせyJレ😐ン⌂SLのルニcレくンBjロメヲ:*ル▥k▒7レQレhもヲみ⌂ルホヲめル~Fモえ1⌂~|ッメ6ル6/レzっ▒▒ルそgル@ン▥ら4ロへB…ルへルカOワぬ1るツSル●へル█qたレ'シヲっル=レ;/Nたルちbャ!ユいsいixたル;Jレ'ルすル:ロ9ル🐱`れ/0ル=レキえルニ6マル⧗ル▤レな,0ほルtルC1ょルせ76レ<fサル8T▒ル;ワゆレらレッヤル7ルのレなャ<りふ▤ロ?ンひ`▒ルAリワWくワり⌂ワ%ルCルのヲウdFわモルyくろル9レ}/ンわヲAャKロ<ろHレケレョャNbャOヲ]ル🐱aルゃaル{ンゃりせロンりレH4ル▒レいヘ★😐●わオヲ_ロ●qヲナル,4ワアル.ワアヘほ★G⌂レhえるルwル1ル9ルゃEセあヲdンネ☉ルエレトンクキ:ャk♪ルAルYワnレJおノ4ル.ワrロFルんCャrレをレ;.はルせレoレmンすルょャw~ロふロろ?たレタKャ{た01Rヲロ ルにd!レ,ルョル◜'rワvルRrゃくをくレのひえけル_♪ルSひル)ロ▤もけQ▒☉,えょン$きルきaルんンおルス6ろワ<マ0ロDBロ2テyiロキUル;vシワヒレJ2カワxルl6ルオルaわルめjgレ◝5レゃン-Pたレ;5ルcレ`_Vはレ!ルルレはムワ🐱ャぬワ🐱AFワマ2Qッ=ャひLャふルxャへロえャほン6ャまDャみロ'ャむワ?ャめワ░ケ!ロは_レ0{ャよレ웃レ-!, ワムルさuルiaルにっすャを7ロっl_ル`ワモルてqmレgン:`pルト_bKレタロZル:Lャカ▒…5ッFルりンロロゅロ) ,レフ,ワヤgbamロoルRャタル`ヲ✽ンCロかルョメン9ロoレ5ルUル4ヤレayル9せj⌂ル=2.レ▥Gルcロュ2ロTGユル%3ルけルシe~ロ[レmみレさワワユsルI☉ルわレVレ#ロへGルq⌂9.ソみャワッbセル●レるhル*046ル:ッi55ル:Sャ◝⌂レ}3ヲiるツ2ワゃワTロニル.-~ロニヘル[ワ!ル)レはとルオロDルTル1_ッsッt☉レQロるンRはル◆ルにルかセひルヨnレ⌂ヘスPらレzル%5░♪ッxヲ∧bi_Aン,ルナレ/fdIわワクュ@ル●ュAル%`NクンVQワケレ+3レあ7ルO2ルね2ッ[~レ+ワ★17レ2ル.レ2ヘさフレyッ♥ルQレn●ンZルヨpルナ4ルm6ッ…えュVンE▒ロ レ3ロrホ3ホ6ワˇゃルね/ウへへル8カフュaワbワとンコレコロひ|fワFワ5ろヲeルQワ2らルUゆf`たッ❎レ=kル=コ4け/ヲ'ルメュpル☉ュqルQつ4ルQル8ルoれえ2/.ロツ▤レ!ルuモンgロそ☉レヘ1ヲ(ル●ロみレシレぬKモッgンOるるル@ルッtンnッしル🐱ロすル🐱cキヲしねロテロサDヌテみワIルゃT41{ˇロ█ルHロ▒Bワ▤~ッpルzル♪ッ<yワか1.ルM2oレせッねレせ{uルM3ン|ルリハゃルよ7ルヘッみぬル5✽4き✽たルJル✽192ロ&ン░ュつルYレてワpルYルkヲは/ロvCを3あワ#░レまヲ7vュひワP*/をロ1をル◝ワしGR!P?CJ?ヲふロvEワuレ?レヒルつゃルモゃハヲとッセけ1をルモす.ロ,のy|QCyヲ8Jロソュょ_ロムけぬロムぬッネ{2ッノル❎ン웃Mュキルxエロ-juレ∧🐱"
function _si(data,i)local n=ex[ord(data,i)]i+=1
if(n>=205)n=204+(n-205)*216+ex[ord(data,i)]i+=1
return n,i
end
function cG(_)if(_f(_,1,2)=="!!")return _
if(_f(_,1,1)!="$")return _ut(_)
if not _p then
_p=_c(_sb,"",_j)local i=1
while i<=#_sd do
local a,b a,i=_si(_sd,i)b,i=_si(_sd,i)add(_p,_p[a].._p[b])end
end
local _o=""local i=2
while i<=#_ do
local n n,i=_si(_,i)_o..=_p[n]end
return _ut(_o)end
function ib(L)local p=e("$ル>ゃヲみ~ルCワすヨ",L)L="!!"
for fU=0,p[2]-1,256 do
if e("$ル>ワた☉ロ5ルtロラルエ",aJ)then yield()end
local n=e("$ルニロヨャ⌂テロs}レ6",p,fU)e("$ル}vロリやえルウロ6}ワO",p,fU,n)for i=0,n-1 do
local ai=e("$ロQ3ロRレ|ヒ",i)L..=_f(ew,ai,ai)end
end
return L
end
ic=_c("59,60,61,19,20,62,22,63")function aK(ai)sfx(D==3 and ic[ai-15]or ai,3)end
function eA(bi,aV,ie,dr)local ak=dr and aw or br
for b in _a(aV)do
if b!=ie and ak(bi,b)then return _i end end
end
function ig(bi,bs,dr)local N=bi.N local bF=e("$ロル~ヲ<ヲ=",bi,N,bs)if e("$ル>ルむッマルエッフッミルむッマと",bF,bi,dr)then bF=bi.cH q("$ロレWヲも",bi)end
if e("$ル>ルむワPルoッフッミルむワPと",bF,bi,dr)then bF=bi.ck bi.Y=1 end
bi[N]=bF
end
function aI(L,fV)L=cG(L)local ad={}for bN in _a(_c(L,";",_j))do add(ad,fV and fV(bN)or _c(bN,"|"))end
return ad
end
ih=aI("$6ッム0ッモッヤッモル67ッモヲ>ロ7/ッモへ5▒ッユゃ3▒ッユょロルッユマル>ッユュち5すンˇレ7ヲや7すンˇレ7マ7⌂🐱レ7ル✽🐱57⌂🐱レ7レ]ッヨワG5ッヨワてロ2ッヨワ)ルヒ5ッヨュち5⌂てヲゆ0お3⌂てヲゆ0お|57~3~3ぬ▤5▤5")ii={
emitter_idle=88,
emitter_fire=92,
lr=112,
ls=113,
lt=114,
}function bj(L)return aI(L,F)end
Z=F("M:50|ae:25|fD:0")q("$q●XロSdッルけル8クXッレル,ルt14ル8ワQロSdルtワRくル∧ワT")ij=bj("lx:1|bf:1|w:6|h:9;lx:2|bf:2|w:7|h:11;lx:4|bf:3|w:8|h:13")function br(a,b)return a.x<b.x+b.w and a.x+a.w>b.x and a.y<b.y+b.h and a.y+a.h>b.y
end
function eB(aV)for h in _a(aV)do
if e("$ワViえレlW▒ルれロュ",h)then
cl()q("$ヲイwヲろルノˇ<~レキレクはレヲえ✽ルk?とレキルマレUッワレUモルマワWほレhンくッンくルのレつロWルマルoヲわワQッレほるワQッレ",h)e("1|k;6|434;4|G|2")return _i
end
end
end
fX={"was destroyed.","was chopped up.","was shredded to bits."}bO=bj("x:16|y:26|Y:1;x:176|y:36|Y:-1")aW=bj("x:40|y:113|w:24|h:8;x:128|y:113|w:24|h:8")function _init()return q("$ル1sユワふンすprb_ルD▒ルlレD0b☉}レTルんッュンせヲEワへッョロ;ッ◜ヲFらやルろヲGロむンせル&ロTレてレ~ヲGロむンせンそとワUょロ5ル&0レ;0ルんヲGンせル&0ッ◝レiCルナ1ルテヲHンたルんャ ロYロむンせル&3レ;4ルんGたンたロむンちル=")end
function ds()return q("$ヲIbロZレとbルOルんロZャ#ルmワみル█ルYャ$ユルクワむ4ルvレiDユャ%ンつ.ヌ0ル:ヲゃワむ5ルvルス2りル;Lルナ6ルテワむロ;ルんャ&ャ'レ(.レGワめくレ_ルノほャレャ(/ルvルスユロ◜ユャ(0ルvヲっル●ンてレHャ)ヲKルす1テエ5ャ*ユロむヲKヲょテャ+ッ◜ルスャ,ヲLレセGたルろンとルEヲM")end
function aw(a,b)return a.x<=b.x+b.w and a.x+a.w>=b.x
and a.y<=b.y+b.h and a.y+a.h>=b.y
end
function gb(cm)local Y=0
if e("$ャ.へル⧗")then Y-=1 end
if e("$ャ.ャ/")then Y+=1 end
q("$qャ0ャ0ンに6ほえはャ1ル8ル レなャ26ロ[く",Y)if e("$ュオ2ャ3.レテンぬ")then
q("$ヲイヲウえャaXッレル8",cm)e("1|k;6|435;4|G|2")aK(17)end
q("$ヲイcBりル cBロ<")end
function gc(eC,il)q("$ヲイdEル▤dEレGくえほャ4",eC)if not k.U then q("$ヲイワ ル▤ワ ヒ")end
if e("$ワ]Sルオえわ",il)then k.eD=5 end
end
function cn(b)b.im=b.x+b.w/2 b.io=b.y+b.h/2
for i=1,6 do
add(cL,{x=b.im,y=b.io,
vx=rnd(2)-1,vy=-rnd(2),aa=12,c=10})end
end
function bu(aV,g)for p in _a(aV)do
p.x+=p.vx p.y+=p.vy p.vy+=g p.aa-=1
if p.aa<=0 then del(aV,p)end
end
end
function co(b,dw,aj)b.x+=b.vx*aj
gf(b,dw,aj)end
function gf(b,dw,aj)b.y+=b.vy*aj+dw*aj*aj/2
b.vy+=dw*aj
end
function dA()q("$ル|ロ_ンクレンワ-レレ6★ャ_ワイレmヌャaャ`ヲbレmょル)aャb")end
function eF(eG)if(not eH)q("$ル|レッヲニムaルfヲ`ワ.ン▤⌂")eH=_i
q("$ンケレjムンコ")e("$ロQ1レそレpワ/ャcルwル◆ル☉ャdレ|",eG)q("$ンケレjロw")end
function iw()q("$ル1ロ●웃ロ●ヒヲY")local t=v0
if(t==270)q("$ャeロX0レXくロ◜らやレoく")
if(t==450)q("$ル1t1ロ}レちワイレ◝2ロWヲbロりほレ◝3ロ}ワイレ◝4ロWヲb")
if t==180 then e("$ワ1をンソ")end
if(t==180)eJ(18)
q("$ヲヒbDンチ^ヲヒbEンヌ0ンょ")if e("$ル>ワiレうッミレYレ…",t)then
q("$ヲヒiンにッ%6ヲフャC")q("$ヲイッッルのワ ル▤ワ ヒ")end
if e("$ル>ワiレうッミレYレ…",t)then
for b in _a(aq)do
q("$レめンにッ%0ヲフャC",b)if e("$にwぬンツルu",b)then del(aq,b)end
end
end
dz()q("$ル1f@りえロ!ロCょワ2ゃロ[",t)if(t>=555)G(_ENV,"aq:e|cL:e|dG:e|dF:e|aY:n|P:0")u.am.accident=_i A="title"
end
function dB()if e("$ワVIオャh")then q("$ヲヒiャhル:A~")return end
if e("$ワVヲeルカBャiモヲAレUレRャjル▒")then return end
local gj=gi()if e("$ワ]レなヲcンヌルエ")then q("$ル1ンキャ0ロy")end
local ai=e("6|72;4|F|1")[gj]if(gj=="u")ai=2+e("2|k|fG;4|flr|1")%3*2
if e("$ロDレん/ャ[ワiレう")then
dC(k)return
end
e("$ワ4")local flip=v23 if D>=3 then flip=k.vx<0 end
e("$ロQ1ンニレGレmレ_レmウレクャiッワャlcの",ai,flip)end
function cM()eL(114,6)if(A!="play"and A!="lab")return
local bh=Z.ae/5 local bk=4+bh*9
_b(3,2,bk,10,0)rect(3,2,bk,10,7)_b(bk+1,4,bk+2,8,7)for i=1,bh do
local x=5+(i-1)*9
_b(x,4,x+6,8,i<=P/5 and 11 or 5)end
end
function eM(iy,iz)if e("$ワqヲタワたえル{ル█",iz)then iy()end
end
function eJ(y,eN)G(_ENV,"dF:e|dG:e")for i=1,12 do
q("$ヲヒbDおっ2ャfントワXくえツワXくヲアワXルtレ✽ほンにワオワXほツマワXンマのロの",y)end
q("$レめレキレクワわオゃ6ンミ.ワt",eN)for i=1,32 do
q("$ヲヒbEルCャ}ャfントワXくヲヨワXけロ…ほけワXウャuレpュ#ゃルqのロの",y,i)end
end
function eO(y,t,iC,z,ar)z=z or 1 ar=ar or 0
for p in _a(dF)do
q("$レめヲCヲ=ワ!ンム★🐱pヲラルむワテャ2ッ'3ルNンムルむワテヲリ<~オゃレレヲル",ar,p,z)end
if t<40 then
local r=e("$ルよロ!えルt6ワrルセ",t)for x=bG+8,bG+v24-8,iC do
q("$レめウヲ=サンムルHンムロAf⌂",ar,x,z,y,r)end
end
for p in _a(dG)do
q("$レめヲCヲ=ワ!ンムえヲCはくヲ=ワ!ヲレンム★🐱aルら",ar,p,z)end
end
iD=aI("$ルョルひJ+C#ルなロfロg ンメロhャ~ル…cロ★ワニルつ!ンモ _ンヤイロhEンルヲへワ:ヲkルてロんUcャ█ンユuレ5iヲワンヨロh?ル`ルepレ[そrヲワロはロっ ル◜pル^jャ▒ンモンラロ∧ロhEmrレdヲlンリレきfsf=レKャ🐱Jンルロ★ル^レcuルにヲヲャ░ンユヲンrロhLmルかレかbンレルG レかrャ✽ンロq*ャりメワナロhRロfロ★kレ▤!ンワルてロhEンルン9!ャ●レdケレ●4")function R(bW,x,y,c)if(not iE)q("$ル|あっ3ムロヨレ^6レ!ヲめ")iE=_i
print("\014"..bW.."\015",x,y,c)end
function cp(x,y)q("$ル|ら7えヲッヲャル)aャb",x,y)end
function bX(b,iF)if(b.iG)return
_g(0,_j)if b.w==4 then
for x=0,3 do _e(16,16+x,1,1,b.x+(b.flip and 3-x or x),b.y,1,b.h)end
line(b.x,b.y,b.x+3,b.y,6)else
_e(16,16,8,4,b.x,b.y,b.w,b.h)end
_g()if iF then
for x=b.x+5,b.x+b.w-5,b.w-10 do
_b(x-1,b.y+4,x+1,b.y+5,5)line(x,b.y+6,x,b.y+9+J%2,12)pset(x,b.y+6,7)end
end
end
gm={"ROM:9054:2000","ROM:12277:130"}function gn(bY,bZ,aR,bH,c,iJ)local cN,cO=cos(bH),sin(bH)for p in _a(iK)do
if e("$ル>ルウへ1ルoるウ",p,iJ)then
local af,ag=(p[1]-20)*aR,(p[2]-3)*aR
local x,y=bY+af*cN-ag*cO,bZ+af*cO+ag*cN
q("$レめワlぬもロ<くウぬもロ<くサルら",x,y,aR,c)end
end
end
function iM(t)local aj=e("$ル}えレYンャ",t)local iN=e("$ルよャ⌂.ン◝",aj)local ar=e("$ルよぬャ⌂ロCレYルヲルセ}レ6",aj)local bw=v5 or 56
local bx=v6 or 70
return bw+(16-bw)*ar,bx+(66-bx)*iN,ar
end
function gp(t)if(t>=515)q("$ンケ4ルfヲヨロアヲ◜v_ルfるムン#",t)return
cls(0)local aj=e("$ル}えレYンャ",t)local bH=e("$ルよルCン◜えみめ",aj)local aR=e("$ルよルCン◜えレ|ャ⧗43ルN",aj)local gq=e("$ルよャˇ3ン◝",aj)local bZ=e("$ロDt2ンよ3☉えャ◆ワめッ😐く",gq)local bY=e("$ロDt1ャd☉えャ◆ルwッ😐く",gq)if aj<65 then
q("$レめレリル2ル{ロAlの",bY,bZ,aR,bH)local iO,iP=iM(t)e("$ワ4ぬワwッ ャ∧ロイ",iO,iP)else
q("$ンケ4ルfヲヨロアヲ◜v_ルfるムン#",t)end
end
function bl(L,gs,bz,dH)if _f(L,1,4)=="ROM:"then L=ib(L)end
if _f(L,1,1)=="!"then L=hY(L)end
L=cG(L)local bF=0
if not dH then memset(gs,0,bz)end
for i=1,#L,2 do
if aJ and i%128==1 then yield()end
local gt=tonum("0x".._f(L,i,i+1))local bh,c=_d(gt/16)+1,gt%16
for j=1,bh do
local cP=gs+_d(bF/2)poke(cP,bxor(peek(cP),shl(c,bF%2*4)))bF+=1
end
end
end
lab=F("M:100|ae:25")function cQ()if e("$ャうゃル◆え",cR)then return cR end
if(dK)return dK
local ad={}for b in _a(lab.aX)do add(ad,b)end
for b in _a(lab.aF)do add(ad,b)end
q("$レめレゃ`?ロの",ad)dK=ad
return ad
end
function gv()for m in _a(e("$🐱ル$ッ#レルロツ▒"))do
local bm,dL=m.x,k.U and aw(k,m)local bk=e("$🐱ル$ワノシャえル☉ほ")q("$ロレヲtルタウロ?☉レトヲ[ロGャ]くル8ッ)く",m,bk)if dL then q("$ヲイvロ}レ&ロsく",m,bm)end
end
local l=lab.bA local cb=l.y q("$ロレa`ル/レ/wレBロSfレゃj@レゃjfヲフレトヲ[ロGャ]くル8ルン",l,cb)if e("$ワ]Sさっ✽ャおシ2レ&ウレよレˇンこワg",l,cb)then
q("$ヲイwロWルマロsくャE",l,cb)end
end
iS=[[GRAVITY LAB
SYSTEM FAILURE

CORE STATUS: OFFLINE|REMOTE ACCESS DETECTED

DR.RED NETWORK
CONNECTED|CAM-07 ONLINE
TARGET FOUND

UNIT: WALLE
LOCATION: OUTDOOR STORAGE|DR.RED // COMMAND

sudo WALL-E back|DR.RED // COMMAND|HUNTER UNITS

HUNTER-01 ONLINE
HUNTER-02 ONLINE|TARGET: WALLE

PURSUIT START]]
dM=aI("$ロ(Kレ[eン5ル^lャょp'ワトヲンヲ▒ワヘxヲ░!Uロf _ヲlG=▒{ロIャのワホヲ🐱ャは🐱ャもレ0ミ.9レvロお'ャやイワミEン5JソンレルG ャゆロセヲmqル^ロ⧗ンモワミdンロンハ,ャらロ(Fロっ!ンヨャりン7ワニレネ uレ5i=▒{ロIレvDレ5ン7uレ5iッ>ャるャれl!ン7ャ●!mdッ?ロf,ャらレvU_ルiロんFcロ★nレ$iルて ンモワメqgelゅ,ャらレvQャろン8ヲワャわlレヒj ッ@,ャりル^lrロgワミルくヲ░ャらャのワホヲ🐱ャは🐱ャもレ0ミ.9ルョUュ2rヲロルGワ●ャ█nnワ ルつレネッAル$=ャんャ🐱FゅdッAqwロセckレ?ンメ bャっレきャゃャりルさl'ヲヲン7ッBaッLッCン+bルて レg!ワナwャゅ#ャんャ🐱ッDdイbワミeン5ル^lャょpンレルGl ヲ✽ワメnロっワvン9 レg,ャんャ🐱ワ@bャアルさャやuルにヲヲャイレ9ロんHロBルかヲ✽ンラャウロゅ!pロソlヲ▒_ンヤイ#ャんレ,ャのワホヲ🐱ャは🐱ャもレ0ミ.")function cq()e("0|4;0|3;4|sfx|2")end
iZ=aI("$ルョワ@ンヤンユン>ッK!hm`ャケロhLロっッAル$ロ★イ nャコqレきャゃロg'ャサpロソ!mdャ▒ャろfワ:w ン?sロタメlrロhFロソャ✽qレきbcルトmヲ░ @pヲ▒ロゃヲlbャっレっレvルり=ン@ワナッGルG_p メ=ンA=!Uロf!ンメロg=ワヤG'ヲlレgッAレsヲ░!HロBヲヲルくcnワ:ヲkルてャシレvルり#ルなロfロg ンメ,ンA#!ワムル♪bcヲへャスMャ▒ッHpル^,ャりq_ャセ G'ロ⧗ャソメャシレvGャチレdル^!レgッ?ヲロレswンレ_ルくレdkャシルョンB*ロgャチワミcvルiロhBャアヲ✽ッI ャソkdレ5rソワユッ>ロhSlルiqレきッJワミuロゃrレcbpッKレっレvッDヲン#ルな_ルくワミeン5bctロ▥#レフレvBャアレsロセcンラャわlロゅ!レgヲm,ロチワ@q_ャセ!uc'ロ⧗ッLャサロJャツャテャれャトャナ ルGp=!Fロっレネsン8ルてロhJンルロ★ル^レcレハu!jレge ン>j_ロセ!ャろfャ● ンCレK4")function gz()if not gA and k.x<=152 and k.y>=168 then
gA=_i
for gB in _a(jf)do dQ(gB,_i)del(dR,gB)end
dS()end
local bY,bZ=_d(k.x/8)+1,_d(k.y/8)+1
for y=max(0,bZ-3),min(23,bZ+3)do
for x=max(0,bY-3),min(31,bY+3)do
if(abs(x-bY)+abs(y-bZ)<=4)eT[y*32+x]=_i
end
end
end
function gC()if(D==3)_b(4,4,23,187,5)_b(219,52,251,187,5)_b(24,149,75,187,5)_b(140,168,219,187,5)return
for y=_d(O/8),min(23,_d((O+127)/8))do for x=_d(H/8),min(31,_d((H+127)/8))do
if(x<3 or x>=27 or y>=21 or x<10 and y>=18)and not eT[y*32+x]then
local jg=max(y*8,x>=3 and x<10 and 150 or 0)_b(x*8,jg,x*8+7,y*8+7,5)end
end end
end
function gF(jm,b)if Z.ae<=P or not aw(jm,b)then return _j end
P=min(Z.ae,P+b.bf)del(aq,b)sfx(D==3 and 59 or 16,3)return _i
end
function gG()if(not u.dV)return
local eU=0
for b in _a(aq)do eU+=b.w-5 end
while eU>25 do local b=aq[1]eU-=b.w-5 del(aq,b)end
end
function gH()if e("$ロDロニわワ*N★ンKル▒")then return end
local M,gI=nil,32767
for b in _a(aq)do
local af,ag=b.x+b.w/2-ah.x-3,b.y+b.h/2-ah.y-3
local cW=e("$ル>ンQ~ウンQュ%",af,ag)if(cW<gI)M=b gI=cW
end
if(not M)return
local af,ag=M.x+M.w/2-ah.x-3,M.y+M.h/2-ah.y-3
local d=e("$ロQ4ワ;ウレ◜けル8",af,ag)local bs=min(1.6,d)q("$q●ュ&●ュ&ワ😐ュ'ヲ=クュ(●ュ(サウレnヲ=",af,d,bs,ag)gF(ah,M)end
function eV(b)b.eW=60
if u.dV then
for s in _a(cX())do
if br(b,s)then q("$ロレwヲろレˇルンワ!ルむッRルoモワ!レˇほュ)★レまく",b,s)end
end
end
add(aq,b)end
function jo()local bI,g=cX(),.012*(D==1 and 1 or Q)local bt=D>=3 and D!=5 and 256 or 192 local al=D>=3 and D!=5 and 192 or D>=2 and lab.al or 128
local gJ={}for h in _a(D>=3 and D!=5 and dW or D>=2 and lab.aW or aW)do add(gJ,fY(h))end
for b in _a(aq)do
b.vy+=g
for N in _a({"x","y"})do
local bz=N=="x"and"w"or"h"local gK=N=="x"and"vx"or"vy"
local eX=N=="x"and"y"or"x"local gL=N=="x"and"h"or"w"
local gM=b[eX]local jp=gM+b[gL]local cc=b[bz]local bm=b[N]local bs=b[gK]local M=bm+bs local ak=nil
for s in _a(bI)do
if gM<s[eX]+s[gL]and jp>s[eX]then
if bs>0 and bm+cc<=s[N]and M+cc>=s[N]then M=s[N]-cc ak=s
elseif bs<0 and bm>=s[N]+s[bz]and M<=s[N]+s[bz]then M=s[N]+s[bz]ak=s
elseif bm<s[N]+s[bz]and bm+cc>s[N]and M<s[N]+s[bz]and M+cc>s[N]then
M=bm+cc/2<s[N]+s[bz]/2 and s[N]-cc or s[N]+s[bz]ak=s end
end
end
b[N]=M
if(ak)local gN=N=="x"and ak.gO or ak.q14 b[gK]=2*(gN and ak[N]-gN or 0)-bs
end
if(b.x<4 or b.x+b.w>bt-4)b.x=mid(4,b.x,bt-4-b.w)b.vx=-b.vx
if(b.y<0 or b.y+b.h>al)b.y=mid(0,b.y,al-b.h)b.vy=-b.vy
b.eW=max(0,(b.eW or 0)-1)local eY=_j
if b.eW==0 then
for h in _a(gJ)do if br(b,h)then eY=_i break end end
for jq in _a(as or{})do if br(b,jq)then eY=_i break end end
end
if eY then cn(b)del(aq,b)else gF(k,b)end
end
end
function eZ()local bn=e("$ルニ0ャ36レテ")if V then
local gP=_j
for s in _a(cX())do if s==V then gP=_i end end
if e("$ル>わるウレキせロxルカンいル█",gP,bn)then V=nil return end
q("$ヲイv●Tレ▥ロにDくワa●Tヘロ♪Eく")q("$ヲヒiルCロ;")elseif e("$ル>オ★sッfンぬ",bn)then
for s in _a(cX())do
if e("$ワ]vワねくルoレRレGロ{くレ&ルエオ5レ_ャBッqヲcルt0ルoつ6レ_ッqレˇュ*ルt0ルo",s)then
q("$ル1TひレへDロ}レ&ほレへEロWッq",s)break
end
end
end
end
function js()if jt()then return end
if e("$ャうゃル█オレlbた")then reward_f=e("$ャ.レろ")return end
if(D==5)ju()return
if gD()then return end
if(A=="gift_intro")jv()return
if e("$ャうャiロョせルT/レQせンいュ+✽スWわワfワ<わ")then
eZ()for s in _a(cX())do s.gO=s.x s.q14=s.y end
end
ir()if e("$ュ,/レQせンいと")then
gH()if V then eZ()end
end
end
function jw()if jx()then return end
if(D==5)jy()return
if V and D==4 then jz()else iA()end
if A=="play"or A=="lab"then
if not V then jn()end
end
if(A=="play"or A=="lab")and u.cY and k.U and not aY and not v18 then
X("S",V and"Exit"or"Deploy",2,118)end
if A=="gift_intro"then jA()end
if bo then gE()end
end
function jB()camera()cls(0)_g(0,_j)for y=0,23 do for x=0,31 do
local ai=mget(48+x,y)_e(ai%16*8,_d(ai/16)*8,8,8,x*4,18+y*4,4,4)end end
memcpy(0x8000,24576,8192)end
function jz()camera()pal(2,133,1)pal(3,134,1)memcpy(24576,0x8000,8192)_g(0,_j)for y=0,23 do for x=0,31 do
if(x<3 or x>=27 or y>=21 or x<10 and y>=18)and not eT[y*32+x]then _b(x*4,18+y*4,x*4+3,21+y*4,5)end
end end
for s in _a(bJ)do
if not s.iG then _e(16,16,8,4,s.x/2,18+s.y/2,s.w/2,s.h/2)end
end
for h in _a(dW)do
for x=h.x,h.x+h.w-2,4 do _b(x/2,18+h.y/2,x/2+1,19+h.y/2,6)end
end
if ab then _e(0,96,24,28,ab.x/2,18+ab.y/2,ab.w/2,ab.h/2)end
_g(15,_i)for cZ in _a({aq,as})do for b in _a(cZ)do
_e(cZ==as and 112 or(b.w-6)*8,cZ==as and 112 or 56,b.w,b.h,b.x/2,18+b.y/2,b.w/2,b.h/2)end end
for f in _a(bQ)do
if f.aa>0 then _h(f.x/2,18+f.y/2,1+f.aa/4,10)end
end
for c in _a(dX())do _e(64,96,18,12,c.x/2-1.5,18+c.y/2-1.5,9,6,c.Y<0)end
_e(0,0,16,16,k.x/2,18+k.y/2,8,8,_j,Q<0)_g()if ah then pal(8,10)pal(14,9)_e(64,96,18,12,ah.x/2-3,18+ah.y/2-1.5,9,6)pal(0)end
cM()gQ(64,66)end
fa=aI("$レvMuレもロんWcロニ*ンSk ロセル'!ゅッu,ンA#!ロお'ャやゅッu#ワヤUュ2ンメッGロセル' ンヨヲ▒ロf=ロチワ@ルさャトャナロgャスワムワョルRンハ'ンユワユワBャケ,ロチワ@q_ャセ!uc'ロ⧗ッLャサロJャツワヤG'ヲlイワメワ{ルなルGw ャイルRヲjルかャト!ロfャシレvャ~ャせワBロ★ャイレ9lャるRロfロ★そ!レsレ[ンモ,ロチRロf!ルにqヲワ`cャスッDン>ルさl'rンT+ロチEン5ワナquワvワトロJヲm!そu,▒ル}")function jF(s)for y=_d(O/24)*24,O+128/s.bR,24 do
for x=_d(H/24)*24,H+128/s.bR,24 do
local aB=y*8+x/24
if not s.jG[aB]then jH(s,x,y,aB)end
end
end
end
function jH(s,x,y,aB)local af=e("$ル>レGほンけュQ",x)local ag=e("$ル>レ_ほゃほュQ",y)if e("$ル>ッ😐ウウルNレ<ッ웃レ<ッ웃ル∧レF",af,ag,s)then
s.jG[aB]=_i
q("$ル|ニibルCワフルサレyッ♪ロの",s,x,y)end
end
function jK()local bI=cR local g=.012*Q
for b in _a(as)do
b.aa-=1 local aD=_j
for S=1,4 do
jL(b,g,.25)if e("$にdeるレˇMルオえロAV▒",b)then
q("$ル|ュWッ★ルclュXニdeュ#レニhンや",b)if(cs)return
aD=_i break
elseif not b.fg and fh(k,b)then q("$ル|ねレ☉たッ★ルclュXュW",b)aD=_i break
else
if S==4 then for s in _a(bI)do
if fh(b,s)then q("$レめルclュXュW",b)aD=_i break end
end
end
end
if(aD)break
end
if e("$ル>ャZ/ルむワテヲZュ)ロyュ)ロオルエ",aD,b)then del(as,b)end
end
end
function jP()local fj=e("$ワVfKレ2ン^テ")local af,ag=fj[1]-B.x-14,fj[2]-B.y-12
local cW=gZ(af,ag)if cW<=.45 then
q("$qヲ▥ひルウレZほュ5ひレむヲッ",fj)if e("$🐱@ン^✽ルkKルキと")then q("$qレ3ル~kヲも")
elseif e("$🐱@ン^☉と")then B.cm=1 end
q("$qレ3ン^レ3ン^レ2ル~kく")else q("$qヲ▥ヲ▥ワ😐ュ'ルtロアルNュ5ッzもzッ&d/b",af,cW,ag)end
q("$qレ3ッvりレ2ッvロ<レる`웃b`ヒ")if db>=210  then db=0 gY()end
if e("$🐱@ロrけと")then
ea+=1
if(ea>=450)ea=0 gY(eb)q("$ル1c`レやせc`ほ")
end
for l in _a(ct)do
l.C+=1
if e("$にAレYャ☉ル▒",l)then del(ct,l)
else
if l.C==45  then
e("$ルニ.ワt")if(l.fi)ec[l.fi]=150
end
if l.C>=45  then
if e("$ル>ッUロ{ワWッ|Mき",l)then cl()end
end
end
end
if gX(k)then cl()end
end
jT=F("idle:0|land:8|launch:10|rise:12|fall:14|apex:32")function jU(x,y)local a=e("$ロDHン]レnワ😐⧗ヌロG⧗",x,y)x=B.x+14+x+sin(a)*.5 y=B.y+12+y+cos(a)*.5
if e("$ル>ワイぬル2ほルoャcワイルゅ6ルエレキウヲbぬょほルoレhウヲbン`ルエ",x,y)then return end
aL=F("!x:$1|y:$2",x,y)dA()end
function hd(aV,bw,bx)for b in _a(aV)do
pal(8,b.fg and 10 or 8)aZ(bw or(b.bf-1)*8,bx,b.w,b.h,b.x,b.y)end
end
function aZ(bw,bx,w,h,x,y,flip)_e(bw,bx,w,h,bB+x*au,y*au,w*au,h*au,flip)end
function jZ(l)if(l.C<45  and J%4>=2)return
local z=au local x=bB+l.x*z local y=l.y*z
local bt=16*z local bh=ceil(bt)local c=l.C>=45  and 10 or 8
if l.C<45  then fillp(23130)end
for i=0,bh-1 do
local o=(i+.5)*bt/bh-bt/2
line(x-l.ag*o,y+l.af*o,x+l.af*320*z-l.ag*o,y+l.ag*320*z+l.af*o,c)end
fillp()end
function he(z)cls(2)_g(0,_j)for y=_d(O/8)*8,O+128/z,8 do
local bN=y>=0 and y/8 or 4+(y/8)%12
for x=_d(H/8)*8,H+128/z,8 do
local fl=48+x/8
if(x<0 or x>=32 and y<0)fl=52+(x/8-4)%20
if(x==24)fl=48
local ai=mget(fl,bN)aZ(ai%16*8,_d(ai/16)*8,8,8,x,y,x==24)end
end
_g()ka(z)if K.bK<6/z then hf(z)end
end
function kc(s,z)if(s.C>=540)return
_g(0,_j)_g(15,_i)for d in _a(s.kd)do
if(d.x>=H-24 and d.x<=H+128/z and d.y>=O-24 and d.y<=O+128/z)ke(d,s,z)
end
_g()end
function ke(d,s,z)local x=(d.x+6)*z local y=(d.y+3)*z
if not d.ak then
local af=(d.x-k.x-2)/16 local ag=(d.y-k.y-5)/16
if s.C>=508 or af*af+ag*ag<=s.hg*s.hg then
d.ak=s.C d.r=s.C>=508 and 32 or 12
if(s.C<508 and s.C-s.eN>=4)sfx(17,3)s.eN=s.C
end
end
if d.ak then
if(s.C-d.ak<d.r)local r=(d.r-s.C+d.ak)*z _h(x,y,r,9)_h(x,y,r/2,10)
else
if z<=.3 then _b(x-2,y-1,x+1,y,6)_b(x-1,y-1,x,y,8)
else aZ(64,s.kf,18,12,d.x-3,d.y-3)end
aZ(112,112,6,9,d.x+3,d.y+3+min(54,(s.C-d.lu)*.5)*mid(0,(508-s.C)/328,1))end
end
function kh(x,y,bk,hh,f)if(f>=6)_b(x,y,bk,hh,0)return
go(f)_e(x,y,bk-x+1,hh-y+1,x,y)pal()end
ki=_c("0,12,134,15,132,4,9,128,6,13,5,133,7,135,11,1")hj=e("$ロQュLルCャヒルCワヨルCッ@ルCレょュxルCロ◝ルCロアルCッTルCワつュxルCワ.ルC27ルC3.ルCワ웃ュxッ♪")function hl(t,ar)for y=0,15 do for x=0,15 do
if e("$ル>ロョヲャル8もワjくつ7ウマル8もル6ルNロヘルせサルエ",ar,x,y,t)then q("$レめヲさウヲさえヲさンシウヲさンシロt",x,y)end
end end
end
fh=br jL=co
function fm()for b in _a(aq)do
_e((b.w-6)*8,56,b.w,b.h,_d(b.x),_d(b.y),b.w,b.h)end
end
function fn()for p in _a(cL)do
if D==1 then spr(119+mid(0,_d((12-p.aa)/3),3),p.x-4,p.y-4)
else pset(p.x,p.y,D==2 and p.c or kq[p.aa])end
end
end
hm=_c("SELECT LEVEL,ENDLESS,MULTIPLAYER,ACHIEVEMENTS,SETTINGS,BACK")function cu(cP,L)if(L)poke(cP,ord(L,1,8192))
return chr(peek(cP,8192))end
function ed(title)e("$ュ⧗ワ>ヲ,レ]レZワえャˇゃルpルる",title)end
kH={"!!れ <(A!(A あKケ❎!(F <-LH&.J♥#(そ<てPヨぬ<て(6オ#◆❎モ▒あ6$'れ","ROM:12407:92","!!ヒ*/🐱*🐱コ●🐱ユゅマいモ@ˇ;マ%ら`ˇPzら@ろ;マせ$@くPマI*xゅャ#マ%r*&C@%ユゅC@セ2は`セ🐱 %%`いv*えg🐱る*/🐱;","!!>5&あヒ')(v▒(ユ◆2(ぬヒ あ7 ▒ヨ▤f2P❎ュ✽Jヘ PTルけ(まあ9*あヒ[;_(ぬP<oFフ'Kあ=oF'J4-%F❎@ レ><"}kI=_c("A01 : LUNA,A02 : TERRA,A03 : SOL,A04 : UNDELIVERED LETTER,A05 : NINE TO FIVE")kJ=_c("MARE TRANQUILLITATIS,TERRA INCOGNITA,THE SUN ALSO RAISE,THE UNDELIVERED,NINE TO FIVE")ee={}kq=_c("9,9,9,9,10,10,10,10,7,7,7,7")function dQ(b,fu)add(bQ,{x=b.x+b.w/2,y=b.y+b.h/2,aa=12,fu=fu})cn(b)end
function hq()e("$ルニッぬンwロノヲ,ぬル☉レr}ュ▥ロイ")q("$ル|レね.ルこ0ャてロ ル,レ7ッきャて")if D==4 then gC()end
for h in _a(dW)do dD(h)end
for b in _a(bJ)do q("$レめアiQン0~",b)end
if D==3 then gC()end
e("$ロd")if ab then e("$ロQッV★ソレ▥ソャXソルy★ソルkヲヘ")end
e("$ルよ3ロE")fm()for b in _a(as)do
e("$ロQワロレよレˇヲオヲヘ",b)if e("$にAツルせへルo",b)then e("$ロQルレヲオレ◜",b)end
end
_g()for f in _a(bQ)do
if f.aa>0 then
if e("$ュ,ャホルオ✽ヲてわ")then q("$ル|ヲろヲラアヲ-ほツみM⌂",f)
else q("$ル|レャはをアヲ-ほはワ2}ンョ⧗レ&ルQほルマンツaャb",f)end
else e("$ロQロリヲオレ◜",f)end
end
fn()for c in _a(dX())do kM(c)end
if e("$ワ]ロ8レpレhャjルo")then dB()end
end
function fv()if ax!=_i then q("$ル|レッレ✽ムワ[ヲめ")end
if(not cd)q("$ル|レッヲ█ぬン⧗ルfルやン▤▤")cd=_i
end
ef={M=150}function dS()bJ={}for cZ in _a(e("$/ッ#✽ルI_✽ロウP✽スVュx"))do
for b in _a(cZ)do add(bJ,b)end
end
end
function kO()local hr,hs,kP,ht,hu=ba[1].x,ba[1].Y,k.x,_j,_j
for m in _a(ba)do
m.cb=m.y
if e("$にンワロ@レU",m)then q("$ロレンワニンワルヌレ/ンyニンyロ@ヒッ⌂ルせ",m)
else
local bm,fx=m[m.N],m.Y
local dL=e("$ワ]ciえレQルCュ★えレ|",m)q("$レめヲ qルや}ge⌂",m)local dH,ce=m[m.N]-bm,_j
if dL then
if(m.N=="x")hu=_i
k[m.N]+=dH
if e("$ロDO☉レヲレ_へルo")then ce=_i fx=1 end
for s in _a(bJ)do if e("$ロ3ル█モ✽ャおえルれロュ",s,m)then ce=_i break end end
if(ce)k[m.N]-=dH
elseif br(k,m)then ce=_i end
if ce then
if(m.N=="x")ht=_i
m[m.N]=bm m.Y=fx
elseif dL then
k.vy=0
end
if e("$ル>ャG★🐱Wもル█",ce,m,fx)then q("$ロレンワニレハンハロ@",m)end
if not ce then q("$ロレンyニンyロ@ヒッ⌂ルせ",m)end
end
end
if ht then
ba[1].x=hr ba[2].x=hr
ba[1].Y=hs ba[2].Y=hs
if(hu)k.x=kP
end
end
function hv(bI,eh)if(V)jr()return
local kQ,eC=k.U,k.x
gb(Q)local hw=D==5 and k.U and k.vx==0 and k.vy==0 and 1 or 4  local aj=1/hw local ei=eh and .01 or 0
for i=1,hw do
local hx,ej=k.x,k.y
if k.vx!=0 then k.x+=k.vx*aj
for b in _a(bI)do
if fh(k,b)then
if hx+k.w<=b.x then k.x=b.x-k.w k.vx=0
elseif hx>=b.x+b.w then k.x=b.x+b.w k.vx=0 end
if(not eh)k.vx=0
end
end
end
gf(k,.36*Q,aj)k.vy=mid(-8,k.vy,8)k.U=_j local hy=_j
if(eh)k.ek=nil
for b in _a(bI)do
if k.x<b.x+b.w and k.x+k.w>b.x then
kR(k,b,ej,ei)if(eh and k.U and not hy)k.ek=b.kS and b or nil hy=_i
end
end
end
gc(eC,kQ)end
function fz(c)if(I==c)return
for s in _a(aS)do
if s.craft==c then
G(s,"craft:n|C:300")for b in _a(as)do
if(b.aA==c)q("$ル|ュWッ★ルCロ2ルvッ★みャ8",b)
end
q("$レめ}ワユュXひル:O▒",c)return
end
end
end
function dX()local ad={}for s in _a(aS)do if s.craft then add(ad,s.craft)end end
if I then add(ad,I)end
return ad
end
function df(aV,cw)if(not cw and u.dV)jo()return
local fA,dg=D>=3 and D!=5,D==2 or D==5
local bI=fA and bJ or dg and cQ()or{}local aj,g=1/4,.012*(D==1 and 1 or Q)local hz=cw and dX()for b in _a(aV)do
if(fA)b.aa=(b.aa or 600)-1 b.C=(b.C or 0)+1
for i=1,4  do
local aD,aM=_j,_j
if not dg or not b.lv then
co(b,g,aj)if dg then aD=eA(b,bI,nil,_i)end
end
if dg and(b.y+b.h>=lab.al or b.y+b.h<=0 or b.x<8 or b.x+b.w>184)then aD=_i end
if cw and I and aw(b,I)then
dQ(b)aK(17)del(aV,b)break
end
if not aD and aw(k,b)then
if cw then cl()aD=_i
elseif P<Z.ae then
P=min(Z.ae,P+b.bf)aD=_i aM=_i aK(16)end
end
if cw then
for c in _a(hz)do
if(c!=b.aA or b.C>30)and aw(b,c)then fz(c)del(hz,c)aD=_i break end
end
end
if fA then
if(eA(b,bI)or b.x<0 or b.x+b.w>256  or b.y<0 or b.y>192  or b.aa<=0)aD=_i
elseif D==1 and not aD then
aD=(b.y+b.h>=108  and not fZ(b))or b.y>=140 or b.y<=16  or b.x<=8  or b.x+b.w>=184
end
if aD then
if dg or D==1 then
if not aM then cn(b)end
elseif cw then dQ(b)aK(17)end
del(aV,b)break
end
end
end
end
function kV()for i=1,#aS do
local s=aS[i]local c=s.craft
if c then
local N=c.N
if e("$ル>シロ2レヲウ☉と",N,i)then q("$レめ✽ルI_レルシヲまッXャメ",c)
else
q("$qュ❎ュ❎ヲ<ヲ qロ@,ロアルN",c,N)if e("$ロル~アレtルo",c,N)then c[N]=c.ck c.Y=1 end
if e("$ロル~アヲ.ルエ",c,N)then q("$qュ❎ニヲ.レ/Wヲも",c,N)end
end
else
s.C-=1
if s.C<=0 then
q("$ロレンzュ9du▒レ/ワかロ_ヲリ⧗",s,i)if i==1 then q("$ル|ニンz✽ルI_レルシヲまッXャメ",s)end
end
end
c=s.craft
if c then
for kW in _a(bJ)do
if br(c,kW)then q("$レめレlxュXら5ワに",c)break end
end
if e("$にンzルカHアワかル▒",s)then kU(c)q("$ロレワかロ_ヲリ⧗",s)end
end
end
if e("$ャうはヲ_Hャなし")then
fB()end
if I then
kX()for s in _a(aS)do
if e("$にンzモ✽ヲてアンzワg",s)then fz(s.craft)end
end
end
for c in _a(dX())do if e("$ル>✽ヲてル█ッミ✽ャおワg",c)then cl()end end
end
function lc()if fd()then return end
local bn=e("0|9;6|47;4|ap|2")if e("$ュ,3ル◆え",bn)then if D>=4 then dP(_i)else de()end return end
if dO(bn)then return end
if e("$ュ,ャホワ*ルTロ◝と")then jc(bn)return end
if(A!="play")return
if J==30000 then
J=15000
for s in _a(aS)do s.next-=15000 end
if I then q("$qワ♥ュあワ♥ュあルこルfほ")end
end
q("$ル1HワをャそャTヲ|ロ<ャL")if e("$ルニ4ャ31レテ")then fy()end
q("$ル|ッ{Mた^ヲヒ`Hルやロカヲゃ")q("$ル1ワゆン!ロ?ルあャモワよりッ(ロ?ルwャモ")eB(dW)if D==4 then gz()end
q("$ル|ッ{Tたロ ヲ!oャSロ ッ…ルやンゃ")if bn then lb()end
if(A!="play")return
for b in _a(bQ)do q("$ロレヲ-りアヲ-ロ<",b)if e("$にヲ-ヲZルオアdsわ",b)then del(bQ,b)end end
q("$ヲヒaJルtレツンょ")end
function _update()q("$ンケレDュい☉}レT")if T then kx()else js()end kK()end
function _draw()if T then  if em or T==5 then
q("$ル|ッ{ッ1^ンケ6ッ-")em=_j
else q("$ンケン.ン#")end else jw()end kL()end
function dC(p,bH,z,ar)bH=bH or eS(v0)z=z or 1 ar=ar or 0
local bK=ceil(11*z)local cN,cO=cos(bH),sin(bH)for y=-bK,bK do for x=-bK,bK do
local bw=_d((x*cN+y*cO)/z+8)local bx=_d((-x*cO+y*cN)/z+8)if bw>=0 and bw<16 and bx>=0 and bx<16 then
local c=sget(bw,bx)if c!=15 then pset(_d((p.x+8)*z+ar)+x,_d((p.y+8)*z)+y,c)end
end
end end
end
function kR(p,b,ej,ei)if p.vy>=0 and not b.lw and ej+p.h<=max(b.y,b.cb or b.y)+ei and p.y+p.h>=b.y then
p.y=b.y-p.h p.vy=0 p.U=p.U or Q==1
elseif p.vy<=0 and ej>=min(b.y,b.cb or b.y)+b.h-ei and p.y<=b.y+b.h then
p.y=b.y+b.h p.vy=0 p.U=p.U or Q==-1
end
end
__gfx__
d17b237bb0f02600733273f122d7f1a080f184f1a0f0e39b68301600e6ba51ec10820b1097048291d61a10401b0092931b8b008b208ba684e397f1d6f1a0f0e3
2a8bd015bab6e682abe7544282912282d339ba0b00ec066041507500229b857340f1a0f090b0f19b32306dcb10828442fae61a10e71b91c460821cc4108b00e1
f19b2ce1a0f090f0f190924980b5d46373909154e63291e191c4aa00f2595491225097e5b5003532d0f1aaf1a0f0e326f830d46304ca8020cb301b50b040808b
206720f0903355731005b6d40042e191971c69304015f891bae191e150c0549332b5103105e0f120f09050f135d4b6d4cb0057004430e500ab918a913c1c4150
50518250e5406905e02a20f026e335309baa307510f393443080150b10224215056330b6325154514104e18032500590e335320069f120f0f135a671933ba0d2
7780808a42573206005700d791d654c957007293b50068f16890e510738a62f093f1e19040673820965a913216f4261b10051b206754ab5954a02640692a5700
72905430f470f19b351035103504d600572600130dc51093d4000432d2c68191541c82a0d4303830608be5683280f1353200e33573d0308057000281d611a1a0
d4b5d400b531e7341093f2e7506093b5750013e13c13f890041090606720d610570430385411b436606793b63200b53251b60482a0d41072f475006905303805
10f17290b400e1808073577310135700a600d161640c73003d62d09340152204b642545080aaf4846800f869f1763035909330938013aa1332916600d1e2640c
20d736109384630068913291e1424157e5e6758038f167932035d8c60067e180a0693c3c9131a121c036d4d711f2c5d0c4102291549132915430540069138b75
2a002a937300268371c37193871013911535206411a142c561730052a0166300a034804750427113316906577580f410e1726250ec718a80871069d2c651d170
839c0420a084102291a0ca0093681057b4328073aa807067aa71f48710056310313a4c5700ccc17080d7d7ec509197e791401b6becd0675732e620711d32b567
8a71b580d08102695060d202a0525720936015ec86a280aa0097ec63001551e10b0080b4d480138040381d20d080d03054b6308b1663108482c9820b32aa63b4
d487307120a0803b00c09600688116138b004430e0d7e6a0708c0004c41051d350b4009332003c13320510053b307130b080d01316b5d7314430f0d7b8518291
829122e1422da0b4c806777334b04980f4b5108030f4484044f46015528068b40022e7420b008491d34142c420514150b4408ba60510690580307080f92044f4
d06830b4100bc85090e4d3bac4200bb45820b0e4b531058700306071f43b000238304057808b1068306d53b03751c42097bae142a0b4409330d29b2087100603
c671d7208700030a100b00d7e60b108491828442c5b400e1803450478768207138f4406b0a1057200281c02a108b7368d03242e739b60b00e1540b0031e74253
d0a550b034b0ec3873e12232f48013cb698116810213c0e0302668b01532913939542242e7a151e142b053c0475a34c095383c080051e7a120d620726210478c
9600c0870030908b5a549141019050e4a0d9f00aa0341055002d91d740752430f51a10e15c22a12080f4103869528c100587d03090c4a642b642398251b60b10
d9205682835651eca6803210713282d332a122a1509600c0b60022a1d74087f086405550041b108c6358d6a5d382e151ba15f2525c1b21c04910f252a024900c
a154a0480022f2e731c087870013428c06103291c410b6500190804710a024500a420b002da122525053f0c63200d34ce68c0042a182c59620d7ec10d7208787
b5f8008242824232ab3291829120ca207551d32d0b00f20b04107131a1d3a182a154968231f4b600e159a15700c08750f4e013689132e6e142324282f8ab4252
59822d228291a1513140d400758820a1d3541df4303c424080f4d6108020f487003c42324215e104c41040cb0031f2f9594142c43440e42034205551d384a131
f480c852a510ba1681c040f4960072f43b10804874500dc473f8320610401b00e1598452e754e1229152d782327173cc00a19167138030388a912070f4808124
1077137138738087103ce6c4d4637300d930e4425941531055e142e1427001c0806751752201a14771f474eb714142e19120a0868047345012a0710671f4b510
80a03c1c8b5a4215522dba1a103950e500595ca191a1755c228c00737169e752b6508740d876017dcb723813cb8600a80050b4c8b09700f1f2415053e0a50020
01480d41e6a182f2b034108524a00a004241d4ba208720f42038b571f41030b0808001e33754f832f810c473100b20a04ac049044ad0171140f2d38452d50297
00f241d48b008b006805c0621c00267130d080d670155442aa42c5320022a1515842359115225034600d11f254521c52595141e6678312c080b600c096007230
f0802080f95310a500407034c2f1e15258910a522291758810f284d4590b10e752a19159550013728b108b731005d03830f08020535012a07269802069e6e142
224040abe6317053305624c1cb5ca17562d0c6401b0041f2ab867071a0cb572001b0705553b09b30f080207157708080301b006842824231a1d35390e40b00b0
40a175a151825139915442b14241423272574057a60553a0e4303830f0806071677380902420125a9184b6421a205c545c11a1f9d4227554b191b1913119913c
72933057e510c8b0701af4103480a4f07271c88040e410808013c4326340549122e75c1a505c51d3f2d35182a18242b191b1c3b191574067c401b0a056c89070
51a0711d20967053b01a107130408073d0051005630041507970491552a1d33d1130f25259fb52a0349093f810b1e1b131b157320004cc0042c4a6c810e05500
67f4706200373080963072b520f900681315b6420b7400355234f0120870248017005300355139d38291ba3260d9803591d78284042001c0c037cb3105a0f458
b67780b510803093704be46210553c91320b0039210848000820a1b0404c51d3971b01a0c04900524c04841d57d251c0539095e024b02d81d5a5715710aa6971
32912291523982152252d4755cd451827588103490959152ec2024e047e72074c0957970cc697168389360f448008b73799051c062c017019090930b00522231
e7f9f2d3a1d32d390020d411ec10a16851824a40c6525131f43200f4c8f0d051c09387b52053d0a5f4e6108af420744051c04c84d43182a13d0042d3f282f252
8801961df282a18251abb651152062f05500e13c34fa00e320a0f46800aa7357503440e4f424a00d3054630031a154a134b0e401a0f0555001b0e093aa0074e0
c691f720a10190e0550b10518670c631f4b57480515620f432a074809bf4103090344002d31d05e680e1a122d3a151593159f23d01750de632a1b06074300a00
51c41051e122323080aaf4106705f910683016108032103832f41093e5005c82d34c5175d452514c01f97620c52430e450a18252d63182424075b5204a800af9
10e180b432108032b5007230e50052825c97f95c3d105157005159ba7034e00a8820a101c0d0c6f242314ac03710575400048ab593508600a593b40068c88a56
d43052542da1d35c824c7551ba52f2515431397596d342d7820bd9e093d46053501740717371933057e093d9b09560f4a65475f254a182d9005550f356005424
70e491c510a1d354a12224e0930187550bd400f4966093e0938610553038202ae5004186d093b6700190f056105c1a10d980564c329105107460a501b07051a0
2291a001a0a08504e150e5964aa971f4b4321053a00a2440377113e1f4e500b6a1d38860a182b04039423400c6918b10cc30a1502460e4005182315982c57001
26c680b5209320f470d96093c87302fa3cf4e50069805410704db070f22d1a5820b0475140408b34d0560050f395005291224c224070677301b0f0551df4901d
13802a00e1f47093e5749049b060a154845982a1a0d970e4000b74d071a001a0704710c4402d700184f52257261073718b004418a501b07002d3806038576da0
a1588276c9394142322291f2411c0148c6a158d3f5522d8493802470377368606762e055b501c08049b5b410324cd3f252f241f201a090935330c6b053a97231
a1918c0042827501b070930b326300410431e7570093b400f87367317400551368f4b40024d0c65979e055d9b071a0d351aba122829122ec108284a151e13939
8415513230b4006830b4d9c09532b5b400e14cd3b8a1d3225284343056912296ba1a403952a1545296ec10ab912250d4006980685420f48035a6802093b6b400
68863056f2827001b0d071d66240a5d391528c6300d4585237d3f25982d48c8690a510228c6873b5005754b51080209b8584303830b4003154a15474c0c6751a
1097d59be1415053301dd65982528441d4419641040bb532b50450f454008560933268b4c8964782d48251825258f0889001d495f2ba82d6b6521aaa0096543d
0022e18cf9102086089038304035a67293b6b473009674a280a12201f1c658b060a51086b07739ec10ba2282a1d3397541d4825251d7ba540b1020488093b067
f830b473d17b237bb0f0f0b2619050c7608560c7608523b255b272802320879190eb90b251a092a360b222400356208791f136c25133379231c03316c09232a0
6b3633e00492686663d8a5b202c03384a00332cb6411452380924490b0b2727080d251b060d192ac007d454029b0c0b272704371d6b890809212f08087b89058
f6e2335680d18910e70063652a3302d092942092686003170010b8514003802090439cb21640f3722043e1d02980b272e023926620640063f6f1002064f600b2
12b092a4916092226864006350f100583610b5d150654240077cd17d916092cca3f60042b6b3006033a56310b6f6004376037184d17d4254006383562165229a
78a2f8a77d9aeb007c916092dc509285b1a60091609251b078a3a600b14331c0d202b0f39c6365504d925475a240b42851fa00a240f0b255109aa3a240d160d8
1d91eb40646240a503a8d2a520b4a2c81194b02310f070b1507ab4d4253132630791c4b473ca70c470c4a18620c600f0cb7a0020e95091dba640437119916040
430a0090b11074a29003110bd1810091db507a2510622047d58261f56c2402e200f0700395c4b473d2e43132d2e5006526f5d280b833c580c48068f5c1901474
40dcd25a6542d2a3b04590da641145600394d06ad1a1709050d121051be9e99050074287b8262300b2c570f1c46c2402e21064f5c19080b272739244d4f5eb90
c06220555050f1c4041024f002d3f03302c0b272409282c008e32855e187d2e4908990a7b2721031924460532017001026113347624017041074107620f07021
f08270d8479200da53201792f5d2a424d161a99008900890e0b2a862c1cb030c00c27324c0bc248047102390b2c543c5106610202460932024a055c4b4b05330
ea630750a64253508b6305d2497361f060d034f0a8ca25a2c40461756150341031e0b3c2662408c9660420d6110b6060d04331d0a9a630c4d461d46170d22b07
24e8f966d410a007a0ca0312e0622002a0d2a526b3c29021a072c88244826690c5050bb18300c5661066a0830020a1c275cb4591d26d101661c0d28470d02088
50dcc28355283b8024d0bcd0f8b311ca2665433507c2635062601690d2b1a0e0508850b1d4615380410232d231d0531082e0d2c5b4e904610463d15050701520
6ad1da8a7d50d0b3d461736311d078601b81301520fa00e600b2b1c06015601b10c4410645502665e1785052007ae6621071c9e300e600b25be56042c4311b14
04b375c1e178a21b2581007a505062c0ecd2e164b31106c27d34100c25200170a002a09053309593151510601961e600b24480d9880b10b3650190b09583a428
12a0836600d0f7c31030e300920031831202b3a7a21b11f01882308312a0908302c7e1d212e092e18930a0ca25577ca610601b25f0187119364b12a05a6c0019
6144d2941092b10261029222d43d21e8e01b1060a774e852507021f0a3a270907021b430a1e6b390181763208660eaf3ec5326000a005050f340b6534544f382
1060d800e260532051b0b244604542005074001757785065743200d083e1b37a7034b1109001a0e071d6d05380126dd297f119a1c3a224eb80d284325050d25a
f1e6c391f150c3f80750d411d0781cb3bb54b0e600b2e4d89400e9630750d4e8e6b345e6206af0211600e012c37c64606064605064e5b4b336f800ca6a716004
b30126a8625051a04a1c0071409a9160b25614b4b361b41074805536c1f2956100d6b271e974b04932001cb3d95acb7d42b1a2209a4260b251b07864006381d0
20ca10321170eb70d181e560e6203480a5a6916606c2e3857910552090183144f1603450025a16ca10c240a005a0d131e5601c32a6401520a9f13dd235262c11
9a2a851468b3c870b002f021a012c024505604bb10d244f13d00830c0022a12c0073a7504d868051c08351b0d1b08349e510b34d3385806210b1e0837281f22c
005407a60004d95044f4810022b27206f312f089f3554201f090ec4b12d0f3b1a043e40050d97094006a868071fa32331a88e810905330e462e002b02a2c0054
1074d03601d38206b2477c9101f0c08250601520805308e3830c73c8106055012a31d08690a52001fa37d251e001f0e0b1fa152090f021c0b1a053fa0084c210
62c002a0628051e0a675c8a0c09301f0a022b06015202300345071c3663261000462e0dc621012a06d14d284f2e8109014e85431f8d2e140b4001520f06070b1
22b122b15160334992dc70602370d166c8105aa0d28275d60030d60030d6110b830c4a4055f33604d6362370b4c220c489d202c92531e96300e1d251d3d99017
32ca10a007a023708766000190900c21fa10323103a8200b88a632eb91a005fa8a509001c0807750d174d0e458e07041e0b282d014c47ac015601b26885060d2
3560036dd0f8916050e56050267a9550b9cb145050b241f0eb507a91e560f322904360da283704531002c0b241c0e90050b99001d11701b402e040033579d056
038231b150f0d5177001f06d0023745071f0d2c510a007a0f04ba31062fa00c092c5d2e41066b07440ead241c079d095d062809430d272e073104afae2d25675
6301f09055c0c44a2600c00461709021f0a5730750074a200a4ab051c990500372b0d401a07002c9b310667363075004f86542006050909be690046310244071
f0d2822070d2f500bb4311e92001a0080b919021a037d272600190b041f00151f57af6338b929cf0c45870a0d180922210d244c003b7d222e06270c528325810
a9b021f08250d27258d6e4d211b411c810a051b062e0557500a203169466306b1219e600635a5065c489905a42d2377aa6b3416050538056915410b38c62e012
d07361044a10a500426670d28b60c44591601b53909584bb8158005ad36628a5000170a037659b5050907501c993d2557001fa71c9c8107012f07510832b00bb
34f051f9a273509062a0c61140d212b08032a640d246017080ea008024a051d1e6c47ad0320020d202e04a8049035b7531f8009272c880c002c00302a0d0c461
3092f52610d202d021f0c67501b436284420017541c024b0a5d02079f0a562d400d6b3605350a475634562d00a00c27360031750030a001cb38650ec6532b345
24e002f07579f055d271226690215ab0d102102a66f060f0606ae9e9d10990a60b25b256239266b0f65027b0b3d1c3007a50f1507c90043351510b11239231e0
90f6b027a9a26080d91071fa0050b0eb7d500460502300f06091f0eb60f02760f3cc009160d110f64395f800b4502300b491b491e9f6f0f2275043a4d1308349
f800b9d1432c91b9f04560f09627404312d031d032b361703312525023b21202b987f65070f150273028121200fb20f900db705350a5a691d104d231d020b9b4
f63070d13027200394005200d0db52b3b36603229470d1106065036df2030a2003766100a370d1a77c2710b3f570a190a1d211d070cc40d282302360d11c64f6
00708cc0a120c0452710b361ca31405b703470a800b0f6e1d22b5d6100b1969c20a1c0a216a148d231d09580d2008140c0914003a8453b9570948081003b0312
d00450d36be0b5a2a300c072f601f947d2934075d2e1f27005c0a12048628076ebebc071f63460e4c152005440f90322c8e156c8e149a1e08060628a10b0b932
8850e553516109800560070382c300d050a5e1b3e53430f70980a7b1f2e5032263e1b050032d5075000312b034c0b1e009803140037291b0600371c3c2900302
d02480bc032297cc7003a410c28003a490f6902790b3a980053b95703480e1f104c270c4b1e5c1e1b3e5a2f2b1f6902714b1cab3bc031724b067b373f6c4b154
6503a3f0f1a08080740961b354dac4b1326130037119f6702710037655809074701287c490625200f120704344c9f100a2f8f07578c220c4b120c4b0c409f811
f2e5f6502720030c6300cb5090b3ea3089c2100311d0b120218990741056e950a232c143ac02003b27c043f5d17062c2903371a0c300a327d0337223004ad056
607133b1f0d03331d003f7b910200170d0a5d17bf06a6a6365e2411531a1327331f281a17332f2b3404113aa9805e60045a303e4c103a3c3d48b104160037230
900371b70078da00da008810f28b20d481a13cf213411c8205b60082f89861cb037280c21031f25732035500f2e1f20003442b108066806220d7b30312163196
680351c098811154106800aa8191053b1300fc00716b17bb0082da00c27300d4031670f772037681132545a2f76c256113f6610013146100a37021c01287ba00
1b25403a417ce6415060415060415080b6e240d1d20284617d78500778a6e1b272d4b271f04395b2711900136ac162208583120800f191f104b3bb00f1f583e4
0061fc009272f800c04356f829d0f1a6b2a8b365625a992661711c6191f1b3c116b3c216951083a5726192f7269c6092b1c0160020b2bc7d62c02ca913004766
77787842f1b314f1a600e280929528c692ea2043e410cc4b1dc0924991b2acc1f180e16a106270936280b151d502b0f5c1027850a2f1919065e262f0e4f191e3
11e1d8e4f1cc0062f0c692b1b7fc06000291fc00f191f10030d57119106250e4b2e4c216b3eb16f351020016f376c2d3f3eac272613b91acc1c05370e4207610
bc4072e30a0016f116f10a11b500f116f177771626774490b092f5204426cb4477442a806a0081b68170b610e1a131f2319631d4314c70458b00e614105830f0
5122811b69d4327331a1319881a2f800f281a6e21040e8b113b113b12700133b30d1704b356374e051840bc25291133b70d1fca60033593600645065b0241093
d10200a224c0c5e8b4b30022d3420006338291f811aa63656189c700f8c1403371d004b32b420013c7b3653341122074d0c56b7690b34d3371c3a60344003331
d07aa17a70e874d012c9e21113006ce8610030921a13a7046114b310bbf2d1cab350d12053a07197c141e63a10e82730a1132700a182616c30f2a3734c008bd4
b173a1b610d163074240455086c00a507410a5f714e81c113ae200d2a5005486f049c24566a6668961839510684ce2d43170d1810078f700b6830010d062c055
0054116c1483e19131a132a15461a131dad14d6c00913a422460a510e845304710c08312029c10c371c3bc10f3c5891016c3bc00611154109a630170d0566640
f371a0d80c50d836c116113a02003080f337c31182da0002f5208053708502006641021030fc9a0041da2b894041dae891d851a051c0f33711e4f3e78020d950
51a0c0f3dc6180c261006b9520d517145251b0e8891054e270f356d856c1dae200b062eb906c00c33ad0f3945102d5f5c1c3d5ecac9217950061522d60e88940
82d4e262c18053aa005b89531c00cb714709ea1113000237a7e2ea11b5000241028213e1e4004092ec30d1b67c6c6091894089108337f3a540f3cc0071b6f3b1
e030f3a3a2a91013530012a092493052b6dae30082e25461b3e20082dad16360f336c04083127544d1023720721092cc001072e331453044d102003072daf782
638900826245a9919235f311f040f791400989a7c82090951392c51045731cb20a911b7861003071b3530200715840c0e46640d1f850830251830248118302f0
079881962033e131ca31a1db6491d1a1314082103aa2c80009aa00e6f3aa20520030d15cb861a258305a90b040187614883a0482706270a51392e420d4000633
e191507820624047703a501cd163b024c05604da006c8861a22b14007a61a2e12692853121a0554ba5a16402d1a1206aa1047070b430c4657cc465509a634de2
a6e20041f291c372c0017070a59cfba13045fb91b9e191c31587911991d17d91d033e48367a142006691d4e198d4a220839b7075c1ca91f214c1f2b3003211ca
00287610d2b1d0c474e095d285c8ca55d910671131700270f20c30710432805401a0a0854210b202a0e8f2c410826150d2f720d2c59120020031d4db706561a3
db1020c450830c13007c10e8f2202835d294e21001e367a19132ca113283a3709083e1d42083360010015102a083316425668810071481110700b6e2c81917d3
61c300208610c692b1a0905021091498137d6100e26a00e2006631f210308337661361007053b00d94e8d432da00a279d0550190904788f2e1d4b3e220981541
426181a13009f2e107110620534041fc7d881096b59606f240a150a1b8fb30d20da1504d6c20986666816c09f23281a14200636250a5019060173a4510968154
96814040f240884040a191ca9830d1096991a1318302d6f866a13088a131a13281a1e1789198737d41da21c09450912083b1510700423188f8e2109807c16191
4b3583121631d411d4a60078208360daa1c44bdc1020698863aa53c0176290ea8393b530f2314181b173e501c08093b271a05181b122dc007088b164b122b1e9
a18170d188136169a1e104da009807611851943196818231f2158151d1b7e2005251d10820b244009164b13d00dc88b18122b1518104b0146191b0d1a16800e2
31f200131021f00a5310c5fca23045f81491d7b41410d3b7e2105251f065e252a2f810415088a2062510520066d1b0d1a1b56100f2140082e262d082f2319613
d431f2d7a62052841420520b101420d3a6e2f10062f093915210146152d1b060a11b11a13060a130711b2511e95078a21b2565b282b9e30ad160987001c0f02c
10814040a18170f200b8da644200b8da00e282b282526c1089d202fa823060a1066189804064428089101bb21a1343553090d1d8b1c9a18170caf6d849607842
__gff__
18000d7c63200107c807c80754bf29002e9a071b0207c8070834582500070634532b170e2a07beac30130d33140e9a0da9bc000aac1800071b01ac3f8a301b485da1012f00ac000dbc8e630b5d2807c83053075d280d09630b261c0d5d6319022b670826aa000f9a0d35050a32b732b732b732b70e04209b030c1f044d0c1b04
0b040c543625202f20011800840b04201b6141a8019f2031202e41000c043d6118202e410161250c6e002e4102203d0c6b0020012c010484182001034104203725200154010361182001be01031b20701f319b000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000
__map__
00052b141d403b1dc100893d1a3d1a1d7200461b1d1b18250506ab008f022f05404959070451880107451cac006e0093ad2e4113071d0208025117957200251a18251b1815181b1d3a003141163b1323385a4d00388a11371cac005b001638493178191d271440a314c710614ec72816ab2e3b4f0549351cb03b24bf1a66012c
062f312e38494f370217981166c60010461b9c002e38210f561a81a0001e2f1e1a13ac1388014d021f2e03384403b7322b5c0f0778a2c11523030e6d0c2955180b7c0567037c0024a2160a074bb37806294e660434761d07067c069a037778a216150f06ac1db3720278341446b37c020f042736170375190a074b3a1d1b07d4
72011d6a8f347702461b46a24627010717130654196d0f8b011a1d1b2fc9110272001d6a3f200c04a9191dbf1a9b0109171372180019227806042f5ec90088012f1b40411c30159f7c0017194b1a1702074b171e722cba6106061a194dc9d472006a2e11301b487c01274027020a1d2372160019134406071a19ac34ca1a033d
2f05307d0f4509783e2137ba20060834210b061d0a1d88252f3d3101a6017c0108024b020c1d205f00211b9000baca1a120c395436171d0a1d1a0330ae0008044b03074b18781f1b2f16224660132f5e1714a91ab804225d6c4d02120c65017c0008031d3717601d3717186a0075360022466d311e1a2146174e011d75052d13
0eb64a030f6b050f6b006ab655047c01461b49166701491f1d0e037c0330d25030200eb6491e3a169c7c010f041a0e031d492f7c04b6ae100b074e017c010803b45f00d77200bf16af7c003a0e0369d61a7c0530b5260f8a32019b0002901c166d1d4d060e07061d0a35061b8408320367021d0a0746694b1f4846334a037c05
08099e67031d0a07464d461f08023e33200f047c0f080367043358023e3a1133150f067c020f0c67062d1484013a3b33ca4917210f0867091d0a081d697c00185a160019070734cc059b211b72001d050777461fbc1d0a089e1a0d03170d341b0e03461b1921be001b1d2436344a090f041a3c2716170d083420251d2f3a9b14
49171424270141670130530a0f04690e0934150eb31d2728130404cf346606156334140c051d7728137c05670234c001d30512702e6233ca320d33cd0c7c03670c2922010d7c01670d292201d5000a32050f061a2927033344000f0a0f0a1db7030421000d298f090a345e61630f090509a6540da6190f09051faf30a0093453
800a0829670829670963806d000b6d000f6d0a5a4a087b0b79000c7b0e0a20007b0ca50f6d0a944a077b0c6d000c7b0e0a2100800758047b07580a64015f634a01580464075804a5062911910d210e7b0c4a054ace4a0664110d7b0c64c9641d0f0a0d4a054a180b4a06640f800c640d641d057900034a050a083367080d042f
298a3b0a080da9047900044a040a090d054a4c4a049c0d038802d30033cc11040a093467036404641a054a16064a0464560798221a3f73010d1704641d1a0e4a0d7b054a16054a064a01697b01d30b4a0ca50d0a1d160d640ca5054a3b6405220704a500d30b4a0da50c0a1d130d640c640033219f221a4a04641c070c4a0e7b
0c64a90d4ac06416054a056441224d4a036401070d4a0e7b0b64a90c480d0c64160b4891d3044a034a00880c483c000f0a336c0a790d040a080dcc64414daf912f000a793c000d4a040a080d1d160a489100030a090d5c641c699c912f91000a480d18060d054a030a095dd0046458483c0726085c0c9c00050d054a04641dcb
a5044a25094a0188044a411a0d190c0a25054a044a7c000580067b058007a5038003640007d46d2f4a0480058006a50480074a0580070aa9037b000d067b037b070a707b03480d051a7b024a032233272e0d032230731c646380096401633b6475802607743315af800280094a03800964210464110f9c6413066418094a0264
0464160f794304670464007b0f6d644c4834114b000f6d345f11043ca50f0d040d14060d190d0dad0d180f0d0491000d3c110d1d033c79000f0d030d14050d1b0d0dad0d140f0d0391000d91110da9010a1d420ec91d1b010d0d420c94420e170a9a0d0b2b7107420d210c0d09420f3a030a4704150e4706170fb70a0b05b700
0f9278a22b6b0b300ead3b1dbb11231d1600d7bd021d54bd02093b1f23521d13231800d76e3b0d34d6313b1b2352110f0d073c30aaa71f050f1f3eb20f621fbdb20309c03e0129c9051fc13e2eaa1f0d4628031f791f050c1f483eb20e1f0a301b0a0f09053e010309411f48305f001f481f911606462e001f0a071f24d30879
3eb2023ed307791fbb091d4c1f1107041f40225d5866060f56031f3b1c2e30a0001f3b11022d530880002a02a2000faf0a5034650a2d65260265010d31000646002688092dd60709ad0a1d1b04225f2d49087f060e2d0e183e63a61c225f542d1746164016060d2d0c53061582270d04092d4400660546002d157c3601d3076d
19091b2d1b3c023e0009ac000a07d41f3b82288616052606225f41192d77632c1538111d2e02350253d3000a3828067f0526901e3b382323b2083e403a0505092609769208260d4903468501cf2c8036067b0126cf2c01260e2115222400a8560529170e3f0470223b06582ca34300490138633656623a3e00364308150a3f3a
0c28a80001a8b542051715345a3604481f3f150f077962b20262be0162637a620633ce430e7b7f1b165e160608420721cfd3017b00406d04083ed307c248385c097a19226aa8000581941f4838cd4209553815cfa8084280cfd3010a260c4e001598017e0036168117491f400656245c011e2aa852002e0998a200ac811b2016
060a420c1b910060260b6c0054018b1585861e281f873e3b37006d4c015f3f5990a5260b3a0e35035c1b03800338491f38210b45007938213d09a71102a50062243509440e6e3b41877b366f09430749063f5a526a9c0229633f5a04a58f003f280f9ab0562404702a3849038d533874262a0938a0006a8f4707cd0d91000d02
3fb81b365252118f7a243f3a1f3b4514048dcc3f1b48193f1b0e059100053f3a86051a8fbb007a028d3a40063820d63a430e210d04af38c2d40024027b4c010268007f023ed3bec7d72c3629653fb5063e112f0006093f282c85010ca13f08a8020a1f00233b1290068d0813d42a3f3ab2000d073f220f1b601c7a4105350b44
05260d27095db5055d2806055d7f6f3ed3050a9ab2013b429a0c352001223ed304a29c00041f38942b6505295f031f9c3ed3050a260d65411f00364706140e4309440c470615849c0047064e3f27c20a083ed3080acf623b81674207440b68035a812227160d0281210c260c170d08af0060150147052201a80047058a470c5a
102f170e260b22062661000c3f150a358b018509094e1707915d2805680444065d5e0c2b27035d220bbe870d042fb6b210ac280d5d0c6e418f260122371fb0019d543d3b9d045c5d0c060e10a2d6025d0804d6b20c5d3a8c6d61025d080680080a297f0f3f27050e38cc0f100c0f200d08a4790022232e06090a2b58015f602b
942d271833130f100f0c3a1c00a72b04041a8001a2100f0825b51fc25f01231600311f02622cb25f3b093b1f5fd434731600871f402b582d713c008c0109391f242bc200386c41a2a72a8f025d392ab1085d39051dc82a8f0109d41962008f30cc385841193e2b58410926047b18453b2c37523b022b7e2a3711231dc8331b0f
4502347130132029a12b6b0e260f2786222bb12e483e008c1104044b2606cab72e864c4b856f01074b06127a0d371dbb012b08861c2c9e0087242b845e520d41291b0a12ad4d520c41100b07d1298f45522c0906c22e33ae2908060dbd6a086233140f29aa0d380691c70729210d29aa4b5254010829210d29aa4b5203410929
210d29aa4b5256010a29210d29aa0f470f4e010c29210d29aa4b1cc60d29200e12ad85240628470c0614330013230096145151131b131a51139606127a0329591a131b75127a07503800010971007c3800283c1a19372d0c19824500501d2b7d17b97d7dcc0013207d76130d920f2959211320133c39127a0330639314181b18
be004a00cf00151e0a29210f29634a001715ae3300361b3c931753012d0c19821e0e3c850104ae4623891819181b89181a83181f18481825c318201819183c89180a33cb00183c505d140f15a1017e0581270bcd007ec80006127a6a1b1d1a2819082d790d120a49610006b4110d21180f4306531437c8001449180429150e29
c01b14890e127a0721032d22051bd3000a33200d2d8404253c1fcf00092d0c040d8200010c2103b44a96c41773007e954e001450260953920c2959207e1450330036420f5a3800010658352c092d0e03083c7200181f052d0e040f82280e420f7f3c1421141d145118191b191dae009305920d295921199b1a190d127a033059
3800012fd20a2d0e281a17d019062d0e040f82280e420f3a0013061007081e3a1e6861b2130629491e13062d2709204a000a102fd6022d440b461a96032d790c343a031718d30016241a4f4741014770ad00181b218c0505170d4708272f1b0729498c194ec421d32d210b1d15c02dd6144929490421181d2015181d082d0e04
0f827f16931f44181f3c094700220526042885ba0c5d273c1b18c40734110f10ba7b25181a1e25141825048d5e075033003647007b2d0e040e82ae00253c186f001a18201320054700ca6808130c1972001a02103e71680d2206251a201a893cc800ae001a2107345f47007438110e25cd00c58a3800020d10697b4700490238
00040e82b5552604a0215c2604200f10090b5a1007094945260a8a68d60161005a0014834e920947015530c91f2548250c3503a12d6185007a004701150e2d790c120a490017022604533c1e9d0d210e218c060b204919171d14218c060d22091d145a001a1921181d144d08680dcd032d22013c2521251d25180c2d610d1069
3a2e183c25181d082d0e40821b4425024701280f1046040b0c211a1fd11046061b470106b9175500258a0017d03c089707670e92320017551c99099705200d539209257708104606b36c0015021046bc0f0b47011e7800092bae7300191f94001a1f08920f338400104b081b19c801104bbc0c3508150c4701b2011fc2251f25
1f0c2601130f20127a0229590d33200f920d0209104b9c0d1048140c104b9c1f980014a0011710481e0c104b0c32104b610135083914890810481e05104b0e32104bd6054700d00085194485783a0f970d0e040e1772001a1f181f883600c407970d0c6b4257010d97d6010f9708b1029194009400181f94001dcb4707490797
08230229cb97081e0d9708081e97029c021f1b6f1c1b20133c191f190a8d490f9702440c68084408103e3a8c0e370144a43cc1128e0c21cc36005a3509712d493a33210d3028069d0b270fa43c0149a44d40120ace3c134675000a34440720ce010433200d301e06430a4808a40728850c0b7985030a150e213a1f7300c2191f
5f0025062d490d25d01f775f001d1b77250929170d430a6108100c20050b3f1e024303ae100b1d05093f270b100b7a2515183c180e104b732bcb190e105723003f270b109c490c1b211a21180f2b2701140f109cd6003f3a0b100962013c15183c191d1b0f2b27011a0f10090945003f220ab7050a1db732b732b7200c6329c9
__label__
00000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000
00000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000
00000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000
000000000000000000000000000000000000000000000000000000000000000d0000000000000000000000000000000000000000000000000000000000000000
000000000000000000000000000000000000000000000000000000000000000d0000000000000000000000000000000000000000000000000000000000000000
000000000000000000000000000000000000000000000000000000000000000d0000000000000000000000000000000000000000000000000000000000000000
000000000000000000000000000000000000000000000000000000000000000d0000000000000000000000000000000000000000000000000000000000000000
000000000000000000000000000000000000000000000000000000000000000d0000000000000000000000000000000000000000000000000000000000000000
000000000000000000000000000000000000000000000000000000000000000a0000000000000000000000000000000000000000000000000000000000000000
000000000000000000000000000000000000000000000000000000000000000d0000000000000000000000000000000000000000000000000000000000000000
000000000000000000000000000000000000000000000000000000000000000d0000000000000000000000000000000000000000000000000000000000000000
000a99999999999999999999990000000000000000000000000000000000000d000000000000000000000000000000000000009999999999999999999999a000
0000a0000000000000000000000000000000000000000000000000000000000d00000000000000000000000000000000000000000000000000000000000a0000
00000a000000000000000000000000000000000000000000000000000000000d0000000000000000000000000000000000000000000000000000000000a00000
000000a0000aaaaaaaaaaaa0000aaaaaaaaaaaaaaaaaaaa0000000aaaaaaaaadaaaaaaaaa00aaaaaaaaaaaa00000aaaaaaaaaaaaa00aaaaaaaaaaaaaaa000000
0000000a00aaaaaaaaaaaaa000aaaaaaaaaaaaaaaaaaaa0000000aaaaaaaaaadaaaaaaaa00aaaaaaaaaaaaa0000aaaaaaaaaaaaa00aaaaaaaaaaaaaaa0000000
00000000a0aaaaaaaa9aaaaa00aaaaaaaa9aaaaaaaaaaadd0090aaaaaaaaaaadaa9aaaaaddaaaaaaaa9aaaaa000aaaaaaa9aaaaaddaaaaaaaa9aaaaadd000000
000000000aaaaaaaaaaaaaaa00aaaaaaaaaaaaadaaaaaad00000aaaaaaaaaaadaaaaaaadd0aaaaaaaaaaaaaa00aaaaaaaaaaaaadd0aaaaaaaaaaaaadd0000000
000000000aaaaaaaaaaaaaaaaaaaaaaaaaaaaaadaaaaaad0000aaaaaaaaaaaadaaaaaaaddaaaaaaaaaaaaaaaa0aaaaaaaaaaaaaddaaaaaaaaaaaaaadd0000000
000000000aaaaaa00000aaaadaaaaaadddddddddaaaaaad0000aaaaaaaaaaaaddddddddd77777aa00000aaaadaaaaaaddddddddd0aaaaaaddddddddd00000000
000000000aaaaa00000aaaaadaaaaaddddddddddaaaaaad000aaaaaadaaaaadddddd77770aaa7a00000aaaaadaaaaadddddddddd0aaaaadddddddddd00000000
000000000aaaaa00000aaaaddaaaaadd00000000aaaaaad00aaaaaaadaaaaadd007700000aa77a00000aaaadaaaaaadd000000000aaaaadd0000000000000000
00000000aaaaaaaaaaaaaaadaaaaaaaaaaaaaa00aaaaaad00aaaaaadaaaaaaad77aaaa00aa7aaaaaaaaaaaadaaaaaaaaaaaaa000aaaaaaaaaaaaaa0000000000
00000000aaaaaaaaaaaaaaddaaaaaaaaaaaaa000aaaaaad0aaaaaaddaaaaaa77aaaaa000a7aaaaaaaaaaaadaaaaaaaaaaaaaa000aaaaaaaaaaaaa00000000000
00000000aaaaaaaaaaaaaaddaaaaaaaaaaaaadd0aaaaaad0aaaaaaddaaaa77adaaaaadd07aaaaaaaaaaaaadaaaaaaaaaaaaaaa00aaaaaaaaaaaaadd000000000
00000000aaaaaaaaaaaaaad0aaaaaaaaaaaadd00aaaaaadaaaaaadd0aa77aaadaaaadd77aaaaaaaaaaaaaadaaaaaaaaaaaaaaa00aaaaaaaaaaaadd0000000000
0000000aaaaaaaaaaaaadddaaaaaaaaaaaaadd00aaaaaaaaaaaadddaa7aaaaadaaaad70aaaaaaaaaaaaaddd0aaaaaaaaaaaaaaaaaaaaaaaaaaaadd0000000000
0000000aaaaaaaaaaadddddaaaaaddddddddd000aaaaaaaaaaaadd077aaaddddddd7700aaaaaaaaaaaddddd0aaaaaaaaaaaaaadaaaaaddddddddd00000000000
0000000aaaaaaaaaaaddd00aaaadddddddddd000aaaaaaaaaaadd07aaaadddddd77dd00aaaaaaaaaaaddd0000dddddddaaaaaadaaaadddddddddd00000000000
000000aaaaaaaaaaaaa000aaaaadd00000000000aaaaaaaaaaddd7aaaaadd007700000aaaaaaaaaaaaa000000ddddddaaaaaadaaaaadd0000000000000000000
000000aaaaaaaaaaaaa000aaaaad000000000000aaaaaaaaaad770aaaaad077d000000aaaaaaaaaaaaa000000000000aaaaaadaaaaad00000000000000000000
000000aaaaaa0aaaaaaa00aaaaaa0aaaaaaaa000aaaa0aaaadd700aaa7777aadaaaaa0aaaaaa0aaaaaaa000aaaaa0aaaaaaaadaaaaaa0aaaaaaaa00000000000
000000aaaa00daaaaaaa00aaaa00aaaaaaaa0000aa00aaaaddd777777a00aaadaaaa00aaaa00daaaaaaa00aaaa00aaaaaaaaddaaaa00aaaaaaaa000000000000
00000aaaa0add0aaaaaaaaaaa0aaaaaaaaaadd00a0aaaaaadd000aaaa0aaaaadaaaadaaaa0add0aaaaaaa0aaa0aaaaaaaaaadaaaa0aaaaaaaaaadd0000000000
00000aaaaadd0aaaaaaaaaaaaaaaaaaaaaadd000aaaaaaadd0000aaaaaaaaaadaaaddaaaaadd00aaaaaaaaaaaaaaaaaaaaaddaaaaaaaaaaaaaadd00000000000
00000aaaaadda00aaaaaaaaaaaaaaaaaaaadd000aaaaaaddd0000aaaaaaaaaadaaaddaaaaadd000aaaaaaaaaaaaaaaaaaaaddaaaaaaaaaaaaaadd00000000000
000000ddddda000ddddddddddddddddddddd00000ddddddd000000dddddddddddddd00ddddd0000ddddddddddddddddddddd00dddddddddddddd0d0000000000
000000dddda00000dddddddddddddddddddd00000dddddd0000000dddddddddddddd00ddddd00000dddddddddddddddddddd00dddddddddddddd00d000000000
00000000aa00000000000000000000000000000000000000000000000000000d0000000000000000000000000000000000000000000000000000000dd0000000
0000000a0000000000000000000000000000000000000000000000000000000a000000000000000000000000000000000000000000000000000000000d000000
000000a00000000000000000000000000000000000000000000000000000000d0000000000000000000000000000000000000000000000000000000000d00000
00000a000000000000000000000000000000000000000000000000000000000d00000000000000000000000000000000000000000000000000000000000d0000
000000000000000000000000000000000000000000000000000000000000000d0000000000000000000000000000000000000000000000000000000000000000
00000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000
0000000000000a0000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000d0000000000000
0000000000000a0000000000000770000077700000777000007070000077700000777000007070000000007000000077700000777000000000d0000000000000
0000000000000a0000000000007000000070700000707000007070000007000000070000007070000000007000000070700000707000000000d0000000000000
0000555555555a5555555500007000000077000000777000007070000007000000070000007770000000007000000077700000770055555555d5555555550000
0000000000000a0000000000007070000070700000707000007770000007000000070000000070000000007000000070700000707000000000d0000000000000
0000000000000a0000000000007770000070700000707000000700000077700000070000007770000000007770000070700000777000000000d0000000000000
00000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000
00000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000
00000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000
00000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000
55555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555
00000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000
99990000999900009999000099990000999900009999000099990000999900009999000099990000999900009999000099990000999900009999000099990000
00000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000
05000000000000000000050222000000000000000000500202000000000000000000000202000000000050000000000222050000000000000000000222000050
05000050000000000000050222000000000000000000500202000000000000000000000202000000000050050000000222050dddddddddddddddddddddddd050
05000050000000000000050222000000000000000000500202000000000000000000000202000000000050050000000222050dddddddddddddddddddddddd050
999999599999999999999999221199999999999999999992021199990999999999999112021199990999999599999112299999d1111111111111111111119999
a9999959999999999999a9992211999999999999999a999202119999999999999999999999119999099a99959999911229a999d1161111111111111111119a99
9999995aa7aaaaaaaaa999992211999aa7aaaaaaaa9999920999999000000000000000000099999907999995aaa99112299999d1116111111111111111119999
0501995aa7aaaaaaaaa905022211999aa7aaaaaaaaa0509990000aaaaaaaaaaaaaaaaaaaaaaa0000999050a5aaa9911222050dd111161111111111111111d050
0501995aa7aaaaaaaaa905022211999aa7aaaaaaaaa05900aaaaa00000000000000000000000aaaaa00950a5aaa9911222050dd111116111111111111111d050
0501995aa7aaaaaaaaa905022211999aa7aaaaaaaaa0900a000000000000000000000000000000000a00900000a9911222050dd115111611111111111111d050
0501995aa7aaaaaaaaa9059aaaaaaa9aa7aaaaaaaaa05900aaaaa00000000000000000000000aaaaa009599999a9911222050dd111511111111111111111d050
0501955aa7aaaaaaaa5555900000009aa7aaaaaaaaa05099900777777777700000077777777777009990500000a9911222050dd111151111111111111111d050
05019055a7aaaaaaaa555590a000a09aa7aaaaaaaaa0501229999990000000000000000000999999a7a0500000a9911222050dd111115111111111111111d050
0501990057aaaaaaaa555590a000a09aa7aaaaaaaaa050122211999999999556665599999911999aa7a050a5aaa9911222050dd111111111111111111111d050
0501990a055aaaaaaa00559aaaaaaa9aa7aaaaaaaaa050122211999aa7a55006660055122211999aa7a050a5aaa9911222050dd111111111111111111111d050
0501990aa005aaaaaaa900040211999aa7aaaaaaaaa050122211999aa5500996669900552211999aa7a050a5aaa9911222050dd111116661666111111111d050
9999990aa7a055aaaaa999040211999aa7aaaaaaaa9999922211999666099000a00099666211999aa7999995aaa99112299999d1111161611161111111119999
a999990aa7aa005aaa4444999999999aa7aaaaaaaa9a99922211999666900055a55000666511999aa79a9995aaa9911229a999d1111161616661111111119a99
9999990aa7aa0a055a4144a05500999aa7aaaaaaaa9999922211995666005522a2255066605199000009900005555555599999d1111161616111111111119999
0501990055550aa0054044aaaaaaa49aa7aaaaaaaaa050122211995090052222a222250090519900000000aa0009911222050dd111116661666111111111d050
0501990000000aaaa04444aaaaaaa49aa7aaaaaaaaa050122211950900522222a222225009059900000050aaa000955522050dd111111111111111111111d050
0501995000050550a00550999999909aa7aaaaaaaaa050122211950905222222a222222509059900000050aaaaa0005552050dd111111111111111111111d050
0501995000000000a50055440000550aa7aaaaaaaaa050122211509005222222a222222500905900000050aaaaa5000555050dd11d11111111111111d111d050
0501995000000055050505550005500aa7aaaaaaaaa0501222115090522222000002222250905900000050aaaaa5550555050dd115111111111111115111d050
0501995555000000005550005215550aa7aaaaaaaaa050122211666052222200000222225066699aa7a050aaaaa5555555050dd125221111111111125221d050
0501999aa7000000050550020551999aa7aaaaaaaaa050122211666999999900700999999966699aa7a050aaaaa0555552050dd125221111111111125221d050
0501999aa7aaa000000000020005999aa7aaaaaaaaa050122211666052222200000222225066699aa7a050aaaaa0055502050dd1252211d1111111125221d050
0501999aa7aaa000000055550210559aa7aaaaaaaaa050122211509052222200000222225090599aa7a050aaaaa0000002050dd125221151111111125221d050
9999999aa7aaaaaa000000000211005aa7aaaaaaaa9999922211509005222222a22222250090599aa799999aaaa00000099999d1252212522111111252219999
a999999aa7aaaaaa000000050550990557aaaaaaaa9a99922211950905222222a22222250905999aa79a999aaaa0000009a999d1252212522111111252219a99
9999999aa7aaaaaaaaa000000000990005aaaaaaaa9999922211950900522222a22222500905999aa799999aaaa00000099999d125221252211d111252219999
0501999aa7aaaaaaaaa0000000555500000000000aa050122211995666052222a22225666051999aa7a050aaaaa0000002050dd125221252211511125221d050
0501999aa7aaaaaaaaa905000000000dddddddd00aa050122211995666005522a22550666051999aa7a050aaaaa0000002050dd125221252212522125221d050
0501999aa7aaaaaaaaa905000000050d77777dd00aa050122211999666900055a55000666511999aa7a050aaaaa0000002050dd125221252212522125221d050
0501999aa7aaaaaaaaa905022000000dddddddd00aa050122211999a50099000a00099005211999aa7a050aaaaa0000002050dd125221252212522125221d050
0501999aa7aaaaaaaaa905022000000dddddddd00aa050122211999aa5500996669900552211999aa7a050aaaaa0000002050dd125221252212522125221d050
0501999aa7aaaaaaaaa9050222110000000000000aa050122211999aa7a55006660055122211999aa7a050aaaaa0000002050dd125221252212522125221d050
0501999aa7aaaaaaaaa9050222110000000000000aa050122211999aa7a0aaaaaaaaa0122211999aa7a000000000000000050dd1252212500000000000000050
05019999999999999999050222119990000000009990501222119999999000000000001222119999999009555500955550050dd1252212509555500955550050
00000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000
50555555055555505555550555555055555505555550555555055555505555550555555055555505555550555555055555505555550555555055555505555550
a0991111011111101119a90922111011110000000000999222011100909999990999999090011101119a00509500050950a099dddd0dddd05009500500950a90
909955550555555055599909225550555550000000009992220555000000000000000000000555055599005559000555909099dddd0dddd05055900505590990
00000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000
00022222022222202222050222222022222202222220502222022200000000000000000000022202222050222222022222000222220222222022222202222050
20222222022222202222220222222022222202222220222222022222202222220222222022222202222220222222022222202222220222222022222202222220
00000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000
aaaa00aaaa00aaaa00aaaa00aaaa00aaaa00aaaa00aaaa00aaaa00aaaa00aaaa00aaaa00aaaa00aaaa00aaaa00aaaa00aaaa00aaaa00aaaa00aaaa00aaaa00aa
99900999900999900999900999900999900999900999900999900999900999900999900999900999900999900999900999900999900999900999900999900999
00000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000
00000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000
22222222222222222222522222222222222222222252222222222222222222225222222222222222222222522222222222222222222252222222222222222222
22222222222222222222522222222222222222222252222222222222222222225222222222222222222222522222222222222222222252222222222222222222
20000000000000000000522000000000000000000052200000000000000000005220000000000000000000522000000000000000000052200000000000000000
20555555555555555550522055555555555555555052205555555555555555505220555555555555555550522055555555555555555052205555555555555555
20500000000000000150522050000000000000015052205000000000000001505220500000000000000150522050000000000000015052205000000000000001
20500000000000001050522050000000000000105052205000000000000010505220500000000000001050522050000000000000105052205000000000000010
2050009aaaaaaa910050522050009aaaaaaa910050522050009aaaaaaa910050522050009aaaaaaa910050522050009aaaaaaa910050522050009aaaaaaa9100
20500099999999900050522050009999999990005052205000999999999000505220500099999999900050522050009999999990005052205000999999999000
20500099999999900050522050009999999990005052205000999999999000505220500099999999900050522050009999999990005052205000999999999000
20500099999999900050522050009999999990005052205000999999999000505220500099999999900050522050009999999990005052205000999999999000
20500000010000000050522050000001000000005052205000000100000000505220500000010000000050522050000001000000005052205000000100000000
20500000100000000050522050000010000000005052205000001000000000505220500000100000000050522050000010000000005052205000001000000000
20500001000000000050522050000100000000005052205000010000000000505220500001000000000050522050000100000000005052205000010000000000
20500110000000000050522050011000000000005052205001100000000000505220500110000000000050522050011000000000005052205001100000000000
20501000000000000050522050100000000000005052205010000000000000505220501000000000000050522050100000000000005052205010000000000000
20510000000000000050522051000000000000005052205100000000000000505220510000000000000050522051000000000000005052205100000000000000
20555555555555555550522055555555555555555052205555555555555555505220555555555555555550522055555555555555555052205555555555555555
22222222222222222222522222222222222222222252222222222222222222225222222222222222222222522222222222222222222252222222222222222222
22222222222222222222522222222222222222222252222222222222222222225222222222222222222222522222222222222222222252222222222222222222
22222222222222222222522222222222222222222252222222222222222222225222222222222222222222522222222222222222222252222222222222222222

__sfx__
000108001807014070100700c06008050050400202000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000
00010c00206601d6601b65018650166401464012630106300e6200c6200a610006000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000
00010500316402e6302a6202861000600000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000
001d00002a0422a0422a0422a0422a042290422904225042250422a0422a04225042250422504225042250422a0422a0422a0422a0422a0422a0422a0422a0422a0422a0422e0422e0422e042250422504225042
00080000096501f6200e6502863007640186200c63024610096501f6200e6502863007640186200c63024610096501f6200e6502863007640186200c630246100000000000000000000000000000000000000000
001d000023525235252352523525235252352523525235251b52525525255251d5251d5251d5251d5251d525255252552522525225252252522525225252252522525225252252522525225251e5251e5251e525
001d00000b0300b0300b0300b0300b0300b0300b0300b0300b0300b0300d0300d0300d0300d0300d0300d0300d0300d0300f0300f0300f0300f0300f0300f0300f0300f0300f0300f0300f0300f0300f0300f030
001d00002a0422a0422a0422a0422a042290422904225042250422a0422a0422a0422a0422a0422a0422a0422a0422a0422c0422c0422a0422a0422a0422a0422704227042270422704227042250422504225042
001d0000255252552523525235252352523525235251b5251b52525525255252552525525255252552525525255252552522525225252252522525225251b5251b5251b5251b5251b5251b5251b5252252522525
001d00000f0300f0300b0300b0300b0300b0300b0300b0300b0300b0300d0300d0300d0300d0300d0300d0300d0300d0300f0300f0300f0300f0300f0300f0300f0300f0300f0300f0300f0300f0300f0300f030
001d0000250422a042270422704227042290422904225042250422a0422a042250422504225042250422504231042310422a0422a0422a042250422e0422e0422e0422e0422e0422e0422e0422e0422e0422e042
001d000022525225251e5251b5251b52527525275251b5251b52525525255251d5251d5251d5251d5251d52525525255252252522525225252252522525225252252522525225252252522525225252252525525
001d00000f0300f0300f0300b0300b0300b0300b0300b0300b0300b0300d0300d0300d0300d0300d0300d0300d0300d0300f0300f0300f0300f0300f0300f0300f0300f030120301203012030120301203012030
001d00002e0422e0422f0422f0422f0422904229042250422504225042250422504225042250422c0422c0422a0422a0422a042270422704229042290422904229042270422704227042270422a0422a0422a042
001d000025525255252352523525235252352523525235252352523525225252252522525225252552525525255251b5251b52522525225252752527525275252752522525225252252522525275252552525525
001d00001203012030140301403014030140301403014030140301403012030120301203012030120301203012030120301203012030120301203012030120301203012030120301203012030120301203012030
00020000243452b345303453734500000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000
00030000140411a031200210000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000
000300000c251132511a2612125128231000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000
000200001904020030190200000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000
00060000183501c3501f3502434000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000
0008000018340133300c3200000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000
00020000240401d030240200000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000
00050000183501c3501f35024340000000000000000000002205022030290502d0403003030020300102d01029010300150000000000000000000000000000000000000000000000000000000000000000000000
000f00000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000
000f00002101021010210102101021010210102101021010210102101021010210102101021010210102101021010210102101021010210102101021010210102102021220212202122021225212202122021220
000f00000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000018a13000000000000000
000f00000000000000000000000000000000000000000000000000000000000000000000000000160101601500000000000000000000000000000000000000000000013020130250000000000000000000000000
000f00002122521220212202122021225212202122021220212250922509200092250920009235092250923509225092000923509200092350922509200092350923509225092000922509200092350922509235
000f000018a1300000000000000018a1300000000000000018a130000018a13000001893300000188430000018a13000001884300000189330000018a1300000188430000018a130000018933000001884300000
000f18000000000000000001502015025000000000000000000000000000000000000000018020180250000000000000000000000000000001601016015000000000000000000000000000000000000000000000
000f18000922509200092350920009235092250920009235092350922509200092250920009235092250923509225092000923509200092350922509200092350000000000000000000000000000000000000000
000f180018a13000001884300000189330000018a1300000188430000018a13000001893300000188430000018a13000001884300000189330000018a13000000000000000000000000000000000000000000000
000f00000000000000000001502015025000000000000000000000000000000180201802500000000000000000000000000000000000000000000013020130250000000000000000000000000000000000000000
000f00000923509225092000922509200092350922509235092250920009235092000923509225092000923509235092250920009225092000923509225092350922509200092350920009235092250920009235
000f0000188430000018a23000001894300000188530000018a23000001885300000189430000018a2300000188530000018a23000001894300000188530000018a23000001885300000189430000018a2300000
000f00000000000000000001502015025000000000000000000000000016010160150000000000000000000000000000000000018020180250000000000000000000000000000001302013025000000000000000
000f0000188530000018a23000001894300000188530000018a23000001885300000189430000018a2300000188530000018a23000001894300000188530000018a23000001885300000189430000018a2300000
000f00000000000000000001502015025000000000000000000000000000000180201802500000000000000000000000000000000000160201602500000000000000000000000000000015020150250000000000
000f19000000000000000001302013025000000000000000000000000016010160150000000000000000000000000000001502015025000000000000000100201002500000000000000000000000000000000000
000f19000923509225092000922509200092350922509235092250920009235092000923509225092000923509235092250920009225092000923509225092350922500000000000000000000000000000000000
000f1900188530000018a23000001894300000188530000018a23000001885300000189430000018a2300000188530000018a23000001894300000188530000018a2300000000000000000000000000000000000
001500000404004040040400404004040040400404004040040400404004040040400404004040040400404004040040400404004040040400404004040040400404004040040400404004040040400404004040
0015000020035200352303523035230352303523035230352303523035230352303520035230352303522035230352303523035230352303523035230352303522035220351e0352003520035220352203523035
001500002a5202a5202a520275202752027520275202a5202a5202a5202a5202a5202a5202a5202a5202a5202a520255202552027520275202752027520275202752027520275202c52027520275202c5202c520
001500000404008040080400804008040080400804008040080400804008040080400804008040080400804008040080400804008040080400804008040080400804008040080400804008040080400804008040
001500002303520035200352003520035230352303523035230351e0351e035200351e0352303523035220352203522035220352203522035230352303522035220351e0351e0352003523035220352203523035
001500002c5202c5202c5202752027520275202752027520275202752027520275202752027520275202c5202c520255202552027520275202752027520275202752027520275202752027520275202752027520
001500000804004040040400404004040040400404004040040400404004040040400404004040040400404004040040400404004040040400404004040040400404004040040400404004040040400404004040
001500002303520035230352303523035230352303522035220352303522035200352003523035230352203522035220352203523035230352303523035220352203522035220352003520035220352203523035
001500002c5202c5202c5202752027520275202752027520275202752027520275202752027520275202752027520255202552027520275202752027520275202752027520275202752027520275202752025520
001500000404008040080400804008040080400803008030080300803008030080300803008030080300803008030080300803008030080300803008030080300803008030080300803008030080300803008030
00150000230352003523035270352303520035220352703520035270351e035270352003527035220352703520035270351e035250352003527035220352703520035270351e0352703520035250352203527035
0015000025520255202552027520275102751000500005002c2142c21400202002022721427214002022a2122a2122a21200202002022e2122e2122a212002022c2222c222002022c22227222272220020200202
001500000803008030080300803008030080300803008030060300603006030060300603006030060300603006030060300603006030060300603006030060300803008030080300803008030080300803008030
0015000020035270351e03527035200352603522035270351e0352503520035270351e0352503522035270351e035250352003527035220352703520035250352003527035220352703520035250351e03525035
001500002a2222a2220020226222272222722200202002022e2222e22200202002022c2222c22200202272222a2222a2220020200202272222722226222002022e2222e2222c2122c2122a2152a2150020200202
001510000404004040040400404004040040400404004040040400404004040040400404004040040400404000000000000000000000000000000000000000000000000000000000000000000000000000000000
001510002003523035270352303520035230352503523035200352303522035200351e03520035230351e03500000000000000000000000000000000000000000000000000000000000000000000000000000000
001510002c5142c514005002a5202a5202a520005002752027520275202a5202a5202a5202a520005000050000000000000000000000000000000000000000000000000000000000000000000000000000000000
000900002c6751c67109071020710c660086600666004660036500665001650036500064002640006400464000630016300063008630006200262000620066200062000610046100061000610006100061500600
00150e000404004040040400404004040040400404004040040400404004040040400404004040000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000
00150e0023035230352303523035230352303522035220351e0352003520035220352203523035000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000
00150e002552027520275202752027520275202752027520275202c52027520275202c5202c520000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000
__music__
00 18191a43
00 1b1c1d43
00 1e1f2043
01 21222343
00 24222543
00 26222543
02 27282943
01 2a2b2c43
00 2d2e2f43
00 30313243
00 33343543
00 36373843
02 393a3b43
00 3d3e3f43
00 2d2e2f43
00 30313243
00 33343543
00 36373843
02 393a3b43
01 03050643
00 07080943
00 0a0b0c43
02 0d0e0f43
